{
  "initialUrl": "https://playpickups.app/",
  "initialResearchSummary": "‎Play Pickups on the App Store Apple Store Mac iPad iPhone Watch Vision AirPods TV & Home Entertainment Accessories Support 0+ App Store Preview Play Pickups 4+ Play Sports with New Friends‪!‬ Kush Desai Free iPhone Screenshots Description Play Pickups - Connect, Socialise & Play Sports with New Friends! Say goodbye to boring meet-ups and hello to thrilling sports connections! Play Pickups: Your Ultimate Social Sports Networking App Play Pickups is the go-to app for sports lovers looking to make meaningful connections through sports. We’re dedicated to helping you meet new people, discover local games, and get out there to play – all for free! Take a break from typical social settings and make new friends on the field, court, or pitch. Whether you’ve just moved to a new city, started university, or simply don’t have friends who play your favourite sport, Play Pickups is here to bridge that gap. Get ready to discover, connect, and play with like-minded sports enthusiasts who share your passion for sports. With over 20 different sports to choose from, Play Pickups takes socialising to the turfs and courts for a healthier, more exciting way to meet new people! Key Features: - Instantly Connect with Nearby Players: Find people around you who share your love for sports and want to play right now! With our location-based technology, you can easily meet players with similar skill levels who are ready to hit the courts or fields. - Discover Local Pick-Up Games & Events: Explore and join local pick-up games, tournaments, and events happening nearby. It’s easy to RSVP, check event details, and join in the fun with just a few taps. - Create or Join Sports Groups: Build your community of sports buddies by joining or creating groups based on your favourite sport, skill level, or location. Stay connected and organised with notifications for upcoming games and events. - Personalised Match Suggestions: Get customised suggestions on players, events, and groups that align with your interests and skill level. Never miss a chance to play and meet new people! - Integrated Messaging & Scheduling: Chat with other players, set up games, and manage your schedule – all within the app. You’ll never need to switch apps to make plans again! - Play Over 20 Sports: From popular sports like Football (Soccer), Tennis, and Cricket to unique options like Pickleball, Padel, and Flag Football, there’s something for everyone on Play Pickups. Plus, we even cater to indoor games like Chess and Poker for all-around fun! Who Should Use Play Pickups? - New Residents: Just moved for work? Don’t know where to start meeting people? Play Pickups connects you with locals who love your favourite sports, making it easy to break the ice and build new friendships. - University/College Students: Connect with fellow students who love the same sports, or explore new sports with new friends. Your campus experience just got more exciting! - Social Sports Enthusiasts: Looking for a healthier way to socialise? Join the community that’s taking fun beyond bars and cafes and onto the field. Playing sports together is a great way to make lasting connections! Why Choose Play Pickups? Play Pickups is completely free to join and free to use. We believe in bringing people together through sports, making it easy to find your community, get active, and have fun. Unlike other social apps, we prioritise connections based on shared interests, skill levels, and location, so you can experience a whole new way of socialising. Download Play Pickups today and start connecting with people who share your love for sports! --- Technical Details: - Category: Sports, Social Networking - Age Rating: Suitable for all ages - Price: Free - Languages: English (more languages coming soon) Join the Play Pickups community now and discover the healthier, more exciting way to socialise! App Privacy The developer, Kush Desai, indicated that the app’s privacy practices may include handling of data as described below. For more information, see the developer’s privacy policy. Data Linked to You The following data may be collected and linked to your identity: Contact Info User Content Identifiers Data Not Linked to You The following data may be collected but it is not linked to your identity: Usage Data Diagnostics Privacy practices may vary, for example, based on the features you use or your age. Learn More Information Seller Kush Desai Size 8.6 MB Category Sports Compatibility iPhone Requires iOS 13.0 or later. iPod touch Requires iOS 13.0 or later. Languages English Age Rating 4+ Copyright © Kush Desai Price Free Developer Website App Support Privacy Policy Developer Website App Support Privacy Policy You Might Also Like Pi-Play:Play Padel, Pickleball Sports Hockey Community Sports FIFA Player App Sports Scores App for Pro Basketball Sports Scores and Odds Sports Betting Sports TNNS: Tennis Live Scores Sports Copyright © 2025 Apple Inc. All rights reserved. Internet Service Terms App Store & Privacy Cookie Warning Support More ways to shop: Find an Apple Store or other retailer near you. Or call 1-800-MY-APPLE. Choose your country or region Copyright © 2024 Apple Inc. All rights reserved. Privacy Policy Terms of Use Sales and Refunds Legal Site Map",
  "researchResults": [
    {
      "url": "https://www.youtube.com/watch?v=7VycxKuN-7Q",
      "content": "... mode! Buy here: https://www.vat19.com/item/shock-ball-electric-shock-hot-potato-game More Hidden in Plain Sight: https://www.youtube.com/watch?v",
      "title": "... mode! Buy here: https://www.vat19.com/item/shock-ball-electric-shock-hot-potato-game More Hidden in Plain Sight: https://www.youtube.com/watch?v"
    },
    {
      "url": "https://ecosports.com/blogs/vegan-athletes/how-to-find-pickup-basketball-games-in-your-area?srsltid=AfmBOoqyxSPNY4-85EhW2pOAJkpqNh-NeWbhnKBh3gu0mnsNQsEH4EjJ",
      "content": "INFINITEHOOPS · FIND PICKUP BASKETBALL GAMES · INFINITEHOOPS FIND PICKUP BASKETBALL GAMES ENTER THE PICKUP BASKETBALL APP INFINITEHOOPS · FIND PICKUP BASKETBALL GAMES The InfiniteHoops app locates nearby pickup basketball games and groups of people wanting to play letting you to connect and play basketball. The original pickup basketball app and website. The InfiniteHoops iPhone app launched in 2011 and InfiniteHoops.com in 2003. FEATURES - Search nearby pickup basketball games and groups - Join groups - See your upcoming game schedule - Mark yourself as In, Out or Undecided for games - See who's in and who's out in your upcoming games - Message other players in your groups - Read hoop news © BROADSIDE LLC · SEATTLE WASHINGTON",
      "title": "INFINITEHOOPS · FIND PICKUP BASKETBALL GAMES · INFINITEHOOPS FIND PICKUP BASKETBALL GAMES ENTER THE PICKUP BASKETBALL APP INFINITEHOOPS · FIND PICKUP BASKETBALL GAMES The InfiniteHoops app locates nearby pickup basketball games and groups of people wanting to play letting you to connect and play basketball. The original pickup basketball app and website. The InfiniteHoops iPhone app launched in 2011 and InfiniteHoops.com in 2003. FEATURES - Search nearby pickup basketball games and groups - Join groups - See your upcoming game schedule - Mark yourself as In, Out or Undecided for games - See who's in and who's out in your upcoming games - Message other players in your groups - Read hoop news © BROADSIDE LLC · SEATTLE WASHINGTON"
    },
    {
      "url": "https://www.slamonline.com/streetball/download-slam-city-game-app-find-pickup-games/",
      "content": "Download SLAM City Game App To Find Pickup Games Want to find the best court for a pickup run? Compare your player rankings to others in your area? SLAM City Game is the best way to find the best pickup runs and where to catch the game. The app is now free for download from the Apple App Store. SLAM City Game is full of features and allows the user to: • Find the best urban courts • Post pickup games / invite friends • Find pickup games to join • Post a profile with a pic and skills • Get the latest SLAM Magazine news • Check player social rankings powered by Hookit • Get a feed of updates, photos & videos from your favorite pros and teams • Get the latest SLAM Magazine news and updates on demand SLAM Night in Houston, LSU and All-Star: Here’s What We’ve Been Up to in February The Battle for LA Continues With USC-UCLA Rematch Golden State Entertainment Captures the Culture and Artistry of the Bay",
      "title": "Download SLAM City Game App To Find Pickup Games Want to find the best court for a pickup run? Compare your player rankings to others in your area? SLAM City Game is the best way to find the best pickup runs and where to catch the game. The app is now free for download from the Apple App Store. SLAM City Game is full of features and allows the user to: • Find the best urban courts • Post pickup games / invite friends • Find pickup games to join • Post a profile with a pic and skills • Get the latest SLAM Magazine news • Check player social rankings powered by Hookit • Get a feed of updates, photos & videos from your favorite pros and teams • Get the latest SLAM Magazine news and updates on demand SLAM Night in Houston, LSU and All-Star: Here’s What We’ve Been Up to in February The Battle for LA Continues With USC-UCLA Rematch Golden State Entertainment Captures the Culture and Artistry of the Bay"
    },
    {
      "url": "https://www.endalgo.com/blog/how-to-find-pickup-soccer-games",
      "content": "How to find pickup soccer games | ENDALGO Blog Start a new group Listing Explore Support How to find pickup soccer games Oct 13th, 2022 - Soccer Among the active soccer player audience we conducted a study on, the data shows 54% of that player pool played pickup soccer the past year (with soccer league (40%) and club soccer (36.5%) coming in as second and third). This tells us how much pickup soccer is popular among soccer players as a medium to enjoy the sport. This was actually a higher number than we expected; considering the researched pool is a group of active players who most likely play more than twice a month, we expected more of the organized type of soccer, such as club soccer, leagues, and tournaments, would have more participation among the pool. It just confirms how pickup games make soccer accessible not only to casual players but also to more committed players. So, we went further into finding out how players find those games and why they even play pickup games. How games are found right now. How players have been finding pickup games has been traditionally and has stayed that way: word of mouth. When we asked the active soccer players how they find local pickup soccer games, 49% answered that they get information on games through word of mouth, followed by online community (45%) and social media (37%) (note that players were allowed to choose multiple options). Even in this era of digital prosperity, it is quite surprising that players still find pickup soccer through their friends' and teammates' networks. Why players want to find and play pickup games. As you might have expected, pickup games are usually far from trying to be competitive and playing to win a match. Hence, many people play to stay in shape and socialize. When the pool of active players was asked what their favorite thing about the player (pickup) soccer is, staying in shape consisted for 40.5%, and meeting new people (social life) consisted of 40%. Sports are fun because of the aspect of competing and striving to win, but pickup soccer was more of a stage that is casual among the types of soccer that are played. ENDALGO is the best pickup soccer app. Perhaps, finding a pickup game through friends can be the most effective way, but players without that network or newcomers to specific areas may not be able to leverage that channel of finding games through word of mouth. Also, pickup games can vary in styles and skill levels; as mentioned earlier, the majority of the audience may want to have a good time and socialize while trying to stay in shape, but that doesn’t mean some players want to play competitively and play more seriously. ENDALGO has the ability to list and recommend local soccer events and pickup games based on user location. Moreover, on the games that pickup groups, teams, and clubs host on ENDALGO, they can be specific on the type of games and events they are providing so that the audience can filter through their needs, benefiting both the players and the hosts. Conclusion Although the information we found was from active soccer players, the results seem fitting even for beginner and more casual soccer players. Pickup soccer is undeniably one of the most effective and fun ways for all soccer players and audiences to stay active and engage with the beautiful sport. Hope this information got more people to think that soccer is more approachable even without skills and experience. We recommend giving ENDALGO a try to see what’s happening in your area and, furthermore, RSVP’ing to a game to have fun and even meet new people to play soccer with. Please reach out if you have any questions to hello@endalgo.com. Latest Blogs ###### Host Pickup Soccer Games Jul 30th, 2022 ###### The Best App to Manage Your Soccer Club Sep 15th, 2022 ###### Where to Organize Your Group Online Oct 18th, 2022 ###### Communication Tips for Youth Coach Jan 14th, 2022 ###### How To Be A Community Leader Apr 14th, 2022 HomeCommunityChatProfile ENDALGO How it worksPricingOur communityAppsCompanyBlog Explore GroupsEventsExperiencesRegistrationsTopicsCitiesSportsCustoms Support FAQHelp CenterContact Us @ 2025 ENDALGO, Inc. All rights reserved ∙ Privacy ∙ Terms ∙ Sitemap",
      "title": "How to find pickup soccer games | ENDALGO Blog Start a new group Listing Explore Support How to find pickup soccer games Oct 13th, 2022 - Soccer Among the active soccer player audience we conducted a study on, the data shows 54% of that player pool played pickup soccer the past year (with soccer league (40%) and club soccer (36.5%) coming in as second and third). This tells us how much pickup soccer is popular among soccer players as a medium to enjoy the sport. This was actually a higher number than we expected; considering the researched pool is a group of active players who most likely play more than twice a month, we expected more of the organized type of soccer, such as club soccer, leagues, and tournaments, would have more participation among the pool. It just confirms how pickup games make soccer accessible not only to casual players but also to more committed players. So, we went further into finding out how players find those games and why they even play pickup games. How games are found right now. How players have been finding pickup games has been traditionally and has stayed that way: word of mouth. When we asked the active soccer players how they find local pickup soccer games, 49% answered that they get information on games through word of mouth, followed by online community (45%) and social media (37%) (note that players were allowed to choose multiple options). Even in this era of digital prosperity, it is quite surprising that players still find pickup soccer through their friends' and teammates' networks. Why players want to find and play pickup games. As you might have expected, pickup games are usually far from trying to be competitive and playing to win a match. Hence, many people play to stay in shape and socialize. When the pool of active players was asked what their favorite thing about the player (pickup) soccer is, staying in shape consisted for 40.5%, and meeting new people (social life) consisted of 40%. Sports are fun because of the aspect of competing and striving to win, but pickup soccer was more of a stage that is casual among the types of soccer that are played. ENDALGO is the best pickup soccer app. Perhaps, finding a pickup game through friends can be the most effective way, but players without that network or newcomers to specific areas may not be able to leverage that channel of finding games through word of mouth. Also, pickup games can vary in styles and skill levels; as mentioned earlier, the majority of the audience may want to have a good time and socialize while trying to stay in shape, but that doesn’t mean some players want to play competitively and play more seriously. ENDALGO has the ability to list and recommend local soccer events and pickup games based on user location. Moreover, on the games that pickup groups, teams, and clubs host on ENDALGO, they can be specific on the type of games and events they are providing so that the audience can filter through their needs, benefiting both the players and the hosts. Conclusion Although the information we found was from active soccer players, the results seem fitting even for beginner and more casual soccer players. Pickup soccer is undeniably one of the most effective and fun ways for all soccer players and audiences to stay active and engage with the beautiful sport. Hope this information got more people to think that soccer is more approachable even without skills and experience. We recommend giving ENDALGO a try to see what’s happening in your area and, furthermore, RSVP’ing to a game to have fun and even meet new people to play soccer with. Please reach out if you have any questions to hello@endalgo.com. Latest Blogs ###### Host Pickup Soccer Games Jul 30th, 2022 ###### The Best App to Manage Your Soccer Club Sep 15th, 2022 ###### Where to Organize Your Group Online Oct 18th, 2022 ###### Communication Tips for Youth Coach Jan 14th, 2022 ###### How To Be A Community Leader Apr 14th, 2022 HomeCommunityChatProfile ENDALGO How it worksPricingOur communityAppsCompanyBlog Explore GroupsEventsExperiencesRegistrationsTopicsCitiesSportsCustoms Support FAQHelp CenterContact Us @ 2025 ENDALGO, Inc. All rights reserved ∙ Privacy ∙ Terms ∙ Sitemap"
    },
    {
      "url": "https://health.usnews.com/wellness/fitness/articles/2017-06-21/5-tips-for-finding-the-right-pickup-game-or-sports-partner",
      "content": "5 Tips for Finding the Right Pickup Game or Sports Partner Skip to content Health Hospitals Find a Hospital Hospital Rankings Children's Hospital Rankings Best Hospitals by State Best Hospitals for Maternity How we Rank Hospitals Healthcare of Tomorrow For Hospitals: Update Your Profile ASCs Best ASCs Find an ASC Best ASCs for Colonoscopy & Endoscopy Best ASCs for Ophthalmology Best ASCs for Orthopedics & Spine Best ASCs for Urology Doctors Find a Doctor Doctors by Specialty Doctors by Location Cardiologists Dentists Family Medicine Oncologists Orthopedic Surgeons Pediatricians Senior Living Find the Best Senior Living Near You Assisted Living Independent Living Memory Care Continuing Care Retirement Communities Find the Best Nursing Homes Near You Senior Care Advice About the Ratings: How We Rate Nursing Homes How We Rate Senior Living Communities Diets & Nutrition Best Diets Best Diets Overall Best Weight-Loss Diets Best Fast Weight Loss Diets All Diets Diets Expert Panel Popular Diets Recipes Mediterranean Diet WeightWatchers Diet Keto Diet Dukan Diet Nutrisystem Diet DASH Diet Medicare Find the Right Plan Best Medicare Advantage Plan Companies 2025 Best Medicare Part D Prescription Drug Plan Companies 2025 Medicare Supplement Plans (Medigap) Find a Plan Carrier Reviews Aetna Blue Cross Blue Shield Cigna Humana Kaiser Permanente United Healthcare Medicare 101 What Does Medicare Cover? Medicare Basics How to Shop for Medicare Medicare vs. Medicare Advantage: Which Is Right for You? Health & Wellness Best OTC Medicine & Health Products Wellness Food Fitness Mind Pregnancy Resource Center Health Conditions Medical Review Medical Review Editorial Process Medical Review Board Sign In 5 Tips for Finding the Right Pickup Game or Sports Partner Fitness Wellness Home 5 Tips for Finding the Right Pickup Game or Sports Partner Network, use technology and don't be a jerk. By Ruben Castaneda | June 21, 2017 By Ruben Castaneda | June 21, 2017, at 9:41 a.m. Save More 5 Tips for Finding the Right Pickup Game or Sports Partner More If you’re a weekend athlete who loves to play basketball, tennis, soccer or another sport but would rather compete on a pickup level instead of joining a league, what’s the best way to find a game or partner that suits you? A generation ago, many amateur sportsmen and sportswomen found athletic competition by word of mouth or by hanging out at courts or fields of play in the hopes of getting into a game. The options for finding the right game or sports partner today are greater, thanks to technology. With a few keystrokes of your laptop or by punching in letters on your cellphone, you can locate potential tennis partners at your skill level in your neighborhood who are looking for someone to hit with – or find the nearest pickup game of ultimate (formerly known widely as ultimate Frisbee). You can also go online to find pickup soccer contests, including games for men and women and coed competitions. Finding the right game or athletic partner is crucial. Joining a hoops, soccer or volleyball game where you’re completely overmatched, or hitting with a tennis partner you routinely crush, wouldn’t be any fun. “Competing with athletes of similar experience, skill and competitive expectations is one of the most crucial factors in having a rewarding sports experience,” says Christopher Cousins, a physical therapist in the District of Columbia who treats many people who injured themselves playing a pickup sport. [See: The Many Ways Exercise Fights Depression.] Good pickup games often have a core group of people who’ve played together for years, even decades. For example, Larry Gondelman is “commissioner” of a pickup basketball game that he and some fellow Georgetown University Law Center students launched in 1974, back when Richard Nixon was in the White House (though not for long). They’d play four-on-four, half-court, on one of the outdoor courts outside McDonough Gymnasium on the Georgetown University campus in the District of Columbia. They’d compete as long as it was dry and the temperature was at least 30 degrees. Eventually, Gondelman and his fellow hoopsters moved to an indoor gym. Today, the band of basketball brothers includes about 18 core members, including a handful who, like Gondelman, have played together more than 40 years. To keep the game vibrant, Gondelman over the years has invited younger players, including the sons of some of the original members. And the attorney has recruited people he played with at the downtown YMCA. Others who’ve learned of the game from one of the regulars joined after asking Gondelman, 65, if they could play. The competition at Gondelman's hoops game is spirited, not cutthroat. Many of the hoopsters who’ve played in Gondelman’s game have formed or deepened friendships over the years; the players used to have an annual banquet, and some go to the beach together with their respective families. This sort of camaraderie is evident with many pickup groups. Nick Salafsky, 51, says he’s gotten to know the character of fellow ultimate players at his two weekly pickup games in the District of Columbia. “There are guys I’ve played disc with for 20 years,” he says. “You don’t know their last name, if they're married or single, if they’re gay or straight, if they’re high-powered lawyers or bike couriers. Yet you know everything about their character, who cheats and who doesn’t, who you’d want to be in a foxhole with and who you wouldn’t. You don’t know anything conventional about them, but you know everything important about them.” [See: 7 Signs You Should Stop Exercising Immediately.] Whether you’re moving to a new town and need to find a new game, are taking up a new sport or are coming back from injury or looking for a fun way to exercise, finding the right group for pickup games can seem daunting. Longtime pickup athletes and a tennis instructor suggest these strategies: Network as if you were job-hunting. Whatever the sport, “ask your friends, read local media and blogs, research like you would for a job,” Gondelman says. Asking friends and co-workers about pickup games can still be an effective way to find one that ‘s a good fit for you. Also, your pals and colleagues can invite you to the game or introduce you to its commissioner. Word of mouth is how Ella Lipin learned some of her co-workers at a think tank in the District of Columbia were playing in a weeknight pickup hoops game. \"I liked that it was welcoming of all ages, genders and talent level, so I've continued to drop in whenever I can,\" says Lipin, 28. \"I briefly played JV basketball in high school, but unfortunately my love of basketball always far exceeded my skill.\" Look for games and sports partners online and on apps. There are plenty of online resources and apps to find pickup games in a variety of sports. For example, pickupultimate.com lists more than 50 cities in the mainland U.S., Alaska and Hawaii where ultimate players can find a game. Some ultimate pickup games, such as one in suburban Virginia, also use Facebook to communicate and plan games, says Jacob Kass, 27, a member of that group. There are Meetup groups online for people looking for pickup soccer, volleyball and tennis games. Pedro Ast, founder of the Bvddy app, says the service helps people find pickup games at their skill level in more than 70 sports, including basketball, badminton, field hockey and lacrosse. People can also use the app to find partners to go hiking or workout partners, he says. Hang out at a public court or field. If you learn of a pickup game at a particular court or field, show up with your sneakers or cleats laced up, hang out and see if you can get into a game. If someone didn’t show up as usual, one of the teams might need a player. Some pickup games – such as those played on public fields or courts – may have a core group of players but, because they’re on a public facility, can’t keep the competition closed. So, you might be able to watch a game and call “next” and get in the next game. At some public tennis courts, you can show up with your racket and a can of balls and, with some luck, find someone else who’s looking for a partner to hit with. [See: 6 Reasons You're Procrastinating on Your Health Goals – and How to Stop.] Ask a coach. If you’re taking lessons to improve your game, ask your coach if he or she knows of anyone who’d be a good competitive match, says Chris Pelsor, a tennis pro with Affordable Tennis Lessons in Los Angeles. “Your coach will have other students, which comprise a network of players at all levels,” he says. “When you’re starting out and you’re at a certain level it might be difficult to find someone to play with because you’re self-conscious about whether you’re good enough. Your coach will know of other people looking for someone to play with.” Don’t be a jerk. When you’re a newbie at a pickup game, keep in mind that the group you’re joining is likely to be assessing not just your sports skills in deciding whether to invite you back. For example, Gondelman puts newbies on a “probationary” period to see if they fit in with the group – that is, whether they're at roughly the same skill level as the other players and get along with the gang. Gondelman's group pays to rent the basketball court, and the commissioner doesn't ask a newbie to chip in financially the first time he or she plays, in case it turns out to be the last time he or she is invited. “Over the years, there have been two players who didn’t make it off probation,” Gondelman says. “One because he was a terrible player, the other because he had a bit of an attitude.” 13 Fun Sports That Burn Calories ### 13 Fun Sports That Burn Calories View All 15 Slides Tags: exercise and fitness, sports Most Popular Food Is Any Alcohol Good for You? Wellness How to Prevent Medical Errors Mind Tips to Heal a Broken Heart Pregnancy Resource Center Morning Sickness Remedies Senior Care 9 Healthy Aging Tips ##### health disclaimer » ##### Disclaimer and a note about your health » Read More You May Also Like ### Exercising on GLP-1s People taking weight loss medications like Ozempic may want to modify their exercise routine in order to reap the maximum benefits of these drugs while staying healthy overall. Here's how to safely exercise while on GLP-1s. Cedric X. Bryant Feb. 26, 2025 ### Walking Toward Better Health Putting one foot in front of the other is a simple way to reduce your risk of chronic disease. Here are tips from an expert on incorporating more walking into your daily routine. Cedric X. Bryant Jan. 17, 2025 ### Staying Active Through the Holidays Sticking with an exercise routine throughout the holiday season may seem difficult as the weather gets cold and holiday festivities begin. These strategies can help you stay on track through the winter holidays. Cedric X. Bryant Dec. 19, 2024 ### Making the Most of Your Fitness Tracker When used correctly, a fitness tracker can be a constant and positive reminder of your ongoing health journey. Here's how to find the best fitness tracker for you and how to make the most of your device. Cedric X. Bryant Nov. 19, 2024 ### Exercises for Osteoarthritis Exercising when you have osteoarthritis can reduce your pain and improve mobility. Here are the best and worst cardio exercises for osteoarthritis, as well as a few exercises that can help reduce pain. Vanessa Caceres Nov. 6, 2024 ### Exercises That Burn the Most Calories All physical activity burns calories, but some exercises burn more than others. Here's a list of top calorie-burning exercises. Cedric X. Bryant Oct. 24, 2024 ### Yoga for Stress Relief Yoga can help when you're stressed, especially during the presidential election. Here's all you should know. Jake PanasevichOct. 3, 2024 ### Foam Rollers Foam rollers can help alleviate muscle tension when used before or after working out. Here's how to use them properly and choose the right foam roller for you. Cedric X. Bryant Sept. 20, 2024 ### Beginner's Guide to Yoga Yoga can be a great experience for physical, mental, emotional and spiritual health. Here's everything you need to know before starting yoga, from how to prepare to what to bring. Jake PanasevichAug. 23, 2024 ### How to Make Exercise a Habit Going to the gym once is a good start, but exercising consistently can help you lose weight and stay healthier and happier. Here are some tips from a fitness expert that will help you learn how to make exercise a habit. Cedric X. Bryant Aug. 15, 2024 Load More Hospitals Find a Hospital Best Hospitals Best Children's Hospitals Advice for Hospital Patients Advice for Health Professionals How We Rank For Hospitals: Update Profile Ambulatory Surgery Centers Find an ASC How we evaluate ASCs Doctors Find a Doctor Primary Care Physicians Pediatricians How to Choose a Doctor Preparing for a Doctor Visit Doctors Data and Methodology Dentists Find a Dentist Orthodontists How to Choose the Right Dentist Senior Living Find Memory Care Communities Find Independent Living Communities Find Continuing Care Retirement Communities Find Assisted Living Communities Senior Living Search For Companies Nursing Homes Find a Nursing Home Wellness Food Fitness Mind Diets Best Diets Overall Best Weight-Loss Diets Best Diet Programs Product Rankings & Reviews Clear Braces Health Insurance Find Plans by State Medicare Plans Choosing a Health Plan Conditions Over the Counter Drugs Breast Cancer Lung Cancer Depression ADHD Diabetes Heart Disease Hospitals Ambulatory Surgery Centers Doctors Dentists Senior Living Nursing Homes Wellness Diets Product Rankings & Reviews Health Insurance Conditions About U.S. News Editorial Guidelines Contact Press Advertise Newsletters Jobs Site Map Store Copyright 2025 © U.S. News & World Report L.P.Terms & Conditions/Privacy Policy/U.S. State Privacy Notice/Your Privacy Choices",
      "title": "5 Tips for Finding the Right Pickup Game or Sports Partner Skip to content Health Hospitals Find a Hospital Hospital Rankings Children's Hospital Rankings Best Hospitals by State Best Hospitals for Maternity How we Rank Hospitals Healthcare of Tomorrow For Hospitals: Update Your Profile ASCs Best ASCs Find an ASC Best ASCs for Colonoscopy & Endoscopy Best ASCs for Ophthalmology Best ASCs for Orthopedics & Spine Best ASCs for Urology Doctors Find a Doctor Doctors by Specialty Doctors by Location Cardiologists Dentists Family Medicine Oncologists Orthopedic Surgeons Pediatricians Senior Living Find the Best Senior Living Near You Assisted Living Independent Living Memory Care Continuing Care Retirement Communities Find the Best Nursing Homes Near You Senior Care Advice About the Ratings: How We Rate Nursing Homes How We Rate Senior Living Communities Diets & Nutrition Best Diets Best Diets Overall Best Weight-Loss Diets Best Fast Weight Loss Diets All Diets Diets Expert Panel Popular Diets Recipes Mediterranean Diet WeightWatchers Diet Keto Diet Dukan Diet Nutrisystem Diet DASH Diet Medicare Find the Right Plan Best Medicare Advantage Plan Companies 2025 Best Medicare Part D Prescription Drug Plan Companies 2025 Medicare Supplement Plans (Medigap) Find a Plan Carrier Reviews Aetna Blue Cross Blue Shield Cigna Humana Kaiser Permanente United Healthcare Medicare 101 What Does Medicare Cover? Medicare Basics How to Shop for Medicare Medicare vs. Medicare Advantage: Which Is Right for You? Health & Wellness Best OTC Medicine & Health Products Wellness Food Fitness Mind Pregnancy Resource Center Health Conditions Medical Review Medical Review Editorial Process Medical Review Board Sign In 5 Tips for Finding the Right Pickup Game or Sports Partner Fitness Wellness Home 5 Tips for Finding the Right Pickup Game or Sports Partner Network, use technology and don't be a jerk. By Ruben Castaneda | June 21, 2017 By Ruben Castaneda | June 21, 2017, at 9:41 a.m. Save More 5 Tips for Finding the Right Pickup Game or Sports Partner More If you’re a weekend athlete who loves to play basketball, tennis, soccer or another sport but would rather compete on a pickup level instead of joining a league, what’s the best way to find a game or partner that suits you? A generation ago, many amateur sportsmen and sportswomen found athletic competition by word of mouth or by hanging out at courts or fields of play in the hopes of getting into a game. The options for finding the right game or sports partner today are greater, thanks to technology. With a few keystrokes of your laptop or by punching in letters on your cellphone, you can locate potential tennis partners at your skill level in your neighborhood who are looking for someone to hit with – or find the nearest pickup game of ultimate (formerly known widely as ultimate Frisbee). You can also go online to find pickup soccer contests, including games for men and women and coed competitions. Finding the right game or athletic partner is crucial. Joining a hoops, soccer or volleyball game where you’re completely overmatched, or hitting with a tennis partner you routinely crush, wouldn’t be any fun. “Competing with athletes of similar experience, skill and competitive expectations is one of the most crucial factors in having a rewarding sports experience,” says Christopher Cousins, a physical therapist in the District of Columbia who treats many people who injured themselves playing a pickup sport. [See: The Many Ways Exercise Fights Depression.] Good pickup games often have a core group of people who’ve played together for years, even decades. For example, Larry Gondelman is “commissioner” of a pickup basketball game that he and some fellow Georgetown University Law Center students launched in 1974, back when Richard Nixon was in the White House (though not for long). They’d play four-on-four, half-court, on one of the outdoor courts outside McDonough Gymnasium on the Georgetown University campus in the District of Columbia. They’d compete as long as it was dry and the temperature was at least 30 degrees. Eventually, Gondelman and his fellow hoopsters moved to an indoor gym. Today, the band of basketball brothers includes about 18 core members, including a handful who, like Gondelman, have played together more than 40 years. To keep the game vibrant, Gondelman over the years has invited younger players, including the sons of some of the original members. And the attorney has recruited people he played with at the downtown YMCA. Others who’ve learned of the game from one of the regulars joined after asking Gondelman, 65, if they could play. The competition at Gondelman's hoops game is spirited, not cutthroat. Many of the hoopsters who’ve played in Gondelman’s game have formed or deepened friendships over the years; the players used to have an annual banquet, and some go to the beach together with their respective families. This sort of camaraderie is evident with many pickup groups. Nick Salafsky, 51, says he’s gotten to know the character of fellow ultimate players at his two weekly pickup games in the District of Columbia. “There are guys I’ve played disc with for 20 years,” he says. “You don’t know their last name, if they're married or single, if they’re gay or straight, if they’re high-powered lawyers or bike couriers. Yet you know everything about their character, who cheats and who doesn’t, who you’d want to be in a foxhole with and who you wouldn’t. You don’t know anything conventional about them, but you know everything important about them.” [See: 7 Signs You Should Stop Exercising Immediately.] Whether you’re moving to a new town and need to find a new game, are taking up a new sport or are coming back from injury or looking for a fun way to exercise, finding the right group for pickup games can seem daunting. Longtime pickup athletes and a tennis instructor suggest these strategies: Network as if you were job-hunting. Whatever the sport, “ask your friends, read local media and blogs, research like you would for a job,” Gondelman says. Asking friends and co-workers about pickup games can still be an effective way to find one that ‘s a good fit for you. Also, your pals and colleagues can invite you to the game or introduce you to its commissioner. Word of mouth is how Ella Lipin learned some of her co-workers at a think tank in the District of Columbia were playing in a weeknight pickup hoops game. \"I liked that it was welcoming of all ages, genders and talent level, so I've continued to drop in whenever I can,\" says Lipin, 28. \"I briefly played JV basketball in high school, but unfortunately my love of basketball always far exceeded my skill.\" Look for games and sports partners online and on apps. There are plenty of online resources and apps to find pickup games in a variety of sports. For example, pickupultimate.com lists more than 50 cities in the mainland U.S., Alaska and Hawaii where ultimate players can find a game. Some ultimate pickup games, such as one in suburban Virginia, also use Facebook to communicate and plan games, says Jacob Kass, 27, a member of that group. There are Meetup groups online for people looking for pickup soccer, volleyball and tennis games. Pedro Ast, founder of the Bvddy app, says the service helps people find pickup games at their skill level in more than 70 sports, including basketball, badminton, field hockey and lacrosse. People can also use the app to find partners to go hiking or workout partners, he says. Hang out at a public court or field. If you learn of a pickup game at a particular court or field, show up with your sneakers or cleats laced up, hang out and see if you can get into a game. If someone didn’t show up as usual, one of the teams might need a player. Some pickup games – such as those played on public fields or courts – may have a core group of players but, because they’re on a public facility, can’t keep the competition closed. So, you might be able to watch a game and call “next” and get in the next game. At some public tennis courts, you can show up with your racket and a can of balls and, with some luck, find someone else who’s looking for a partner to hit with. [See: 6 Reasons You're Procrastinating on Your Health Goals – and How to Stop.] Ask a coach. If you’re taking lessons to improve your game, ask your coach if he or she knows of anyone who’d be a good competitive match, says Chris Pelsor, a tennis pro with Affordable Tennis Lessons in Los Angeles. “Your coach will have other students, which comprise a network of players at all levels,” he says. “When you’re starting out and you’re at a certain level it might be difficult to find someone to play with because you’re self-conscious about whether you’re good enough. Your coach will know of other people looking for someone to play with.” Don’t be a jerk. When you’re a newbie at a pickup game, keep in mind that the group you’re joining is likely to be assessing not just your sports skills in deciding whether to invite you back. For example, Gondelman puts newbies on a “probationary” period to see if they fit in with the group – that is, whether they're at roughly the same skill level as the other players and get along with the gang. Gondelman's group pays to rent the basketball court, and the commissioner doesn't ask a newbie to chip in financially the first time he or she plays, in case it turns out to be the last time he or she is invited. “Over the years, there have been two players who didn’t make it off probation,” Gondelman says. “One because he was a terrible player, the other because he had a bit of an attitude.” 13 Fun Sports That Burn Calories ### 13 Fun Sports That Burn Calories View All 15 Slides Tags: exercise and fitness, sports Most Popular Food Is Any Alcohol Good for You? Wellness How to Prevent Medical Errors Mind Tips to Heal a Broken Heart Pregnancy Resource Center Morning Sickness Remedies Senior Care 9 Healthy Aging Tips ##### health disclaimer » ##### Disclaimer and a note about your health » Read More You May Also Like ### Exercising on GLP-1s People taking weight loss medications like Ozempic may want to modify their exercise routine in order to reap the maximum benefits of these drugs while staying healthy overall. Here's how to safely exercise while on GLP-1s. Cedric X. Bryant Feb. 26, 2025 ### Walking Toward Better Health Putting one foot in front of the other is a simple way to reduce your risk of chronic disease. Here are tips from an expert on incorporating more walking into your daily routine. Cedric X. Bryant Jan. 17, 2025 ### Staying Active Through the Holidays Sticking with an exercise routine throughout the holiday season may seem difficult as the weather gets cold and holiday festivities begin. These strategies can help you stay on track through the winter holidays. Cedric X. Bryant Dec. 19, 2024 ### Making the Most of Your Fitness Tracker When used correctly, a fitness tracker can be a constant and positive reminder of your ongoing health journey. Here's how to find the best fitness tracker for you and how to make the most of your device. Cedric X. Bryant Nov. 19, 2024 ### Exercises for Osteoarthritis Exercising when you have osteoarthritis can reduce your pain and improve mobility. Here are the best and worst cardio exercises for osteoarthritis, as well as a few exercises that can help reduce pain. Vanessa Caceres Nov. 6, 2024 ### Exercises That Burn the Most Calories All physical activity burns calories, but some exercises burn more than others. Here's a list of top calorie-burning exercises. Cedric X. Bryant Oct. 24, 2024 ### Yoga for Stress Relief Yoga can help when you're stressed, especially during the presidential election. Here's all you should know. Jake PanasevichOct. 3, 2024 ### Foam Rollers Foam rollers can help alleviate muscle tension when used before or after working out. Here's how to use them properly and choose the right foam roller for you. Cedric X. Bryant Sept. 20, 2024 ### Beginner's Guide to Yoga Yoga can be a great experience for physical, mental, emotional and spiritual health. Here's everything you need to know before starting yoga, from how to prepare to what to bring. Jake PanasevichAug. 23, 2024 ### How to Make Exercise a Habit Going to the gym once is a good start, but exercising consistently can help you lose weight and stay healthier and happier. Here are some tips from a fitness expert that will help you learn how to make exercise a habit. Cedric X. Bryant Aug. 15, 2024 Load More Hospitals Find a Hospital Best Hospitals Best Children's Hospitals Advice for Hospital Patients Advice for Health Professionals How We Rank For Hospitals: Update Profile Ambulatory Surgery Centers Find an ASC How we evaluate ASCs Doctors Find a Doctor Primary Care Physicians Pediatricians How to Choose a Doctor Preparing for a Doctor Visit Doctors Data and Methodology Dentists Find a Dentist Orthodontists How to Choose the Right Dentist Senior Living Find Memory Care Communities Find Independent Living Communities Find Continuing Care Retirement Communities Find Assisted Living Communities Senior Living Search For Companies Nursing Homes Find a Nursing Home Wellness Food Fitness Mind Diets Best Diets Overall Best Weight-Loss Diets Best Diet Programs Product Rankings & Reviews Clear Braces Health Insurance Find Plans by State Medicare Plans Choosing a Health Plan Conditions Over the Counter Drugs Breast Cancer Lung Cancer Depression ADHD Diabetes Heart Disease Hospitals Ambulatory Surgery Centers Doctors Dentists Senior Living Nursing Homes Wellness Diets Product Rankings & Reviews Health Insurance Conditions About U.S. News Editorial Guidelines Contact Press Advertise Newsletters Jobs Site Map Store Copyright 2025 © U.S. News & World Report L.P.Terms & Conditions/Privacy Policy/U.S. State Privacy Notice/Your Privacy Choices"
    },
    {
      "url": "https://connect2playsports.com/pickup-games",
      "content": "Pickup Games | Connect2Play Sports ☰ Home About Us Contact FAQ Coach's Corner Sports & Fitness Blog Log In Sign Up User Tutorial Organization Tutorial Frequently Asked Questions How do I sign up as an individual, team, league or organization? Sign up is FREE and easy for individuals (to play pickup games), teams, leagues and organizations. Here is the link to get in the game! To learn more, check out our User Tutorial Video below. Watch this video What type of organizations can sign up? Community centers, recreational leagues, corporations, colleges, parks and intramurals. Click this link to set up, organize your league(s) and start connecting to teams and players in your area. To learn more, check out our Organization Tutorial Video below. Watch this video I am new to the area and do not have a team. How can I get started? Connect 2 Play Sports makes matching and connecting you to teams, sports and fitness-minded individuals and leagues in your area free and easy by utilizing our Gamefeed map and your personalized settings. Based on your personalized settings of sports and fitness you are interested in playing and your availability, you are matched to teams and pick-up games happening around you. What is a pick-up game? A pick-up game is a game that has been casually or spontaneously initiated by an individual or group of players. Pick-up games generally do not have officials or referees, which make them less structured than regular games. Pick-up games are a great way to meet new people, get active and try new things! What do the levels of play mean? A - Competitive; teams and players have played the sport for a long time. Very organized and players may have speciality positions. B - Upper Intermediate; teams and players have played the sport a long time and teams are well organized C - Intermediate; players may be new to sport but are seeking a little more competition. Social aspect focus. D - Beginners or new teams. Recreational - Lowest level of competition; beginners or social league. What's the Coach's Corner? The Coach's Corner is a free open discussion forum for users to connect with other users, coaches and trainers. The Coach's Corner includes Announcements, Coach / Trainer Advice, Rules Discussion, Fields and Facilities, Gear Review, Nutrition and general topics introduced by users. We created this page so our users could improve performance, exchange advice and learn more about sports and fitness. How do I become a verified coach or trainer? What are the benefits? Applying to be a verified coach and trainer on our website is free. After we review and approve your credentials, you will receive a verified medal next to your user name along with social media exposure to our users. Here is the link to sign up and become a coach or trainer! How do I earn trophies? Get in the game and start playing today to earn trophies. And with your help, we keep track of your stats. What sports games and fitness activities does Connect2Play Sports offer? Archery, Archery (Adaptive), Axe Throwing, Backpacking, Badminton, Baggo, Ballet, Baseball, Basketball, Basketball (Adaptive), Beer Pong, Billiards, Birdwatching, Bocce, Bowling, Bowling (Adaptive), Boxing, Broomball, Canoeing, Canyoneering, Climbing (Rock), Climbing (Wall), Cornhole, Cricket, Croquet, Cross Country Skiing, Curling, Cycling (Class), Cycling (Road), Darts, Disc Golf, Dodgeball, Dodgeball (Trampoline), Fencing, Fishing (Ice), Fishing (Sport), Foosball, Football (Beach), Football (Flag), Football (Tackle), Footgolf, Footvolley, Four Square, Geocaching, Golf, Golf (Mini), Handball, Hang Gliding, Hiking, Hip Hop Dancing, Hockey (Field), Hockey (Floor), Hockey (Ice), Hockey (Pond), Horseshoes, Ice Skating, Jay Alai, Jenga, Judo, Kan Jam, Karate, Kayaking, Kickball, Kickball (Adaptive), Kickboxing, Kitesurfing, Knockerball, Kubb Lawn Game, Kung Fu, Lacrosse, Ladder Toss, Laser Tag, Lawn Bowling, Lawn Darts, Lawn Twister, Longboarding, Mountain Biking, Paddle Boarding, Paintball, Pickleball, Pilates, Quidditch, Racketball, Ring Toss, Roller Derby, Rollors, Roundnet, Rowing, Rugby, Running (5K training), Running (Marathon Training), Running (Trail), Sailing, Shooting (Clay), Shooting (Target), Shuffleboard, Skiing, Skydiving, Snowboarding, Snowshoeing, Soccer (Adaptive), Soccer (Indoor), Soccer (Outdoor), Softball, Spikeball, Squash, Streetball, Surfing, Swimming, Tennis, Tennis (Table), Tetherball, Trampoline Fitness, Trenchball, Triathlon Training, Ultimate Frisbee, Volleyball (Indoor), Volleyball (Sand), Walking, Wallyball, Washers, Water Polo, Water Polo (Inner Tube), Wiffleball, Windsurfing, Wrestling, Yard Yahtzee, Yoga The sport I am interested isn’t listed. Can you ap it to Connect2Play Sports? Yes we can! Please E-mail us. For the latest news, updates and announcements from Connect2Play Sports, follow us on our social media accounts. © 2023 Connect2Play Sports. All rights reserved. Terms of Use & Privacy Policy",
      "title": "Pickup Games | Connect2Play Sports ☰ Home About Us Contact FAQ Coach's Corner Sports & Fitness Blog Log In Sign Up User Tutorial Organization Tutorial Frequently Asked Questions How do I sign up as an individual, team, league or organization? Sign up is FREE and easy for individuals (to play pickup games), teams, leagues and organizations. Here is the link to get in the game! To learn more, check out our User Tutorial Video below. Watch this video What type of organizations can sign up? Community centers, recreational leagues, corporations, colleges, parks and intramurals. Click this link to set up, organize your league(s) and start connecting to teams and players in your area. To learn more, check out our Organization Tutorial Video below. Watch this video I am new to the area and do not have a team. How can I get started? Connect 2 Play Sports makes matching and connecting you to teams, sports and fitness-minded individuals and leagues in your area free and easy by utilizing our Gamefeed map and your personalized settings. Based on your personalized settings of sports and fitness you are interested in playing and your availability, you are matched to teams and pick-up games happening around you. What is a pick-up game? A pick-up game is a game that has been casually or spontaneously initiated by an individual or group of players. Pick-up games generally do not have officials or referees, which make them less structured than regular games. Pick-up games are a great way to meet new people, get active and try new things! What do the levels of play mean? A - Competitive; teams and players have played the sport for a long time. Very organized and players may have speciality positions. B - Upper Intermediate; teams and players have played the sport a long time and teams are well organized C - Intermediate; players may be new to sport but are seeking a little more competition. Social aspect focus. D - Beginners or new teams. Recreational - Lowest level of competition; beginners or social league. What's the Coach's Corner? The Coach's Corner is a free open discussion forum for users to connect with other users, coaches and trainers. The Coach's Corner includes Announcements, Coach / Trainer Advice, Rules Discussion, Fields and Facilities, Gear Review, Nutrition and general topics introduced by users. We created this page so our users could improve performance, exchange advice and learn more about sports and fitness. How do I become a verified coach or trainer? What are the benefits? Applying to be a verified coach and trainer on our website is free. After we review and approve your credentials, you will receive a verified medal next to your user name along with social media exposure to our users. Here is the link to sign up and become a coach or trainer! How do I earn trophies? Get in the game and start playing today to earn trophies. And with your help, we keep track of your stats. What sports games and fitness activities does Connect2Play Sports offer? Archery, Archery (Adaptive), Axe Throwing, Backpacking, Badminton, Baggo, Ballet, Baseball, Basketball, Basketball (Adaptive), Beer Pong, Billiards, Birdwatching, Bocce, Bowling, Bowling (Adaptive), Boxing, Broomball, Canoeing, Canyoneering, Climbing (Rock), Climbing (Wall), Cornhole, Cricket, Croquet, Cross Country Skiing, Curling, Cycling (Class), Cycling (Road), Darts, Disc Golf, Dodgeball, Dodgeball (Trampoline), Fencing, Fishing (Ice), Fishing (Sport), Foosball, Football (Beach), Football (Flag), Football (Tackle), Footgolf, Footvolley, Four Square, Geocaching, Golf, Golf (Mini), Handball, Hang Gliding, Hiking, Hip Hop Dancing, Hockey (Field), Hockey (Floor), Hockey (Ice), Hockey (Pond), Horseshoes, Ice Skating, Jay Alai, Jenga, Judo, Kan Jam, Karate, Kayaking, Kickball, Kickball (Adaptive), Kickboxing, Kitesurfing, Knockerball, Kubb Lawn Game, Kung Fu, Lacrosse, Ladder Toss, Laser Tag, Lawn Bowling, Lawn Darts, Lawn Twister, Longboarding, Mountain Biking, Paddle Boarding, Paintball, Pickleball, Pilates, Quidditch, Racketball, Ring Toss, Roller Derby, Rollors, Roundnet, Rowing, Rugby, Running (5K training), Running (Marathon Training), Running (Trail), Sailing, Shooting (Clay), Shooting (Target), Shuffleboard, Skiing, Skydiving, Snowboarding, Snowshoeing, Soccer (Adaptive), Soccer (Indoor), Soccer (Outdoor), Softball, Spikeball, Squash, Streetball, Surfing, Swimming, Tennis, Tennis (Table), Tetherball, Trampoline Fitness, Trenchball, Triathlon Training, Ultimate Frisbee, Volleyball (Indoor), Volleyball (Sand), Walking, Wallyball, Washers, Water Polo, Water Polo (Inner Tube), Wiffleball, Windsurfing, Wrestling, Yard Yahtzee, Yoga The sport I am interested isn’t listed. Can you ap it to Connect2Play Sports? Yes we can! Please E-mail us. For the latest news, updates and announcements from Connect2Play Sports, follow us on our social media accounts. © 2023 Connect2Play Sports. All rights reserved. Terms of Use & Privacy Policy"
    },
    {
      "url": "https://play.google.com/store/apps/details?id=com.plei&hl=en_US",
      "content": "Plei - Pickup Soccer - Apps on Google Play GamesAppsMovies & TVBooksChildren google_logo Play Games Apps Movies & TV Books Children none search help_outline Sign in with Google _play_apps_Library & devices _payment_Payments & subscriptions _reviews_My Play activity _redeem_Offers Play Pass Personalization in Play _settings_Settings Privacy Policy • Terms of Service GamesAppsMovies & TVBooksChildren Plei - Pickup Soccer Plei App 4.8_star_ 1K reviews 50K+ Downloads Teen info Install Share Add to wishlist About this app arrow_forward Plei is a pickup soccer app made by players for players We give everyone access to play pick up soccer anytime, anywhere they want. Plei makes playing soccer as easy as ordering an Uber. With Plei you are only two clicks away from playing soccer near you We organize every single game for you using a combination of automation and a human touch. All you have to do is show up, have fun, and score lots of goals! Features: - Join Pick up soccer games in your neighborhood - Explore out our pickup game feed, where daily soccer games are hosted all throughout your city - Easily pay for your soccer game. The best part is that there is we never charge you anything if the game does not confirm with enough players. - Share soccer games and invite friends or add them as guests to your reservation - Our technology takes care of making sure the game fills up with enough soccer players and that you have an enjoyable experience playing with us - Communicate easily with us and receive instant feedback to any questions you may have through our Intercom messaging integration, as well as through text messages. This ensures you are always up to date with the status of your game - View game details (Instructions, soccer facility address, where to park, where to find the other players) - Find soccer facilities near you Soccer should be an enjoyable experience for you and your friends, not a hassle. Enjoy Plei, the best pick up soccer app Updated on Feb 21, 2025 Sports Data safety arrow_forward Safety starts with understanding how developers collect and share your data. Data privacy and security practices may vary based on your use, region, and age. The developer provided this information and may update it over time. This app may share these data types with third parties Audio, App activity and 2 others This app may collect these data types Location Data is encrypted in transit You can request that data be deleted See details Ratings and reviews Ratings and reviews are verified_info_outline_ arrow_forward Ratings and reviews are verified_info_outline_ _phone_android_Phone _tablet_android_Tablet 4.8 988 reviews 5 4 3 2 1 Juan Diego Caamano Toledo more_vert Flag inappropriate Show review history February 21, 2025 When I arrived to Miami, I didn't have any friends to play with. The plei app is amazing to play soccer (it's football but in the US is called soccer) and find new friends to share experiences. Plus, the prices for the games are pretty fair. 5 stars. Update: Now with the new updates of the app, there are now more fields and way more players than before. Plus, sometimes there free games organized by the app. Don't miss your chance to register and plei. Did you find this helpful? Yes No Mark Forward more_vert Flag inappropriate November 23, 2024 Plei is an amazing app for soccer lovers, making it incredibly easy to find and join pickup games in your area. The user friendly design allows players of all skill levels to connect, and the detailed game information like location, time, and player count takes the guesswork out of planning. With the convenience of in-app payments and notifications, everything feels seamless. Since using Plei, I’ve met new people, stayed active, and enjoyed playing. This is a MUST have soccer app. Did you find this helpful? Yes No Javier Martinez more_vert Flag inappropriate October 14, 2024 My experience is good in general. There is a wide variety of games and locations at least in NYC where I live, and fees are affordable. The Plei Team had the consideration to gift me Plei shirts and bottle, that was really nice. As Cons, I have to mention the following: - Players who arrive late (+10', this happens in every game) do not get penalties - Players who cancel games get very light penalties - The type of game, field length or goal used is not disclosed in the app 1 person found this review helpful Did you find this helpful? Yes No See all reviews What’s new An awesome new update with improvements and updates our community has requested. We are always improving our app and service to ensure the best experience possible for our community _flag_Flag as inappropriate App support expand_more public Website phone Phone number +13058122409 email Support email s@pleiapp.com shield Privacy Policy About the developer Plei, Inc. s@pleiapp.com 12001 SW 128th Ct Ste 210 Miami, FL 33186 United States +1 305-812-2409 Similar apps arrow_forward Seattle Kraken NHL Seattle 4.7_star_ NJ Devils + Prudential Center New Jersey Devils 2.5_star_ Goose Port Appfront Tixr: Live Event Tickets Tixr, Inc. 3.6_star_ Purple Carrot Purple Carrot 4.8_star_ _flag_Flag as inappropriate Google PlayPlay PassPlay PointsGift cardsRedeemRefund policy Children and familyParent guideFamily sharing Terms of service Privacy About Google Play Developers Google Store United States (English (Australia))",
      "title": "Plei - Pickup Soccer - Apps on Google Play GamesAppsMovies & TVBooksChildren google_logo Play Games Apps Movies & TV Books Children none search help_outline Sign in with Google _play_apps_Library & devices _payment_Payments & subscriptions _reviews_My Play activity _redeem_Offers Play Pass Personalization in Play _settings_Settings Privacy Policy • Terms of Service GamesAppsMovies & TVBooksChildren Plei - Pickup Soccer Plei App 4.8_star_ 1K reviews 50K+ Downloads Teen info Install Share Add to wishlist About this app arrow_forward Plei is a pickup soccer app made by players for players We give everyone access to play pick up soccer anytime, anywhere they want. Plei makes playing soccer as easy as ordering an Uber. With Plei you are only two clicks away from playing soccer near you We organize every single game for you using a combination of automation and a human touch. All you have to do is show up, have fun, and score lots of goals! Features: - Join Pick up soccer games in your neighborhood - Explore out our pickup game feed, where daily soccer games are hosted all throughout your city - Easily pay for your soccer game. The best part is that there is we never charge you anything if the game does not confirm with enough players. - Share soccer games and invite friends or add them as guests to your reservation - Our technology takes care of making sure the game fills up with enough soccer players and that you have an enjoyable experience playing with us - Communicate easily with us and receive instant feedback to any questions you may have through our Intercom messaging integration, as well as through text messages. This ensures you are always up to date with the status of your game - View game details (Instructions, soccer facility address, where to park, where to find the other players) - Find soccer facilities near you Soccer should be an enjoyable experience for you and your friends, not a hassle. Enjoy Plei, the best pick up soccer app Updated on Feb 21, 2025 Sports Data safety arrow_forward Safety starts with understanding how developers collect and share your data. Data privacy and security practices may vary based on your use, region, and age. The developer provided this information and may update it over time. This app may share these data types with third parties Audio, App activity and 2 others This app may collect these data types Location Data is encrypted in transit You can request that data be deleted See details Ratings and reviews Ratings and reviews are verified_info_outline_ arrow_forward Ratings and reviews are verified_info_outline_ _phone_android_Phone _tablet_android_Tablet 4.8 988 reviews 5 4 3 2 1 Juan Diego Caamano Toledo more_vert Flag inappropriate Show review history February 21, 2025 When I arrived to Miami, I didn't have any friends to play with. The plei app is amazing to play soccer (it's football but in the US is called soccer) and find new friends to share experiences. Plus, the prices for the games are pretty fair. 5 stars. Update: Now with the new updates of the app, there are now more fields and way more players than before. Plus, sometimes there free games organized by the app. Don't miss your chance to register and plei. Did you find this helpful? Yes No Mark Forward more_vert Flag inappropriate November 23, 2024 Plei is an amazing app for soccer lovers, making it incredibly easy to find and join pickup games in your area. The user friendly design allows players of all skill levels to connect, and the detailed game information like location, time, and player count takes the guesswork out of planning. With the convenience of in-app payments and notifications, everything feels seamless. Since using Plei, I’ve met new people, stayed active, and enjoyed playing. This is a MUST have soccer app. Did you find this helpful? Yes No Javier Martinez more_vert Flag inappropriate October 14, 2024 My experience is good in general. There is a wide variety of games and locations at least in NYC where I live, and fees are affordable. The Plei Team had the consideration to gift me Plei shirts and bottle, that was really nice. As Cons, I have to mention the following: - Players who arrive late (+10', this happens in every game) do not get penalties - Players who cancel games get very light penalties - The type of game, field length or goal used is not disclosed in the app 1 person found this review helpful Did you find this helpful? Yes No See all reviews What’s new An awesome new update with improvements and updates our community has requested. We are always improving our app and service to ensure the best experience possible for our community _flag_Flag as inappropriate App support expand_more public Website phone Phone number +13058122409 email Support email s@pleiapp.com shield Privacy Policy About the developer Plei, Inc. s@pleiapp.com 12001 SW 128th Ct Ste 210 Miami, FL 33186 United States +1 305-812-2409 Similar apps arrow_forward Seattle Kraken NHL Seattle 4.7_star_ NJ Devils + Prudential Center New Jersey Devils 2.5_star_ Goose Port Appfront Tixr: Live Event Tickets Tixr, Inc. 3.6_star_ Purple Carrot Purple Carrot 4.8_star_ _flag_Flag as inappropriate Google PlayPlay PassPlay PointsGift cardsRedeemRefund policy Children and familyParent guideFamily sharing Terms of service Privacy About Google Play Developers Google Store United States (English (Australia))"
    },
    {
      "url": "https://www.goodrec.com/",
      "content": "GoodRec organizes pickup soccer games every day in your city. From indoor to outdoor, at the best fields. Play any day of the week.",
      "title": "GoodRec organizes pickup soccer games every day in your city. From indoor to outdoor, at the best fields. Play any day of the week."
    }
  ],
  "researchSummary": "... mode! Buy here: https://www.vat19.com/item/shock-ball-electric-shock-hot-potato-game More Hidden in Plain Sight: https://www.youtube.com/watch?v\n\nINFINITEHOOPS · FIND PICKUP BASKETBALL GAMES · INFINITEHOOPS FIND PICKUP BASKETBALL GAMES ENTER THE PICKUP BASKETBALL APP INFINITEHOOPS · FIND PICKUP BASKETBALL GAMES The InfiniteHoops app locates nearby pickup basketball games and groups of people wanting to play letting you to connect and play basketball. The original pickup basketball app and website. The InfiniteHoops iPhone app launched in 2011 and InfiniteHoops.com in 2003. FEATURES - Search nearby pickup basketball games and groups - Join groups - See your upcoming game schedule - Mark yourself as In, Out or Undecided for games - See who's in and who's out in your upcoming games - Message other players in your groups - Read hoop news © BROADSIDE LLC · SEATTLE WASHINGTON\n\nDownload SLAM City Game App To Find Pickup Games Want to find the best court for a pickup run? Compare your player rankings to others in your area? SLAM City Game is the best way to find the best pickup runs and where to catch the game. The app is now free for download from the Apple App Store. SLAM City Game is full of features and allows the user to: • Find the best urban courts • Post pickup games / invite friends • Find pickup games to join • Post a profile with a pic and skills • Get the latest SLAM Magazine news • Check player social rankings powered by Hookit • Get a feed of updates, photos & videos from your favorite pros and teams • Get the latest SLAM Magazine news and updates on demand SLAM Night in Houston, LSU and All-Star: Here’s What We’ve Been Up to in February The Battle for LA Continues With USC-UCLA Rematch Golden State Entertainment Captures the Culture and Artistry of the Bay\n\nHow to find pickup soccer games | ENDALGO Blog Start a new group Listing Explore Support How to find pickup soccer games Oct 13th, 2022 - Soccer Among the active soccer player audience we conducted a s",
  "coreTopic": "The main topic revolves around finding and organizing pickup sports games, specifically basketball and soccer, through various apps and platforms. It highlights features of specific applications like InfiniteHoops and SLAM City Game, which facilitate connecting players with nearby games, scheduling, and player interactions. The content also touches on the broader culture of casual sports participation and community engagement among players.",
  "brandInfo": "\n        Website: https://playpickups.app/\n        Brand: playpickups\n        Products: No product images\n        Description: Besides work, you're not able to socialise much. Maybe you'd like to play tennis over the weekend but don't have a consistent group of players to play with.\n\n\n        Documents: No documents\n        Logo: No logo\n        Posts/Videos: No posts/videos\n        Taglines: None\n        Colours: 016DE5\n        Country: global\n      ",
  "youtubeVideo": null,
  "internalLinks": [
    "/blog/tips-for-growth",
    "/resources/ecommerce-guide"
  ],
  "references": [
    "https://playpickups.app/",
    "https://www.youtube.com/watch?v=7VycxKuN-7Q",
    "https://ecosports.com/blogs/vegan-athletes/how-to-find-pickup-basketball-games-in-your-area?srsltid=AfmBOoqyxSPNY4-85EhW2pOAJkpqNh-NeWbhnKBh3gu0mnsNQsEH4EjJ",
    "https://www.slamonline.com/streetball/download-slam-city-game-app-find-pickup-games/",
    "https://www.endalgo.com/blog/how-to-find-pickup-soccer-games",
    "https://health.usnews.com/wellness/fitness/articles/2017-06-21/5-tips-for-finding-the-right-pickup-game-or-sports-partner",
    "https://connect2playsports.com/pickup-games",
    "https://play.google.com/store/apps/details?id=com.plei&hl=en_US",
    "https://www.goodrec.com/"
  ],
  "existingPosts": "",
  "targetKeywords": [],
  "timestamp": "2025-03-03",
  "nudge": "y8sgr"
}