{
  "initialUrl": "https://playpickups.app/",
  "initialResearchSummary": "Alright, so checking out that URL, playpickups.app, I’m getting some vibes about it being a platform that’s probably all about fun, social connections, and maybe even a bit of gaming thrown in. The “play” in the URL hints that there’s some interactive aspect, kind of like a gaming or sports-related app, where people can come together to enjoy an experience. The word “pickups” makes me think of picking teams or maybe picking games. You know, like when you’re hanging out with friends trying to decide what sport to play or what game to dive into. It could be something where you can set up your own teams, maybe for fantasy sports or just casual competitions. You could imagine it being a cool space for friends to challenge each other and keep track of scores or stats. Given that it's an app, I wouldn’t be surprised if there's some neat functionality—like scheduling games, chatting with friends, or even sharing highlights of your matches. Picture a seamless way to organize pick-up games for basketball, football, or whatever sport you’re into, where you can rally your friends together and get the ball rolling. And hey, these days, you know how everything seems to incorporate a social media feel, right? I wouldn’t be shocked if there are features for sharing your wins, posting about your games, and maybe even some leaderboards keeping things interesting and competitive among users. It could create this friendly rivalry vibe, like, “Hey, check out how many points I scored last week!” The app could also tie into local communities, helping people discover nearby games or players looking to join a squad. It’s all about building that community spirit, encouraging folks to get out, move around, and connect with new people over sports. There might even be some cool integrations, like being able to sync with fitness trackers, so you can boast about those steps or calories burned during a friendly match. Throw in some personalized recommendations for games based on what you like or who you’ve played with before, and you’ve got a recipe for a pretty engaging app. So yeah, I’d say at its core, playpickups.app is likely about bringing people together through play—whether that’s through sports, games, or even some creative challenges. It’s all about having a good time and making those connections. Who doesn’t love a little competition mixed with camaraderie, right? Overall, it's probably designed to be user-friendly and appealing, making it easy for anyone to jump in and start playing, whether you’re a hardcore athlete or just someone looking to kick back and have some fun. With all that in mind, I can definitely see this becoming a go-to spot for sports enthusiasts and casual players alike. Cheers to that!",
  "researchResults": [
    {
      "url": "https://www.pickleballportal.com/blog/play-pickleball-by-organizing-pickup-games/",
      "content": "Published Time: 2022-07-11T11:00:21+00:00 Play Pickleball by Organizing Pickup Games - Skip to content Menu Home Newsletter News & Opinion Guides Paddles Paddle Guide Beginners New Releases Spin Under $30 Shoes Other Gear Ball Machines Nets Balls Bags Training Aids T-Shirts We may earn a commission through affiliate links. Details Play Pickleball by Organizing Pickup Games July 11, 2022 Dan Langston Share If you love to play pickleball, then organize pickup games so you can play it anytime. This guide from the Pickleball Portal will show you how. You can set the schedule and name the place. You can also encourage others to learn about this great sport and find your favorite rivals to play with. How Can You Play Pickleball Pickup Games? Say the word pickup, and people mostly think of basketball. Pickups are spontaneous, unstructured games where players are invited to play, but no one is obligated. There are no formal rules and no referees. The whole point is to have fun, and teams are made up on the spot. You don’t suffer any repercussions if you lose, save for a bruised ego, and you aren’t committed to play any future games. Sounds a lot like pickleball, doesn’t it? With pickleball, people have always been able to show up at any pickleball match and find a game to play. That’s what’s so great about pickleball. It’s easy to find a match and make friends with other players. How Can I Organize Games So I Can Play Pickleball? If you’d like to organize pickups but aren’t sure how, there are several ways you can coordinate pickleball pickups. Here are a few ideas. 1. Decide How Many Players You Want First, think about how many pickleball courts you can reserve. If you only have access to one or two courts, then only contact eight or nine pickleball players. You don’t want frustrated players standing around waiting for their turn. If you have two courts and everyone shows up, people can play doubles so all of the players get to play pickleball. 2. Get the Word Out If you can’t find enough pickleball players, use an app such as Pickleball Connect or Places 2 Play to find players in your area. If you already know several pickleball players, send them texts inviting them to play at a specific place and time. Try to get a feel for who can come. Then keep sending out invitations until you get enough people. Think about inviting one extra person in case someone cancels at the last minute. The night before the game, send out a reminder text asking for a confirmation. People are busy and tend to forget important appointments, even pickleball games. A friendly reminder helps them and also gives you an accurate count of who plans to show up. 3. Set Up a Regular Pickleball Night You could also set up an ongoing pickleball game where you play at the same court at the same time each week. If you go this route, send out invitations to more people than you need at the game. Not everyone can play each week. Sending invitations to a larger group ensures you have enough each time. Are You Ready To Organize Games To Play Pickleball? Organizing pickleball pickup games is a great way to meet people and play a few relaxing sets. We at Pickleball Portal are here to help with all gear you need. When you’re ready to find the latest pickleball gear, start here. Categories Blog Leave a Comment Cancel reply Comment Name Email WebsiteΔ WIN THE PADDLE OF YOUR DREAMS! Sign up now for a chance to win any paddle of your choice currently in stock at JustPaddles. Plus, receive expert tips from pro players and exclusive content delivered straight to your inbox. Footer Menu Contact Us About Us Privacy Instagram Newsletter RSS ©2025 Pickleball Portal Close Home Newsletter News & Opinion Guides Paddles Paddle Guide Beginners New Releases Spin Under $30 Shoes Other Gear Ball Machines Nets Balls Bags Training Aids T-Shirts",
      "title": "Published Time: 2022-07-11T11:00:21+00:00 Play Pickleball by Organizing Pickup Games - Skip to content Menu Home Newsletter News & Opinion Guides Paddles Paddle Guide Beginners New Releases Spin Under $30 Shoes Other Gear Ball Machines Nets Balls Bags Training Aids T-Shirts We may earn a commission through affiliate links. Details Play Pickleball by Organizing Pickup Games July 11, 2022 Dan Langston Share If you love to play pickleball, then organize pickup games so you can play it anytime. This guide from the Pickleball Portal will show you how. You can set the schedule and name the place. You can also encourage others to learn about this great sport and find your favorite rivals to play with. How Can You Play Pickleball Pickup Games? Say the word pickup, and people mostly think of basketball. Pickups are spontaneous, unstructured games where players are invited to play, but no one is obligated. There are no formal rules and no referees. The whole point is to have fun, and teams are made up on the spot. You don’t suffer any repercussions if you lose, save for a bruised ego, and you aren’t committed to play any future games. Sounds a lot like pickleball, doesn’t it? With pickleball, people have always been able to show up at any pickleball match and find a game to play. That’s what’s so great about pickleball. It’s easy to find a match and make friends with other players. How Can I Organize Games So I Can Play Pickleball? If you’d like to organize pickups but aren’t sure how, there are several ways you can coordinate pickleball pickups. Here are a few ideas. 1. Decide How Many Players You Want First, think about how many pickleball courts you can reserve. If you only have access to one or two courts, then only contact eight or nine pickleball players. You don’t want frustrated players standing around waiting for their turn. If you have two courts and everyone shows up, people can play doubles so all of the players get to play pickleball. 2. Get the Word Out If you can’t find enough pickleball players, use an app such as Pickleball Connect or Places 2 Play to find players in your area. If you already know several pickleball players, send them texts inviting them to play at a specific place and time. Try to get a feel for who can come. Then keep sending out invitations until you get enough people. Think about inviting one extra person in case someone cancels at the last minute. The night before the game, send out a reminder text asking for a confirmation. People are busy and tend to forget important appointments, even pickleball games. A friendly reminder helps them and also gives you an accurate count of who plans to show up. 3. Set Up a Regular Pickleball Night You could also set up an ongoing pickleball game where you play at the same court at the same time each week. If you go this route, send out invitations to more people than you need at the game. Not everyone can play each week. Sending invitations to a larger group ensures you have enough each time. Are You Ready To Organize Games To Play Pickleball? Organizing pickleball pickup games is a great way to meet people and play a few relaxing sets. We at Pickleball Portal are here to help with all gear you need. When you’re ready to find the latest pickleball gear, start here. Categories Blog Leave a Comment Cancel reply Comment Name Email WebsiteΔ WIN THE PADDLE OF YOUR DREAMS! Sign up now for a chance to win any paddle of your choice currently in stock at JustPaddles. Plus, receive expert tips from pro players and exclusive content delivered straight to your inbox. Footer Menu Contact Us About Us Privacy Instagram Newsletter RSS ©2025 Pickleball Portal Close Home Newsletter News & Opinion Guides Paddles Paddle Guide Beginners New Releases Spin Under $30 Shoes Other Gear Ball Machines Nets Balls Bags Training Aids T-Shirts"
    },
    {
      "url": "https://d36m266ykvepgv.cloudfront.net/uploads/media/I6bIAClbxg/o/how-to-organise-a-game-of-pick-upultimate.pdf",
      "content": "How to organise a game of Pick-up Introduction Pick-up is the term used to describe an Ultimate Frisbee match where the teams are made up on the day from the people that show up. Anyone who wants to play simply shows up, is divided into two teams and plays. It’s a fun casual way of getting to play a game of Ultimate locally. This guide lists the equipment needed to host pick-up and the steps involved in organising a game. The spirit of pick-up allows you to play with new people, get some exercise and have lots of fun playing Ultimate. Equipment 1.​ A field or a grass space. Ideally the space should be big enough to fit a 100m long and 37 metre wide pitch, although as with everything in Ultimate this is flexible and you can play on a smaller space if needs be. If this is a pitch in a park, see if you can book it (say it’s a league match). If you can’t book it and think there’s a possibility you may get kicked off try have a second location near by in mind that you could move to. 2. ​At least 8 cones (or something that can mark the pitch- if you’re really stuck jumpers or runners can work) 3.​ A disc 4. ​10 - 18 people willing to play Ultimate. With 10 people you can play 5 aside on a reduced size pitch. With 18 people you can play 7 aside with subs. Any number in between works too. How to organise a game: Step 1​:​ Find a suitable location Step 2:​ Make sure you have a disc and something to mark a pitch Step 3:​ Pick a date and time Step 4: ​Email committee@irishultimate.com and let us know. We’ll update the pick‐up section of our website and put up a facebook post to encourage people to attend. Step 5:​ Tell your Ultimate friends, regular friends, family and anyone else who you think might enjoy a throw and a run around the park. Step 6: ​Turn up 15mins before and set up the pitch. Step 7:​ ​Divide everyone that shows up into two even teams. Instruct one team to wear their darks and the other team to wear their light jerseys. Step 8:​ Play Ultimate! Everything else: ‐ ​Each player should be told to bring a light and dark jersey and a bottle of water. ‐​ Normal Ultimate rules apply. ‐ ​Unlike training pick‐up is a more casual affair and is focused on playing games. You can organise pick‐up as a once off event or you can have it as a weekly event e.g every Tuesday at 6.30 at location x. ‐ ​Due to the nature of pick‐up sometimes there may not be enough people for a game. If this happens there is still plenty you can do: 1. Have a throwing session 2. Play 3 vs 3 mini (small pitch and continuous play. When a team scores they continue on offence but are now trying to score in the opposite endzone. There is no pull after each point, you just keep playing). 3. Play double disc court or invent a new disc game to suit your needs. Ultimate is wonderfully flexible! If you’re new to Ultimate or need to brush up on the rules, check out the resources in the Play Ultimate section of our website for everything you need to know about Ultimate!",
      "title": "How to organise a game of Pick-up Introduction Pick-up is the term used to describe an Ultimate Frisbee match where the teams are made up on the day from the people that show up. Anyone who wants to play simply shows up, is divided into two teams and plays. It’s a fun casual way of getting to play a game of Ultimate locally. This guide lists the equipment needed to host pick-up and the steps involved in organising a game. The spirit of pick-up allows you to play with new people, get some exercise and have lots of fun playing Ultimate. Equipment 1.​ A field or a grass space. Ideally the space should be big enough to fit a 100m long and 37 metre wide pitch, although as with everything in Ultimate this is flexible and you can play on a smaller space if needs be. If this is a pitch in a park, see if you can book it (say it’s a league match). If you can’t book it and think there’s a possibility you may get kicked off try have a second location near by in mind that you could move to. 2. ​At least 8 cones (or something that can mark the pitch- if you’re really stuck jumpers or runners can work) 3.​ A disc 4. ​10 - 18 people willing to play Ultimate. With 10 people you can play 5 aside on a reduced size pitch. With 18 people you can play 7 aside with subs. Any number in between works too. How to organise a game: Step 1​:​ Find a suitable location Step 2:​ Make sure you have a disc and something to mark a pitch Step 3:​ Pick a date and time Step 4: ​Email committee@irishultimate.com and let us know. We’ll update the pick‐up section of our website and put up a facebook post to encourage people to attend. Step 5:​ Tell your Ultimate friends, regular friends, family and anyone else who you think might enjoy a throw and a run around the park. Step 6: ​Turn up 15mins before and set up the pitch. Step 7:​ ​Divide everyone that shows up into two even teams. Instruct one team to wear their darks and the other team to wear their light jerseys. Step 8:​ Play Ultimate! Everything else: ‐ ​Each player should be told to bring a light and dark jersey and a bottle of water. ‐​ Normal Ultimate rules apply. ‐ ​Unlike training pick‐up is a more casual affair and is focused on playing games. You can organise pick‐up as a once off event or you can have it as a weekly event e.g every Tuesday at 6.30 at location x. ‐ ​Due to the nature of pick‐up sometimes there may not be enough people for a game. If this happens there is still plenty you can do: 1. Have a throwing session 2. Play 3 vs 3 mini (small pitch and continuous play. When a team scores they continue on offence but are now trying to score in the opposite endzone. There is no pull after each point, you just keep playing). 3. Play double disc court or invent a new disc game to suit your needs. Ultimate is wonderfully flexible! If you’re new to Ultimate or need to brush up on the rules, check out the resources in the Play Ultimate section of our website for everything you need to know about Ultimate!"
    },
    {
      "url": "https://www.socceramerica.com/get-up-and-start-a-pickup-game/",
      "content": "Published Time: 2010-04-01T21:03:53Z NULL Close Join Soccer America Pro Sign In Search for: Search Sections Open dropdown menu Men’s National Team Women’s National Team MLS NWSL USL NISA Men’s World Cup Women’s World Cup Olympics Americans Abroad Youth College Men College Women International Expansion Television Business Referees News Open dropdown menu Soccer America Daily Soccer America Top of the News Game Report Soccer on TV SoccerTalk with Paul Gardner Soccer America Confidential Community Open dropdown menu Youth Soccer Insider Camps and Academies Tournament Calendar Jobs Soccer Glossary About Open dropdown menu About Us Contact Us Refund Policy Advertise Frequently Asked Questions Twitter Facebook Close Join Soccer America Pro Sections Men’s National Team Women’s National Team MLS NWSL USL NISA Men’s World Cup Women’s World Cup Olympics Americans Abroad Youth College Men College Women International Expansion Television Business Referees News Soccer America Daily Soccer America Top of the News Game Report Soccer on TV SoccerTalk with Paul Gardner Soccer America Confidential Community Youth Soccer Insider Camps and Academies Tournament Calendar Jobs Soccer Glossary About About Us Contact Us Refund Policy Advertise Frequently Asked Questions Skip to content Menu Soccer America Home for America's Passionate Soccer Fans Sections Open dropdown menu Men’s National Team Women’s National Team MLS NWSL USL NISA Men’s World Cup Women’s World Cup Olympics Americans Abroad Youth College Men College Women International Expansion Television Business Referees News Open dropdown menu Soccer America Daily Soccer America Top of the News Game Report Soccer on TV SoccerTalk with Paul Gardner Soccer America Confidential Community Open dropdown menu Youth Soccer Insider Camps and Academies Tournament Calendar Jobs Soccer Glossary About Open dropdown menu About Us Contact Us Refund Policy Advertise Frequently Asked Questions Join Soccer America Pro Sign In Open Search Search for: Search Menu Sign In Home » Story » Get up and start a pickup game Posted inStory, Youth Soccer Insider Get up and start a pickup game by April 1, 2010November 7, 2023 Share this: Click to share on Facebook (Opens in new window) Click to share on X (Opens in new window) By Paul Giovanopoulos Are our kids playing enough pickup ball? There have been countless articles written about this. While we all agree that this is nothappening enough, many of us just sit back and hope it starts to happen somehow on its own. We hope that somehow they start playing at the schoolyard at recess, or they come home to texttheir friends to go to the local park and play. Today’s suburbia logistics probably would not allow for this. So maybe we can organize pickup soccer. I know many of you just startedlaughing as it goes against the philosophy of the pickup game. However there is merit to this. I am taking the steps this spring and summer to organize a pickup soccer day. What I mean bythis, is reach out to all the soccer players in the neighborhood, set a place and time, bring up cones, balls, bibs, and then leave them alone for 90 minutes. They can break up into teamsthemselves, and just play. No parents or coaches providing any type of advice or thoughts. They can ref themselves, keep score and keep time limits on their games. As a kid growing up inGreece, I remember I could not wait to run to the local park and be selected for a team to play with my friends. It was only kids, and we pretended to be our local heroes playing the game.There were 22 refs on the field. Every play was contested. Every offside, every foul, even the how were teams selected. At the end it was so much fun, we couldn’t wait to do it againthe next day. So often today, all we do is structured training sessions. We are sucking the fun and creativity out of the most beautiful game in the world. (PaulGiovanopoulos of Media, Pa., coaches the Rose Tree Gunners U13.) Do you have an idea for a Youth Insider Soccer column? We’d love to hear it. E-mail usat: mike@socceramerica.com. Tagged: youth boys, youth girls Join the Conversation 13 Comments Thomas Hosier says: April 17, 2023 at 1:18 pm I believe Paul Giovanopoulos is on the mark! The main thing is consistency … set the day, the time and the place and make it happen every week and the numbers will grow. It is true that many boys and girls are doing “many” things in addition to soccer … the real soccer dudes and dudettes will find a way to the “pick-up play pitch.” No coaching … let them play! Log in to Reply Thomas Hosier says: April 17, 2023 at 3:30 pm I believe Paul Giovanopoulos is on the mark! The main thing is consistency … set the day, the time and the place and make it happen every week and the numbers will grow. It is true that many boys and girls are doing “many” things in addition to soccer … the real soccer dudes and dudettes will find a way to the “pick-up play pitch.” No coaching … let them play! Log in to Reply Thomas Hosier says: April 17, 2023 at 6:58 pm I believe Paul Giovanopoulos is on the mark! The main thing is consistency … set the day, the time and the place and make it happen every week and the numbers will grow. It is true that many boys and girls are doing “many” things in addition to soccer … the real soccer dudes and dudettes will find a way to the “pick-up play pitch.” No coaching … let them play! Log in to Reply Paul Hansen says: April 17, 2023 at 1:21 pm I have tried it off and on for the past couple of years. I’ve been so frustrated over all the structure in our kids soccer. It amounts to just practice, games or camps. I know of U13s who have been playing since U5 and have hardly played a game without a coach or parents giving input.Last year for my U11 team I started a pickup day for Sunday afternoons. This was during the competitive season. It was basically for the U11 age group but siblings were welcome as were kids from U10 & U9. I cut the age at that point because I was worried about little ones getting hurt. Parents were welcome to watch but were not allowed to talk to their kids. There was no coaching or officiating. The only thing I did was set up the fields (4v4) and did the drafting of players (names pulled from a hat). I kept it at 4v4 to encourage more touches. Every 20 minutes I would blow a whistle for team rotation. At the high point we had about 4 fields of 4v4.It was very interesting to observer the parents. Talking about control freaks! I had parents who simply could not watch their son play without “coaching” him — so those parents had to leave. I told the parents this was the kids’ time — it was time for them to play simply for the love of the game.I tried to sell it to the parents as free child care. They could drop their kids and go have a few free hours. I stayed there as a safety monitor.The interesting and sad thing was the lack of support from those who I consider hyper-competitive. In the summer lots of kids could not come to pickup soccer because they had 3v3 league. I swear the parents picked 3v3 league simply because it was “competitive” — it involved playing for medals. I had a friend who would not encourage his boys to come play pickup even though I pointed out his sons would get thousands upon thousands of more touches than they would in 3v3 league. He wasn’t interested. I’m positive it was because it didn’t involve him as a coach and it wasn’t “competitive.” Consider the difference between 3v3 league and pickup soccer. On a league night a team would have two 20 minute games. At six players a team, that amounted to 20 minutes of soccer per player. Sometimes a family would be at 3v3 for several hours because they would be playing in the early game and the late game. So for an investment of 3-4 hours a player would get 20 minutes of soccer. In contrast, pickup soccer was 2 hours of soccer, period. The kids took breaks for water but I never saw anyone quit playing due to fatigue. True, quite often a kid crawled to the car when it ended.I didn’t continue it this year. I am sad to say I gave up on it. It was discouraging to set up the time and send out the email only to have a handful of players show up. One of the big problems was it wasn’t pickup for the neighborhood. I had parents driving 10 miles to drop off their son. There are a lot of tough issues to overcome. Log in to Reply Paul Hansen says: April 17, 2023 at 3:32 pm I have tried it off and on for the past couple of years. I’ve been so frustrated over all the structure in our kids soccer. It amounts to just practice, games or camps. I know of U13s who have been playing since U5 and have hardly played a game without a coach or parents giving input.Last year for my U11 team I started a pickup day for Sunday afternoons. This was during the competitive season. It was basically for the U11 age group but siblings were welcome as were kids from U10 & U9. I cut the age at that point because I was worried about little ones getting hurt. Parents were welcome to watch but were not allowed to talk to their kids. There was no coaching or officiating. The only thing I did was set up the fields (4v4) and did the drafting of players (names pulled from a hat). I kept it at 4v4 to encourage more touches. Every 20 minutes I would blow a whistle for team rotation. At the high point we had about 4 fields of 4v4.It was very interesting to observer the parents. Talking about control freaks! I had parents who simply could not watch their son play without “coaching” him — so those parents had to leave. I told the parents this was the kids’ time — it was time for them to play simply for the love of the game.I tried to sell it to the parents as free child care. They could drop their kids and go have a few free hours. I stayed there as a safety monitor.The interesting and sad thing was the lack of support from those who I consider hyper-competitive. In the summer lots of kids could not come to pickup soccer because they had 3v3 league. I swear the parents picked 3v3 league simply because it was “competitive” — it involved playing for medals. I had a friend who would not encourage his boys to come play pickup even though I pointed out his sons would get thousands upon thousands of more touches than they would in 3v3 league. He wasn’t interested. I’m positive it was because it didn’t involve him as a coach and it wasn’t “competitive.” Consider the difference between 3v3 league and pickup soccer. On a league night a team would have two 20 minute games. At six players a team, that amounted to 20 minutes of soccer per player. Sometimes a family would be at 3v3 for several hours because they would be playing in the early game and the late game. So for an investment of 3-4 hours a player would get 20 minutes of soccer. In contrast, pickup soccer was 2 hours of soccer, period. The kids took breaks for water but I never saw anyone quit playing due to fatigue. True, quite often a kid crawled to the car when it ended.I didn’t continue it this year. I am sad to say I gave up on it. It was discouraging to set up the time and send out the email only to have a handful of players show up. One of the big problems was it wasn’t pickup for the neighborhood. I had parents driving 10 miles to drop off their son. There are a lot of tough issues to overcome. Log in to Reply Paul Hansen says: April 17, 2023 at 7:13 pm I have tried it off and on for the past couple of years. I’ve been so frustrated over all the structure in our kids soccer. It amounts to just practice, games or camps. I know of U13s who have been playing since U5 and have hardly played a game without a coach or parents giving input.Last year for my U11 team I started a pickup day for Sunday afternoons. This was during the competitive season. It was basically for the U11 age group but siblings were welcome as were kids from U10 & U9. I cut the age at that point because I was worried about little ones getting hurt. Parents were welcome to watch but were not allowed to talk to their kids. There was no coaching or officiating. The only thing I did was set up the fields (4v4) and did the drafting of players (names pulled from a hat). I kept it at 4v4 to encourage more touches. Every 20 minutes I would blow a whistle for team rotation. At the high point we had about 4 fields of 4v4.It was very interesting to observer the parents. Talking about control freaks! I had parents who simply could not watch their son play without “coaching” him — so those parents had to leave. I told the parents this was the kids’ time — it was time for them to play simply for the love of the game.I tried to sell it to the parents as free child care. They could drop their kids and go have a few free hours. I stayed there as a safety monitor.The interesting and sad thing was the lack of support from those who I consider hyper-competitive. In the summer lots of kids could not come to pickup soccer because they had 3v3 league. I swear the parents picked 3v3 league simply because it was “competitive” — it involved playing for medals. I had a friend who would not encourage his boys to come play pickup even though I pointed out his sons would get thousands upon thousands of more touches than they would in 3v3 league. He wasn’t interested. I’m positive it was because it didn’t involve him as a coach and it wasn’t “competitive.” Consider the difference between 3v3 league and pickup soccer. On a league night a team would have two 20 minute games. At six players a team, that amounted to 20 minutes of soccer per player. Sometimes a family would be at 3v3 for several hours because they would be playing in the early game and the late game. So for an investment of 3-4 hours a player would get 20 minutes of soccer. In contrast, pickup soccer was 2 hours of soccer, period. The kids took breaks for water but I never saw anyone quit playing due to fatigue. True, quite often a kid crawled to the car when it ended.I didn’t continue it this year. I am sad to say I gave up on it. It was discouraging to set up the time and send out the email only to have a handful of players show up. One of the big problems was it wasn’t pickup for the neighborhood. I had parents driving 10 miles to drop off their son. There are a lot of tough issues to overcome. Log in to Reply Jeff Ginn says: April 17, 2023 at 1:23 pm I currently coach 4 U10 teams. I am the Technical Director for myclub. The club is in a town that has a population of around 65,000. Ittakes 30 minutes to drive from one end of the county to the other. Thetrick that I have found is that by having multiple locations for pickup games and various styles of pick up games the kids beg to play.All spring long my kids have been asking when they are going to playbeach soccer (we play in volleyball courts), or street soccer (got tolove the “calle” revolution. Play 3v3, 4v4, or 5v5. There are4 types of “pick up soccer” that I provide. 1) beach soccer, thisis ridiculously attractive to players and parents because it is fun toplay and REAL fun to watch). 2)street soccer. We find a local churchparking lot (they are rarely used any other day than Sunday) and get acalle branded ball and play for hours. 3) play barefoot soccer ongrass (I call this pele days). This improves their feel for the ballmore than you can imagine. 4) just regular soccer. The trick is toorganize it, show the kids how fun it is and then privately ask theplayers on the team to call their teammates and invite them to meet upfor pick up games “by the end of the week.” Last summer I would go torun pick up beach soccer and I’d have other teams from the club usingthe volleyball courts. We would simply adapt and head over to theparking lot for street soccer or head to the grass from “pele days” ifpeople didn’t bring equipment.In regards to the parents, during the Summer, if you do this duringthe day, try to make it during the lunch hours so the stay at homeparent can invite the working parent to have a picnic at the park withthem. The picnic idea is actually a real big success. The parents ge tospend some quality time together and they focus on catching up andeating so much that the kids playing is simply entertainment. Itseriously works.A couple of rules for the parents: have to sit over 25 yards away “toavoid getting hit by a ball that may come out of play.” And they can’taddress the players except to offer water or a snack when their childtakes a break or their team is not on.The coaches role, get a lawn chair, hang out and get to know theparents better so they feel more comfortable asking questionsregarding soccer, playing time, etc that they seem to be scared toapproach us coaches about during the season. Big thing.. Make sure itis fun and let kids be kids… Argueing, fighting over throw ins andmissed or made goals… That was some of the best parts of stick ballgrowing up… Arguing with the friends about fair or foul balls etc.One last thing, get the Pugg Goals or the Infinity goals made byKwikGoal. Its much more fun to have a net to shoot when they play small sided games.Hope this helps!-GinnP.S. A Sam Snow reply to me via email about indoor and other types of games:http://coachginn.blogspot.com/2008/10/i-bothered-sam-snow-he-replied.html Log in to Reply Jeff Ginn says: April 17, 2023 at 3:34 pm I currently coach 4 U10 teams. I am the Technical Director for myclub. The club is in a town that has a population of around 65,000. Ittakes 30 minutes to drive from one end of the county to the other. Thetrick that I have found is that by having multiple locations for pickup games and various styles of pick up games the kids beg to play.All spring long my kids have been asking when they are going to playbeach soccer (we play in volleyball courts), or street soccer (got tolove the “calle” revolution. Play 3v3, 4v4, or 5v5. There are4 types of “pick up soccer” that I provide. 1) beach soccer, thisis ridiculously attractive to players and parents because it is fun toplay and REAL fun to watch). 2)street soccer. We find a local churchparking lot (they are rarely used any other day than Sunday) and get acalle branded ball and play for hours. 3) play barefoot soccer ongrass (I call this pele days). This improves their feel for the ballmore than you can imagine. 4) just regular soccer. The trick is toorganize it, show the kids how fun it is and then privately ask theplayers on the team to call their teammates and invite them to meet upfor pick up games “by the end of the week.” Last summer I would go torun pick up beach soccer and I’d have other teams from the club usingthe volleyball courts. We would simply adapt and head over to theparking lot for street soccer or head to the grass from “pele days” ifpeople didn’t bring equipment.In regards to the parents, during the Summer, if you do this duringthe day, try to make it during the lunch hours so the stay at homeparent can invite the working parent to have a picnic at the park withthem. The picnic idea is actually a real big success. The parents ge tospend some quality time together and they focus on catching up andeating so much that the kids playing is simply entertainment. Itseriously works.A couple of rules for the parents: have to sit over 25 yards away “toavoid getting hit by a ball that may come out of play.” And they can’taddress the players except to offer water or a snack when their childtakes a break or their team is not on.The coaches role, get a lawn chair, hang out and get to know theparents better so they feel more comfortable asking questionsregarding soccer, playing time, etc that they seem to be scared toapproach us coaches about during the season. Big thing.. Make sure itis fun and let kids be kids… Argueing, fighting over throw ins andmissed or made goals… That was some of the best parts of stick ballgrowing up… Arguing with the friends about fair or foul balls etc.One last thing, get the Pugg Goals or the Infinity goals made byKwikGoal. Its much more fun to have a net to shoot when they play small sided games.Hope this helps!-GinnP.S. A Sam Snow reply to me via email about indoor and other types of games:http://coachginn.blogspot.com/2008/10/i-bothered-sam-snow-he-replied.html Log in to Reply Jeff Ginn says: April 17, 2023 at 7:25 pm I currently coach 4 U10 teams. I am the Technical Director for myclub. The club is in a town that has a population of around 65,000. Ittakes 30 minutes to drive from one end of the county to the other. Thetrick that I have found is that by having multiple locations for pickup games and various styles of pick up games the kids beg to play.All spring long my kids have been asking when they are going to playbeach soccer (we play in volleyball courts), or street soccer (got tolove the “calle” revolution. Play 3v3, 4v4, or 5v5. There are4 types of “pick up soccer” that I provide. 1) beach soccer, thisis ridiculously attractive to players and parents because it is fun toplay and REAL fun to watch). 2)street soccer. We find a local churchparking lot (they are rarely used any other day than Sunday) and get acalle branded ball and play for hours. 3) play barefoot soccer ongrass (I call this pele days). This improves their feel for the ballmore than you can imagine. 4) just regular soccer. The trick is toorganize it, show the kids how fun it is and then privately ask theplayers on the team to call their teammates and invite them to meet upfor pick up games “by the end of the week.” Last summer I would go torun pick up beach soccer and I’d have other teams from the club usingthe volleyball courts. We would simply adapt and head over to theparking lot for street soccer or head to the grass from “pele days” ifpeople didn’t bring equipment.In regards to the parents, during the Summer, if you do this duringthe day, try to make it during the lunch hours so the stay at homeparent can invite the working parent to have a picnic at the park withthem. The picnic idea is actually a real big success. The parents ge tospend some quality time together and they focus on catching up andeating so much that the kids playing is simply entertainment. Itseriously works.A couple of rules for the parents: have to sit over 25 yards away “toavoid getting hit by a ball that may come out of play.” And they can’taddress the players except to offer water or a snack when their childtakes a break or their team is not on.The coaches role, get a lawn chair, hang out and get to know theparents better so they feel more comfortable asking questionsregarding soccer, playing time, etc that they seem to be scared toapproach us coaches about during the season. Big thing.. Make sure itis fun and let kids be kids… Argueing, fighting over throw ins andmissed or made goals… That was some of the best parts of stick ballgrowing up… Arguing with the friends about fair or foul balls etc.One last thing, get the Pugg Goals or the Infinity goals made byKwikGoal. Its much more fun to have a net to shoot when they play small sided games.Hope this helps!-GinnP.S. A Sam Snow reply to me via email about indoor and other types of games:http://coachginn.blogspot.com/2008/10/i-bothered-sam-snow-he-replied.html Log in to Reply Jeff Ginn says: April 17, 2023 at 1:42 pm Pick Up Soccer TWEET: U14 Premier & Select Girls playing #street #soccer thanks to @CalleRepublic. Multiple environments @infinitysoccer #futureUSnats http://twitvid.com/XTFMF Log in to Reply Jeff Ginn says: April 17, 2023 at 9:25 pm Pick Up Soccer TWEET: U14 Premier & Select Girls playing #street #soccer thanks to @CalleRepublic. Multiple environments @infinitysoccer #futureUSnats http://twitvid.com/XTFMF Log in to Reply Will Reeve says: April 17, 2023 at 1:56 pm We did this very thing this past spring on Fridays after school. The response was awesome. Even kids that had not previously played were enticed into the fun and some have now registered for fall recreational ball. Log in to Reply Will Reeve says: April 17, 2023 at 10:49 pm We did this very thing this past spring on Fridays after school. The response was awesome. Even kids that had not previously played were enticed into the fun and some have now registered for fall recreational ball. Log in to Reply Leave a comment Cancel replyYou must be logged in to post a comment. Leave a comment Search for: Search Recent News Soccer on TV February 24, 2025February 24, 2025 Tony Meola is recovering after suffering heart attack February 24, 2025February 24, 2025 PSG sinks Lyon to stay unbeaten February 24, 2025February 24, 2025 Americans Abroad: Josh Sargent strikes twice in Norwich City win February 24, 2025February 24, 2025 MLS summaries: Matchday 1 (Feb. 22-23) February 24, 2025February 24, 2025 Twitter Facebook Soccer America is the source for America’s passionate soccer fans. Our expert editorial teams take readers inside the big soccer stories in America and the world. Men’s and Women’s U.S. National Teams. MLS. Interviews with U.S. and world news makers. Learn More » About Us Contact Us Advertise Privacy/Terms & Conditions FAQ Contact Us 145 Pipers Hill Road Wilton, CT 06897 USA tel. 347-762-2640, fax 917-591-3261 feedback@socceramerica.com © 2025 Soccer America. All rights reserved Powered by Newspack Privacy Policy Sign in Close Sign in with Google Or Enter the code sent to your email. Email address Enter your password Sign in by entering the code we sent to , or clicking the magic link in the email. Continue Resend code Email me a one-time code instead Forgot password Create an account Sign in to an existing account Go back Continue Set a password (optional) This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.",
      "title": "Published Time: 2010-04-01T21:03:53Z NULL Close Join Soccer America Pro Sign In Search for: Search Sections Open dropdown menu Men’s National Team Women’s National Team MLS NWSL USL NISA Men’s World Cup Women’s World Cup Olympics Americans Abroad Youth College Men College Women International Expansion Television Business Referees News Open dropdown menu Soccer America Daily Soccer America Top of the News Game Report Soccer on TV SoccerTalk with Paul Gardner Soccer America Confidential Community Open dropdown menu Youth Soccer Insider Camps and Academies Tournament Calendar Jobs Soccer Glossary About Open dropdown menu About Us Contact Us Refund Policy Advertise Frequently Asked Questions Twitter Facebook Close Join Soccer America Pro Sections Men’s National Team Women’s National Team MLS NWSL USL NISA Men’s World Cup Women’s World Cup Olympics Americans Abroad Youth College Men College Women International Expansion Television Business Referees News Soccer America Daily Soccer America Top of the News Game Report Soccer on TV SoccerTalk with Paul Gardner Soccer America Confidential Community Youth Soccer Insider Camps and Academies Tournament Calendar Jobs Soccer Glossary About About Us Contact Us Refund Policy Advertise Frequently Asked Questions Skip to content Menu Soccer America Home for America's Passionate Soccer Fans Sections Open dropdown menu Men’s National Team Women’s National Team MLS NWSL USL NISA Men’s World Cup Women’s World Cup Olympics Americans Abroad Youth College Men College Women International Expansion Television Business Referees News Open dropdown menu Soccer America Daily Soccer America Top of the News Game Report Soccer on TV SoccerTalk with Paul Gardner Soccer America Confidential Community Open dropdown menu Youth Soccer Insider Camps and Academies Tournament Calendar Jobs Soccer Glossary About Open dropdown menu About Us Contact Us Refund Policy Advertise Frequently Asked Questions Join Soccer America Pro Sign In Open Search Search for: Search Menu Sign In Home » Story » Get up and start a pickup game Posted inStory, Youth Soccer Insider Get up and start a pickup game by April 1, 2010November 7, 2023 Share this: Click to share on Facebook (Opens in new window) Click to share on X (Opens in new window) By Paul Giovanopoulos Are our kids playing enough pickup ball? There have been countless articles written about this. While we all agree that this is nothappening enough, many of us just sit back and hope it starts to happen somehow on its own. We hope that somehow they start playing at the schoolyard at recess, or they come home to texttheir friends to go to the local park and play. Today’s suburbia logistics probably would not allow for this. So maybe we can organize pickup soccer. I know many of you just startedlaughing as it goes against the philosophy of the pickup game. However there is merit to this. I am taking the steps this spring and summer to organize a pickup soccer day. What I mean bythis, is reach out to all the soccer players in the neighborhood, set a place and time, bring up cones, balls, bibs, and then leave them alone for 90 minutes. They can break up into teamsthemselves, and just play. No parents or coaches providing any type of advice or thoughts. They can ref themselves, keep score and keep time limits on their games. As a kid growing up inGreece, I remember I could not wait to run to the local park and be selected for a team to play with my friends. It was only kids, and we pretended to be our local heroes playing the game.There were 22 refs on the field. Every play was contested. Every offside, every foul, even the how were teams selected. At the end it was so much fun, we couldn’t wait to do it againthe next day. So often today, all we do is structured training sessions. We are sucking the fun and creativity out of the most beautiful game in the world. (PaulGiovanopoulos of Media, Pa., coaches the Rose Tree Gunners U13.) Do you have an idea for a Youth Insider Soccer column? We’d love to hear it. E-mail usat: mike@socceramerica.com. Tagged: youth boys, youth girls Join the Conversation 13 Comments Thomas Hosier says: April 17, 2023 at 1:18 pm I believe Paul Giovanopoulos is on the mark! The main thing is consistency … set the day, the time and the place and make it happen every week and the numbers will grow. It is true that many boys and girls are doing “many” things in addition to soccer … the real soccer dudes and dudettes will find a way to the “pick-up play pitch.” No coaching … let them play! Log in to Reply Thomas Hosier says: April 17, 2023 at 3:30 pm I believe Paul Giovanopoulos is on the mark! The main thing is consistency … set the day, the time and the place and make it happen every week and the numbers will grow. It is true that many boys and girls are doing “many” things in addition to soccer … the real soccer dudes and dudettes will find a way to the “pick-up play pitch.” No coaching … let them play! Log in to Reply Thomas Hosier says: April 17, 2023 at 6:58 pm I believe Paul Giovanopoulos is on the mark! The main thing is consistency … set the day, the time and the place and make it happen every week and the numbers will grow. It is true that many boys and girls are doing “many” things in addition to soccer … the real soccer dudes and dudettes will find a way to the “pick-up play pitch.” No coaching … let them play! Log in to Reply Paul Hansen says: April 17, 2023 at 1:21 pm I have tried it off and on for the past couple of years. I’ve been so frustrated over all the structure in our kids soccer. It amounts to just practice, games or camps. I know of U13s who have been playing since U5 and have hardly played a game without a coach or parents giving input.Last year for my U11 team I started a pickup day for Sunday afternoons. This was during the competitive season. It was basically for the U11 age group but siblings were welcome as were kids from U10 & U9. I cut the age at that point because I was worried about little ones getting hurt. Parents were welcome to watch but were not allowed to talk to their kids. There was no coaching or officiating. The only thing I did was set up the fields (4v4) and did the drafting of players (names pulled from a hat). I kept it at 4v4 to encourage more touches. Every 20 minutes I would blow a whistle for team rotation. At the high point we had about 4 fields of 4v4.It was very interesting to observer the parents. Talking about control freaks! I had parents who simply could not watch their son play without “coaching” him — so those parents had to leave. I told the parents this was the kids’ time — it was time for them to play simply for the love of the game.I tried to sell it to the parents as free child care. They could drop their kids and go have a few free hours. I stayed there as a safety monitor.The interesting and sad thing was the lack of support from those who I consider hyper-competitive. In the summer lots of kids could not come to pickup soccer because they had 3v3 league. I swear the parents picked 3v3 league simply because it was “competitive” — it involved playing for medals. I had a friend who would not encourage his boys to come play pickup even though I pointed out his sons would get thousands upon thousands of more touches than they would in 3v3 league. He wasn’t interested. I’m positive it was because it didn’t involve him as a coach and it wasn’t “competitive.” Consider the difference between 3v3 league and pickup soccer. On a league night a team would have two 20 minute games. At six players a team, that amounted to 20 minutes of soccer per player. Sometimes a family would be at 3v3 for several hours because they would be playing in the early game and the late game. So for an investment of 3-4 hours a player would get 20 minutes of soccer. In contrast, pickup soccer was 2 hours of soccer, period. The kids took breaks for water but I never saw anyone quit playing due to fatigue. True, quite often a kid crawled to the car when it ended.I didn’t continue it this year. I am sad to say I gave up on it. It was discouraging to set up the time and send out the email only to have a handful of players show up. One of the big problems was it wasn’t pickup for the neighborhood. I had parents driving 10 miles to drop off their son. There are a lot of tough issues to overcome. Log in to Reply Paul Hansen says: April 17, 2023 at 3:32 pm I have tried it off and on for the past couple of years. I’ve been so frustrated over all the structure in our kids soccer. It amounts to just practice, games or camps. I know of U13s who have been playing since U5 and have hardly played a game without a coach or parents giving input.Last year for my U11 team I started a pickup day for Sunday afternoons. This was during the competitive season. It was basically for the U11 age group but siblings were welcome as were kids from U10 & U9. I cut the age at that point because I was worried about little ones getting hurt. Parents were welcome to watch but were not allowed to talk to their kids. There was no coaching or officiating. The only thing I did was set up the fields (4v4) and did the drafting of players (names pulled from a hat). I kept it at 4v4 to encourage more touches. Every 20 minutes I would blow a whistle for team rotation. At the high point we had about 4 fields of 4v4.It was very interesting to observer the parents. Talking about control freaks! I had parents who simply could not watch their son play without “coaching” him — so those parents had to leave. I told the parents this was the kids’ time — it was time for them to play simply for the love of the game.I tried to sell it to the parents as free child care. They could drop their kids and go have a few free hours. I stayed there as a safety monitor.The interesting and sad thing was the lack of support from those who I consider hyper-competitive. In the summer lots of kids could not come to pickup soccer because they had 3v3 league. I swear the parents picked 3v3 league simply because it was “competitive” — it involved playing for medals. I had a friend who would not encourage his boys to come play pickup even though I pointed out his sons would get thousands upon thousands of more touches than they would in 3v3 league. He wasn’t interested. I’m positive it was because it didn’t involve him as a coach and it wasn’t “competitive.” Consider the difference between 3v3 league and pickup soccer. On a league night a team would have two 20 minute games. At six players a team, that amounted to 20 minutes of soccer per player. Sometimes a family would be at 3v3 for several hours because they would be playing in the early game and the late game. So for an investment of 3-4 hours a player would get 20 minutes of soccer. In contrast, pickup soccer was 2 hours of soccer, period. The kids took breaks for water but I never saw anyone quit playing due to fatigue. True, quite often a kid crawled to the car when it ended.I didn’t continue it this year. I am sad to say I gave up on it. It was discouraging to set up the time and send out the email only to have a handful of players show up. One of the big problems was it wasn’t pickup for the neighborhood. I had parents driving 10 miles to drop off their son. There are a lot of tough issues to overcome. Log in to Reply Paul Hansen says: April 17, 2023 at 7:13 pm I have tried it off and on for the past couple of years. I’ve been so frustrated over all the structure in our kids soccer. It amounts to just practice, games or camps. I know of U13s who have been playing since U5 and have hardly played a game without a coach or parents giving input.Last year for my U11 team I started a pickup day for Sunday afternoons. This was during the competitive season. It was basically for the U11 age group but siblings were welcome as were kids from U10 & U9. I cut the age at that point because I was worried about little ones getting hurt. Parents were welcome to watch but were not allowed to talk to their kids. There was no coaching or officiating. The only thing I did was set up the fields (4v4) and did the drafting of players (names pulled from a hat). I kept it at 4v4 to encourage more touches. Every 20 minutes I would blow a whistle for team rotation. At the high point we had about 4 fields of 4v4.It was very interesting to observer the parents. Talking about control freaks! I had parents who simply could not watch their son play without “coaching” him — so those parents had to leave. I told the parents this was the kids’ time — it was time for them to play simply for the love of the game.I tried to sell it to the parents as free child care. They could drop their kids and go have a few free hours. I stayed there as a safety monitor.The interesting and sad thing was the lack of support from those who I consider hyper-competitive. In the summer lots of kids could not come to pickup soccer because they had 3v3 league. I swear the parents picked 3v3 league simply because it was “competitive” — it involved playing for medals. I had a friend who would not encourage his boys to come play pickup even though I pointed out his sons would get thousands upon thousands of more touches than they would in 3v3 league. He wasn’t interested. I’m positive it was because it didn’t involve him as a coach and it wasn’t “competitive.” Consider the difference between 3v3 league and pickup soccer. On a league night a team would have two 20 minute games. At six players a team, that amounted to 20 minutes of soccer per player. Sometimes a family would be at 3v3 for several hours because they would be playing in the early game and the late game. So for an investment of 3-4 hours a player would get 20 minutes of soccer. In contrast, pickup soccer was 2 hours of soccer, period. The kids took breaks for water but I never saw anyone quit playing due to fatigue. True, quite often a kid crawled to the car when it ended.I didn’t continue it this year. I am sad to say I gave up on it. It was discouraging to set up the time and send out the email only to have a handful of players show up. One of the big problems was it wasn’t pickup for the neighborhood. I had parents driving 10 miles to drop off their son. There are a lot of tough issues to overcome. Log in to Reply Jeff Ginn says: April 17, 2023 at 1:23 pm I currently coach 4 U10 teams. I am the Technical Director for myclub. The club is in a town that has a population of around 65,000. Ittakes 30 minutes to drive from one end of the county to the other. Thetrick that I have found is that by having multiple locations for pickup games and various styles of pick up games the kids beg to play.All spring long my kids have been asking when they are going to playbeach soccer (we play in volleyball courts), or street soccer (got tolove the “calle” revolution. Play 3v3, 4v4, or 5v5. There are4 types of “pick up soccer” that I provide. 1) beach soccer, thisis ridiculously attractive to players and parents because it is fun toplay and REAL fun to watch). 2)street soccer. We find a local churchparking lot (they are rarely used any other day than Sunday) and get acalle branded ball and play for hours. 3) play barefoot soccer ongrass (I call this pele days). This improves their feel for the ballmore than you can imagine. 4) just regular soccer. The trick is toorganize it, show the kids how fun it is and then privately ask theplayers on the team to call their teammates and invite them to meet upfor pick up games “by the end of the week.” Last summer I would go torun pick up beach soccer and I’d have other teams from the club usingthe volleyball courts. We would simply adapt and head over to theparking lot for street soccer or head to the grass from “pele days” ifpeople didn’t bring equipment.In regards to the parents, during the Summer, if you do this duringthe day, try to make it during the lunch hours so the stay at homeparent can invite the working parent to have a picnic at the park withthem. The picnic idea is actually a real big success. The parents ge tospend some quality time together and they focus on catching up andeating so much that the kids playing is simply entertainment. Itseriously works.A couple of rules for the parents: have to sit over 25 yards away “toavoid getting hit by a ball that may come out of play.” And they can’taddress the players except to offer water or a snack when their childtakes a break or their team is not on.The coaches role, get a lawn chair, hang out and get to know theparents better so they feel more comfortable asking questionsregarding soccer, playing time, etc that they seem to be scared toapproach us coaches about during the season. Big thing.. Make sure itis fun and let kids be kids… Argueing, fighting over throw ins andmissed or made goals… That was some of the best parts of stick ballgrowing up… Arguing with the friends about fair or foul balls etc.One last thing, get the Pugg Goals or the Infinity goals made byKwikGoal. Its much more fun to have a net to shoot when they play small sided games.Hope this helps!-GinnP.S. A Sam Snow reply to me via email about indoor and other types of games:http://coachginn.blogspot.com/2008/10/i-bothered-sam-snow-he-replied.html Log in to Reply Jeff Ginn says: April 17, 2023 at 3:34 pm I currently coach 4 U10 teams. I am the Technical Director for myclub. The club is in a town that has a population of around 65,000. Ittakes 30 minutes to drive from one end of the county to the other. Thetrick that I have found is that by having multiple locations for pickup games and various styles of pick up games the kids beg to play.All spring long my kids have been asking when they are going to playbeach soccer (we play in volleyball courts), or street soccer (got tolove the “calle” revolution. Play 3v3, 4v4, or 5v5. There are4 types of “pick up soccer” that I provide. 1) beach soccer, thisis ridiculously attractive to players and parents because it is fun toplay and REAL fun to watch). 2)street soccer. We find a local churchparking lot (they are rarely used any other day than Sunday) and get acalle branded ball and play for hours. 3) play barefoot soccer ongrass (I call this pele days). This improves their feel for the ballmore than you can imagine. 4) just regular soccer. The trick is toorganize it, show the kids how fun it is and then privately ask theplayers on the team to call their teammates and invite them to meet upfor pick up games “by the end of the week.” Last summer I would go torun pick up beach soccer and I’d have other teams from the club usingthe volleyball courts. We would simply adapt and head over to theparking lot for street soccer or head to the grass from “pele days” ifpeople didn’t bring equipment.In regards to the parents, during the Summer, if you do this duringthe day, try to make it during the lunch hours so the stay at homeparent can invite the working parent to have a picnic at the park withthem. The picnic idea is actually a real big success. The parents ge tospend some quality time together and they focus on catching up andeating so much that the kids playing is simply entertainment. Itseriously works.A couple of rules for the parents: have to sit over 25 yards away “toavoid getting hit by a ball that may come out of play.” And they can’taddress the players except to offer water or a snack when their childtakes a break or their team is not on.The coaches role, get a lawn chair, hang out and get to know theparents better so they feel more comfortable asking questionsregarding soccer, playing time, etc that they seem to be scared toapproach us coaches about during the season. Big thing.. Make sure itis fun and let kids be kids… Argueing, fighting over throw ins andmissed or made goals… That was some of the best parts of stick ballgrowing up… Arguing with the friends about fair or foul balls etc.One last thing, get the Pugg Goals or the Infinity goals made byKwikGoal. Its much more fun to have a net to shoot when they play small sided games.Hope this helps!-GinnP.S. A Sam Snow reply to me via email about indoor and other types of games:http://coachginn.blogspot.com/2008/10/i-bothered-sam-snow-he-replied.html Log in to Reply Jeff Ginn says: April 17, 2023 at 7:25 pm I currently coach 4 U10 teams. I am the Technical Director for myclub. The club is in a town that has a population of around 65,000. Ittakes 30 minutes to drive from one end of the county to the other. Thetrick that I have found is that by having multiple locations for pickup games and various styles of pick up games the kids beg to play.All spring long my kids have been asking when they are going to playbeach soccer (we play in volleyball courts), or street soccer (got tolove the “calle” revolution. Play 3v3, 4v4, or 5v5. There are4 types of “pick up soccer” that I provide. 1) beach soccer, thisis ridiculously attractive to players and parents because it is fun toplay and REAL fun to watch). 2)street soccer. We find a local churchparking lot (they are rarely used any other day than Sunday) and get acalle branded ball and play for hours. 3) play barefoot soccer ongrass (I call this pele days). This improves their feel for the ballmore than you can imagine. 4) just regular soccer. The trick is toorganize it, show the kids how fun it is and then privately ask theplayers on the team to call their teammates and invite them to meet upfor pick up games “by the end of the week.” Last summer I would go torun pick up beach soccer and I’d have other teams from the club usingthe volleyball courts. We would simply adapt and head over to theparking lot for street soccer or head to the grass from “pele days” ifpeople didn’t bring equipment.In regards to the parents, during the Summer, if you do this duringthe day, try to make it during the lunch hours so the stay at homeparent can invite the working parent to have a picnic at the park withthem. The picnic idea is actually a real big success. The parents ge tospend some quality time together and they focus on catching up andeating so much that the kids playing is simply entertainment. Itseriously works.A couple of rules for the parents: have to sit over 25 yards away “toavoid getting hit by a ball that may come out of play.” And they can’taddress the players except to offer water or a snack when their childtakes a break or their team is not on.The coaches role, get a lawn chair, hang out and get to know theparents better so they feel more comfortable asking questionsregarding soccer, playing time, etc that they seem to be scared toapproach us coaches about during the season. Big thing.. Make sure itis fun and let kids be kids… Argueing, fighting over throw ins andmissed or made goals… That was some of the best parts of stick ballgrowing up… Arguing with the friends about fair or foul balls etc.One last thing, get the Pugg Goals or the Infinity goals made byKwikGoal. Its much more fun to have a net to shoot when they play small sided games.Hope this helps!-GinnP.S. A Sam Snow reply to me via email about indoor and other types of games:http://coachginn.blogspot.com/2008/10/i-bothered-sam-snow-he-replied.html Log in to Reply Jeff Ginn says: April 17, 2023 at 1:42 pm Pick Up Soccer TWEET: U14 Premier & Select Girls playing #street #soccer thanks to @CalleRepublic. Multiple environments @infinitysoccer #futureUSnats http://twitvid.com/XTFMF Log in to Reply Jeff Ginn says: April 17, 2023 at 9:25 pm Pick Up Soccer TWEET: U14 Premier & Select Girls playing #street #soccer thanks to @CalleRepublic. Multiple environments @infinitysoccer #futureUSnats http://twitvid.com/XTFMF Log in to Reply Will Reeve says: April 17, 2023 at 1:56 pm We did this very thing this past spring on Fridays after school. The response was awesome. Even kids that had not previously played were enticed into the fun and some have now registered for fall recreational ball. Log in to Reply Will Reeve says: April 17, 2023 at 10:49 pm We did this very thing this past spring on Fridays after school. The response was awesome. Even kids that had not previously played were enticed into the fun and some have now registered for fall recreational ball. Log in to Reply Leave a comment Cancel replyYou must be logged in to post a comment. Leave a comment Search for: Search Recent News Soccer on TV February 24, 2025February 24, 2025 Tony Meola is recovering after suffering heart attack February 24, 2025February 24, 2025 PSG sinks Lyon to stay unbeaten February 24, 2025February 24, 2025 Americans Abroad: Josh Sargent strikes twice in Norwich City win February 24, 2025February 24, 2025 MLS summaries: Matchday 1 (Feb. 22-23) February 24, 2025February 24, 2025 Twitter Facebook Soccer America is the source for America’s passionate soccer fans. Our expert editorial teams take readers inside the big soccer stories in America and the world. Men’s and Women’s U.S. National Teams. MLS. Interviews with U.S. and world news makers. Learn More » About Us Contact Us Advertise Privacy/Terms & Conditions FAQ Contact Us 145 Pipers Hill Road Wilton, CT 06897 USA tel. 347-762-2640, fax 917-591-3261 feedback@socceramerica.com © 2025 Soccer America. All rights reserved Powered by Newspack Privacy Policy Sign in Close Sign in with Google Or Enter the code sent to your email. Email address Enter your password Sign in by entering the code we sent to , or clicking the magic link in the email. Continue Resend code Email me a one-time code instead Forgot password Create an account Sign in to an existing account Go back Continue Set a password (optional) This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
    },
    {
      "url": "https://app.roll20.net/forum/post/111760/pick-up-games-and-social-contracts",
      "content": "Community Forums: Pick up Games and Social Contracts | Roll20: Online virtual tabletop Roll20 uses cookies to improve your experience on our site. Cookies enable you to enjoy certain features, social sharing functionality, and tailor message and display ads to your interests on our site and others. They also help us understand how our site is being used. By continuing to use our site, you consent to our use of cookies. Update your cookie preferences here. × × Cookie Preferences Accept cookies We use Cookies to help personalize and improve Roll20. For more information on our use of non-essential Cookies, visit our Privacy Policy here. Create a free account Menu Home My Games Join a Game Marketplace Characters Compendium Forums Subscribe Help Center Wiki Blog Sign In Sign In : New D&D Character Sheet Available Roll20's new D&D character sheet, which supports both 2014 and 2024 rules, is live and free for all users. Use Both D&D 5E Character Sheets Both classic and new D&D 5E sheets can be used in a single campaign, exclusively in Jumpgate. Effects (FX) Tool Now Free for All! Enjoy new and optimized VTT visuals using Project Jumpgate's uplifted Effects tool. Roll20 Characters: D&D + Candela Obscura D&D 5E + Candela Obscura sheets are now available in Roll20 Characters to create and manage outside the VTT. See More Play Now Join a Game Marketplace Toggle Dropdown What's New Browse Give a Gift Redeem a Code D&D Core Rulebook Bundle (2024) by Wizards of the Coast D&D Curse of Strahd by Wizards of the Coast Pathfinder Core Mega Bundle by Paizo Cyberpunk RED by R. Talsorian Games Tools Toggle Dropdown Compendium Characters Manage Audio Token Marker Library Roll20 Companion App D&D Hub Marvel Hub GM Hub Dungeon Scrawl Demiplane Characters Create, Manage, and Play Characters Compendium Your System Come To Life Character Vault Create, Manage, and Play Characters Dungeon Scrawl Create Maps for your Games Community Toggle Dropdown Blog Help Center Change Log Forums Community Wiki Live Stream VODs Ambassador Program The New Roll20 Tabletop Play Roll20 on Discord Play D&D 2024 Demiplane Joins Roll20 Subscribe Sign In Sign In : New D&D Character Sheet Available Roll20's new D&D character sheet, which supports both 2014 and 2024 rules, is live and free for all users. Use Both D&D 5E Character Sheets Both classic and new D&D 5E sheets can be used in a single campaign, exclusively in Jumpgate. Effects (FX) Tool Now Free for All! Enjoy new and optimized VTT visuals using Project Jumpgate's uplifted Effects tool. Roll20 Characters: D&D + Candela Obscura D&D 5E + Candela Obscura sheets are now available in Roll20 Characters to create and manage outside the VTT. See More This post has been closed. You can still view previous posts, but you can't post any new replies. Pick up Games and Social Contracts Community Forums General Off-Topic Announcements Dungeon Scrawl Specific Use Questions & Macros Mods (API Scripts) Character Sheets & Compendium Roll20 Marketplace & Creative Content Looking For Group: Free Games Looking For Group: Paid Games Suggestions & Ideas Bug Reports & Technical Issues Pick up Games and Social Contracts April 06 (11 years ago) Jamez B. Permalink for 111760 Quote PICKUP GAMES There was another recent post that someone commented how players are playing pick up games, but they choose to play with friends. Some of us are here to play with friends over distance, with added tools, or for lack of playing space. Many others for issues of schedualing, living n remote regions, being beginners or a multitude of other reasons don't have anyone else we know to join in playing d&d. So there are many palyers looking for groups, starting pick ups, etc... I played irl with friends, then on another service with friends, I started to DM in some one offs here, and then I've been trying some longer campaigns with random groups or people from one offs. What I've found with these pick up games is ((This isn't meant as offence to anyone I've played with, just parts of my experiences that could be improved. There's been some good games)): Open inventations lead to dozens of players clicking and never posting. Players don't show up, show up once and never return, or attendence is spotty. The DM can sometimes disapear for weeks or be completely disorganized. House rules are not clearly explained before the game. Drastic player differences can cause conflict, something that needs DM resolution and isn't useful perpetuating. Pick up games seam best to me for one offs. You can use these to hand pick players for longer running session serries, ones that match your play style and mesh well together. In addition to this, if you're looking to run a longer campaign successfully, then you might want to consider a social contract. SOCIAL CONTRACT Seeing as I played with friends, I found this idea that was rather new to me, but essentially what we do each game when we look for players...stating the rule system, game times, etc... but more in depth to make sure everyone's expectations are the same. Mismatched expectations are where conflict come in and it is useful to avoid them up front to keep things running smoothly. Here is an article about social contract, with suggested list of items to include: http://rpgathenaeum.wordpress.com/2009/04/07/is-a-social-contract-right-for-your-dd-group/ We don't have to worry about snacks so much as bathroom breaks. Other things to add after player discussion: Outside communications needed (such as skype) Loot splitting (also party fund) How much meta gaming is acceptable Player death (saw this in another article) Resolving player-player conflict (this is after one bad experience I had recently) Timing...What time the game starts, how long players should wait if GM is delayed (I'd suggest 15 mins), etc.. Giving notice (should give notice if going to be late, etc) Criticals and failures (critical failures should need to be confirmed, there's some good discussions on this out there) Any other variation rules to be used (ex: alternative spell charging, Unearthed arcana p154) The DM can add things to this later when problems arise: If turns are taking too long that person is delayed in initiative OR players get +1 to attack if ready/-1 to attack for taking more than a minuet to act. Players trying to steal/bluff/etc other players is causing game disruptions, players cannot attack/steal from one another April 21 (11 years ago) The Evil DM Permalink for 129173 Quote Social contracts? That's a bit harsh. April 21 (11 years ago) Jamez B. Permalink for 129265 Quote Social contract is a term that's been catching on. It's any agreement about the game...you agree what rules, when/where to meet, etc... This expands it and puts to writing any shared understanding including the type of game, rule variations, and resolutions to problems. The easiest way to avoid problems is to have players expectations match. I posted this here because online pick up games can be slightly different than those in person (such as choosing which voice software would be required). April 21 (11 years ago) The Evil DM Permalink for 129675 Quote To be honest James, I think it's not needed -- if I saw this before a game I was going to play, I would not join, and more then likely ignore the GM. If I joined a game and was presented with a contract, I'd drop out. I play to have fun and forget life for a while. With that said its perfectly fine for a GM to say, ok here is my game, this is when I am running it, here is my house rules. So to end this, to each their own.. Some people enjoy a lot of structure and rules while others just like to play. /shrug April 22 (11 years ago) Jamez B. Permalink for 129753 Quote This isn't an actual game Game: D&D Pathfinder Sources: Pathfinder (any books) Game time: Starting Saturday April 20th 7:00pm GMT, 8:00pm BST, 3pm EST, Noon PST. Meet weekly We will be using skype Character creation: Level 1, 7rolls of 4d6 drop lowest, 1k starting gold. Please include at least 5 sentences about your character's past, description and motivations. You are allowed 2 traits and we will be using hero points. Type of game: Mix of hack and slash, role play and adventure. Moderate magic. No home brew. Original adventure. Story driven. (Keep meta-gaming to minimum for role-players) House rules: No evil characters, No attacking party members You do not need a +1 to put magical effects on items Exploding skill rolls, if you roll 20 on skill check then reroll and add results. A one on skill roll does not auto fail if bonus is high enough. Overall, have fun and work together. --- People do this all the time, they just don't call it a social contract. Even LFG has basics for version/time, which is a minimal version of this. My point was some things are weighted different online. I was wondering what everyone tells players up front (such as using skype/ventrilo/google hangout). April 22 (11 years ago) The Evil DM Permalink for 129767 Quote Oh ok, well I thought what you included there would be standard of games. I thought you might have been talking about a long drawn out what ifs along with what will happen if party a doesn't do plan a... Contracts...sign here to play stuff. Which I've seen in face to face games. I went to a game at this guys house he had printed out an entire 12 page bound packet for all players to review and sign. I left quickly. April 22 (11 years ago) Lou The Mad Pro Permalink for 129849 Quote I gotta agree with the Lord of Cameras: some players dig that structure, some don't. Just as some GMing styles are appreciated by some players, while others will chafe, James. April 22 (11 years ago) iserith2 Permalink for 129883 Quote I think social contracts which grow out of a good Session Zero are compulsory if a group wants to start the game together on the same page. It's good for all kinds of groups, but especially important for longer running campaigns. My regular group and I have a great understanding and vision of what the game will be and we're always working in the same direction. That has a lot of benefits. With pick-up groups, the GM should at least express the minimum expectations he has for the game to run smoothly so that the players are aware of this and can opt out if the game is not for them. (I personally don't join games where I know I'm not going to like the DM's style. It's good to know this up-front.) Crunchy information as to sources permitted and house rules are good to see in advance as well. I tend to not like house rules in general (like critical fail rules or the like), so it's good to know what I'm getting into. I tend to run either one-session games or larger, three-to-four session games here on Roll20. In the longer-running games, I discuss pretty clearly how I like to run the game since it's more of a commitment. It's what players can expect during actual play. In the one-session games, I'm less verbose. Here's what I post for my longer games: TL;DR Version: Just say \"Yes,\" because everyone else is going to be saying \"Yes\" to you. First, I'll be in-game 15 minutes before start to get situated so you can do mic checks or the like. I recommend testing your setup prior to play. Unlike the Marines, we will leave you behind. Nothing personal. When actual play begins, I will frame the cold open - your current situation and some tension to be resolved. This is like that part of the TV show or movie before the opening credits. I'll answer any questions you have about the scene. Following the cold open, I will begin a session of questions and answers. This serves a few purposes. First, it will allow you to introduce your character to everyone - the concept, the mechanical abilities, memorable features. Then I will ask you some questions that will tie your character to the adventure and world, fleshing out both. Once we've gotten to everyone, I will then ask each player one more question that will deal with character bonds. This will tie you to at least one other character. As you answer these questions, you should note that no answer is wrong that doesn't contradict a previous bit of fiction that was established. Also, if your character is mentioned in someone's answer, you are encouraged to accept and build onto that player's contribution in a supportive manner. (The only exception is if that person said something that contradicts established fiction or if you find it offensive in some way.) Aside from fleshing things out, this is an exercise akin to what improvisational actors do before going on stage. It's a warm-up that allows you to brainstorm and get your mind into a creative mode prior to play. This is the time to get used to saying, \"Yes.\" It makes the rest of the game that much smoother. A note about your answers: Be concise. A Twitter-length response that is packed with possibilities is better than a long soliloquy about the intricate leatherwork of your codpiece. Conciseness is not a lack of detail. It's simply hitting the details that really matter or are particularly memorable. We have 5 people to get through. Keep that in mind. More details can and will emerge during play. To start, we just need something to work with and get us going. Once the Q&A is done, we'll flash back to the cold open scene and begin play. There are a couple of things to keep in mind here. First, there is no plot or predetermined story. It's just an adventure location with some stuff in it, creatures and NPCs pursuing their own instincts and goals. You have a main goal and no doubt some sub-goals that will arise as we play. When your goals conflict with others in the location, it will snowball into action and we'll play to find out what happens. The story is the things you guys do, not something the DM made up for you to experience. So make it grand. To that end, I will present you with challenges, but I have no idea what the solutions are. I don't even think about it or try to predict what you will do. There are no contingencies. Thus, you won't have to engage in boring discussions trying to figure out what the \"correct\" answer is (\"correct\" being traditionally defined as \"that thing the DM is thinking\"). The most correct answer is the one that is the most fun, whatever that means in context. I encourage you to say \"Yes\" to other players' ideas and add onto it with your own ideas. Don't say \"No\" because there is no particularly good reason to do this. This is known as the \"Yes, and...\" technique, the foundation to improvisational acting. Once the plan is in motion, the dice will determine its outcome. You can spend an hour to come up with the most \"foolproof\" plan ever and it will be tested with dice with standard level DCs, so that hour was most likely a waste of time. I have no bias and will not adjust DCs or number of successes required in any way. Even if your plan fails, it will fail in a way that is interesting, challenging, and fun. So don't worry about planning for every contingency, and certainly don't use that as an excuse to shoot down ideas and discourage your fellow players. Accept them and add onto them if you need to refine them. One of the worst ways to play, in my opinion, is to try and mitigate every possibility of failure. You're pulp action adventurers, so embrace it. Indiana Jones failed in the very first scene in Raiders of the Lost Ark and he went on to make three more movies! About an hour before our agreed-upon stopping point, I'm going to start looking for a cliffhanger ending. When it happens, I'll call for end of session. At that point, we'll have a little concluding Q&A to talk about what happened during the game, get feedback, and see what interesting questions remain to be answered in a future session. And that's it! I look forward to the game and if you have any questions, feel free to ask anytime. April 22 (11 years ago) Jamez B. Permalink for 130016 Quote I try to get character sheets and any workup to playing done before the first game session, so we can start playing 10-15 mins from when everyone gets there or scheduled start time. I think of my session zero more as any workup, that's how I use the game's forum. I try to get the hour+ of people writing up sheets and basic basic structure out of the way. I could try setting up a meeting/session before hand to do a more organic version rather than writing it up, just not something I've tried beyond having one on one conversations and discussion on game thread. I think newer DMs like a lot more structure. I'm not a total newb...but I'm still at that stage where I like to have a plan to fall back on, rather than trying to improvise most everything. (I'm not railroading, but having multiple NPCs, monsters, and scenarios outlined.) Lets say...the players just completely skipped the plot hooks they were offered to recover a stolen item for a reward and head out into the forest? That's ok, I've got a preservation society's representatives ready to ask them to find a magical beast and capture it, without killing it. They decided to kill the society representatives? Well next time they are in town the guards are going to be questioning them...and when they head into the forest deeper they find a camp of monsters roasting the rare mystical monster. On roll20 there's many people we don't know. If a DM says yes to everything when players have vastly different play styles....lets say one is trying to kill everything in sight while another had wanted to roleplay, interrogate or go on a quest. That can cause conflict (character conflict being ok if not disruptive, but not when it spills outside the roles of the game). A player's character dies because they purposely tried burning down a town for no reason and the town guard confiscated their items? Well we did discuss/outline you'd come back at a level lower, it's not a surprise. Maybe I've just been in too many groups with problem players and am focusing too much on heading off issues before they ever occur. It's just my experience mismatched expectations are the source of most problems and all being on the same page helps things go more smoothly and lets people focus on the story telling, adventure and fun. Thanks for your input ^.^ April 22 (11 years ago) iserith2 Permalink for 130025 Quote I don't use plot hooks as I find them problematic, in part, for the reasons you've given. I use premises the players want to see played (I ask them directly for their buy-in as players) and craft questions to link their characters to that premise as needed. A plot hook is essentially the DM asking if the players are interested in his or her idea - but in the context of the game. A \"No\" may mean wasted prep, or at least, having it shelved for an indeterminate amount of time. I prefer to ask directly outside of the context of the game. The upside here is that if you're playing scenarios your players have expressed interest in, there's nobody going off and killing quest givers or skipping content. They've already given their inherent buy-in on the goals and objectives of the premise, so you can get right to it. Lots of focus, no wasted prep, and a faster pace for your game. If you've got players that are doing the things you describe in your examples, I can share solutions for that. But this sort of thing is certainly better for another thread. If you start it up, I'll surely participate. April 22 (11 years ago) Jamez B. Permalink for 130053 Quote That stuff isn't happening, but the general type of thing is the reasoning behind why I'd posted. 'Social contracts' seamed like a interesting idea, possibly extending the sort of outline we do already. It's a gentleman's agreement...I'm not asking anyone to sign anything. I might run a one-shot tower defense style D&D game where you have to protect something from wave after wave of enemies, all combat. The next week I could start a campaign where players are investigating strange happenings in a sleepy town with more roleplay and puzzles than anything. This is just a summery of things that sets each world apart, special rules, or agreements made with the party. There's enough people here you could probably find interest in all sorts of games, but you want to try to make sure you let them know what kind of game you've set up. April 22 (11 years ago) iserith2 Permalink for 130347 Quote James B. said: you want to try to make sure you let them know what kind of game you've set up. I completely agree. My only quibble is that a lot of DMs make these social contracts to put a patch on problems they themselves cause in the game due to their approach. DMs that post, \"I prefer roleplaying more than combat\" just says to me that the DM doesn't actually know what roleplaying is, and so I won't play in their game. A DM that denies certain source books (and not for thematic reasons) or decries evil characters similarly may be causing the problems they're trying to head off by limiting the players instead of reflecting on their own approach. If it works and players are willing to buy in to that, that's just fine, of course. It's good to have that information upfront. April 25 (11 years ago) The Evil DM Permalink for 134094 Quote Lou The Mad said: I gotta agree with the Lord of Cameras: some players dig that structure, some don't. Just as some GMing styles are appreciated by some players, while others will chafe, James. Lou... See the movie Hackers, you'll understand my name :) April 26 (11 years ago) Lou The Mad Pro Permalink for 134987 Quote Sorry. Anytime I see \"Hackers\" I get distracted by Angelina Jolie....mmmmm, she could corrupt my database any ti--......uh, what was I talking about again? 1 © Roll20, LLC | Terms of Service & Privacy Policy | DMCA | Contact Us | Help Center | All rights reserved. All product and company names are trademarks™ or registered® trademarks of their respective holders. Powered by Roll20 Roll20 The #1 Tabletop for Playing RPGs OnlineRoll20 The #1 Tabletop for Playing RPGs Online Roll20 Tabletop Roll20 Characters Roll20 Marketplace Roll20 Compendium DriveThru The Largest RPG MarketplaceDriveThru The Largest RPG Marketplace DriveThru DriveThruComics DriveThruFiction DriveThruCards Wargame Vault Demiplane Official Character Creation and Game CompanionDemiplane Official Character Creation and Game Companion Demiplane Pathfinder Nexus Daggerheart Nexus Vampire: The Masquerade Nexus Marvel Multiverse RPG Nexus Cosmere RPG Nexus Cyberpunk RED Nexus Dungeon Scrawl Create RPG Maps in MinutesDungeon Scrawl Create RPG Maps in Minutes Dungeon Scrawl Create a Map Community ContentCommunity Content Adventure by Fans Everywhere Dungeon Masters Guild (D&D) Pathfinder Infinite Starfinder Infinite Miskatonic Repository Storytellers Vault Everything for your adventures",
      "title": "Community Forums: Pick up Games and Social Contracts | Roll20: Online virtual tabletop Roll20 uses cookies to improve your experience on our site. Cookies enable you to enjoy certain features, social sharing functionality, and tailor message and display ads to your interests on our site and others. They also help us understand how our site is being used. By continuing to use our site, you consent to our use of cookies. Update your cookie preferences here. × × Cookie Preferences Accept cookies We use Cookies to help personalize and improve Roll20. For more information on our use of non-essential Cookies, visit our Privacy Policy here. Create a free account Menu Home My Games Join a Game Marketplace Characters Compendium Forums Subscribe Help Center Wiki Blog Sign In Sign In : New D&D Character Sheet Available Roll20's new D&D character sheet, which supports both 2014 and 2024 rules, is live and free for all users. Use Both D&D 5E Character Sheets Both classic and new D&D 5E sheets can be used in a single campaign, exclusively in Jumpgate. Effects (FX) Tool Now Free for All! Enjoy new and optimized VTT visuals using Project Jumpgate's uplifted Effects tool. Roll20 Characters: D&D + Candela Obscura D&D 5E + Candela Obscura sheets are now available in Roll20 Characters to create and manage outside the VTT. See More Play Now Join a Game Marketplace Toggle Dropdown What's New Browse Give a Gift Redeem a Code D&D Core Rulebook Bundle (2024) by Wizards of the Coast D&D Curse of Strahd by Wizards of the Coast Pathfinder Core Mega Bundle by Paizo Cyberpunk RED by R. Talsorian Games Tools Toggle Dropdown Compendium Characters Manage Audio Token Marker Library Roll20 Companion App D&D Hub Marvel Hub GM Hub Dungeon Scrawl Demiplane Characters Create, Manage, and Play Characters Compendium Your System Come To Life Character Vault Create, Manage, and Play Characters Dungeon Scrawl Create Maps for your Games Community Toggle Dropdown Blog Help Center Change Log Forums Community Wiki Live Stream VODs Ambassador Program The New Roll20 Tabletop Play Roll20 on Discord Play D&D 2024 Demiplane Joins Roll20 Subscribe Sign In Sign In : New D&D Character Sheet Available Roll20's new D&D character sheet, which supports both 2014 and 2024 rules, is live and free for all users. Use Both D&D 5E Character Sheets Both classic and new D&D 5E sheets can be used in a single campaign, exclusively in Jumpgate. Effects (FX) Tool Now Free for All! Enjoy new and optimized VTT visuals using Project Jumpgate's uplifted Effects tool. Roll20 Characters: D&D + Candela Obscura D&D 5E + Candela Obscura sheets are now available in Roll20 Characters to create and manage outside the VTT. See More This post has been closed. You can still view previous posts, but you can't post any new replies. Pick up Games and Social Contracts Community Forums General Off-Topic Announcements Dungeon Scrawl Specific Use Questions & Macros Mods (API Scripts) Character Sheets & Compendium Roll20 Marketplace & Creative Content Looking For Group: Free Games Looking For Group: Paid Games Suggestions & Ideas Bug Reports & Technical Issues Pick up Games and Social Contracts April 06 (11 years ago) Jamez B. Permalink for 111760 Quote PICKUP GAMES There was another recent post that someone commented how players are playing pick up games, but they choose to play with friends. Some of us are here to play with friends over distance, with added tools, or for lack of playing space. Many others for issues of schedualing, living n remote regions, being beginners or a multitude of other reasons don't have anyone else we know to join in playing d&d. So there are many palyers looking for groups, starting pick ups, etc... I played irl with friends, then on another service with friends, I started to DM in some one offs here, and then I've been trying some longer campaigns with random groups or people from one offs. What I've found with these pick up games is ((This isn't meant as offence to anyone I've played with, just parts of my experiences that could be improved. There's been some good games)): Open inventations lead to dozens of players clicking and never posting. Players don't show up, show up once and never return, or attendence is spotty. The DM can sometimes disapear for weeks or be completely disorganized. House rules are not clearly explained before the game. Drastic player differences can cause conflict, something that needs DM resolution and isn't useful perpetuating. Pick up games seam best to me for one offs. You can use these to hand pick players for longer running session serries, ones that match your play style and mesh well together. In addition to this, if you're looking to run a longer campaign successfully, then you might want to consider a social contract. SOCIAL CONTRACT Seeing as I played with friends, I found this idea that was rather new to me, but essentially what we do each game when we look for players...stating the rule system, game times, etc... but more in depth to make sure everyone's expectations are the same. Mismatched expectations are where conflict come in and it is useful to avoid them up front to keep things running smoothly. Here is an article about social contract, with suggested list of items to include: http://rpgathenaeum.wordpress.com/2009/04/07/is-a-social-contract-right-for-your-dd-group/ We don't have to worry about snacks so much as bathroom breaks. Other things to add after player discussion: Outside communications needed (such as skype) Loot splitting (also party fund) How much meta gaming is acceptable Player death (saw this in another article) Resolving player-player conflict (this is after one bad experience I had recently) Timing...What time the game starts, how long players should wait if GM is delayed (I'd suggest 15 mins), etc.. Giving notice (should give notice if going to be late, etc) Criticals and failures (critical failures should need to be confirmed, there's some good discussions on this out there) Any other variation rules to be used (ex: alternative spell charging, Unearthed arcana p154) The DM can add things to this later when problems arise: If turns are taking too long that person is delayed in initiative OR players get +1 to attack if ready/-1 to attack for taking more than a minuet to act. Players trying to steal/bluff/etc other players is causing game disruptions, players cannot attack/steal from one another April 21 (11 years ago) The Evil DM Permalink for 129173 Quote Social contracts? That's a bit harsh. April 21 (11 years ago) Jamez B. Permalink for 129265 Quote Social contract is a term that's been catching on. It's any agreement about the game...you agree what rules, when/where to meet, etc... This expands it and puts to writing any shared understanding including the type of game, rule variations, and resolutions to problems. The easiest way to avoid problems is to have players expectations match. I posted this here because online pick up games can be slightly different than those in person (such as choosing which voice software would be required). April 21 (11 years ago) The Evil DM Permalink for 129675 Quote To be honest James, I think it's not needed -- if I saw this before a game I was going to play, I would not join, and more then likely ignore the GM. If I joined a game and was presented with a contract, I'd drop out. I play to have fun and forget life for a while. With that said its perfectly fine for a GM to say, ok here is my game, this is when I am running it, here is my house rules. So to end this, to each their own.. Some people enjoy a lot of structure and rules while others just like to play. /shrug April 22 (11 years ago) Jamez B. Permalink for 129753 Quote This isn't an actual game Game: D&D Pathfinder Sources: Pathfinder (any books) Game time: Starting Saturday April 20th 7:00pm GMT, 8:00pm BST, 3pm EST, Noon PST. Meet weekly We will be using skype Character creation: Level 1, 7rolls of 4d6 drop lowest, 1k starting gold. Please include at least 5 sentences about your character's past, description and motivations. You are allowed 2 traits and we will be using hero points. Type of game: Mix of hack and slash, role play and adventure. Moderate magic. No home brew. Original adventure. Story driven. (Keep meta-gaming to minimum for role-players) House rules: No evil characters, No attacking party members You do not need a +1 to put magical effects on items Exploding skill rolls, if you roll 20 on skill check then reroll and add results. A one on skill roll does not auto fail if bonus is high enough. Overall, have fun and work together. --- People do this all the time, they just don't call it a social contract. Even LFG has basics for version/time, which is a minimal version of this. My point was some things are weighted different online. I was wondering what everyone tells players up front (such as using skype/ventrilo/google hangout). April 22 (11 years ago) The Evil DM Permalink for 129767 Quote Oh ok, well I thought what you included there would be standard of games. I thought you might have been talking about a long drawn out what ifs along with what will happen if party a doesn't do plan a... Contracts...sign here to play stuff. Which I've seen in face to face games. I went to a game at this guys house he had printed out an entire 12 page bound packet for all players to review and sign. I left quickly. April 22 (11 years ago) Lou The Mad Pro Permalink for 129849 Quote I gotta agree with the Lord of Cameras: some players dig that structure, some don't. Just as some GMing styles are appreciated by some players, while others will chafe, James. April 22 (11 years ago) iserith2 Permalink for 129883 Quote I think social contracts which grow out of a good Session Zero are compulsory if a group wants to start the game together on the same page. It's good for all kinds of groups, but especially important for longer running campaigns. My regular group and I have a great understanding and vision of what the game will be and we're always working in the same direction. That has a lot of benefits. With pick-up groups, the GM should at least express the minimum expectations he has for the game to run smoothly so that the players are aware of this and can opt out if the game is not for them. (I personally don't join games where I know I'm not going to like the DM's style. It's good to know this up-front.) Crunchy information as to sources permitted and house rules are good to see in advance as well. I tend to not like house rules in general (like critical fail rules or the like), so it's good to know what I'm getting into. I tend to run either one-session games or larger, three-to-four session games here on Roll20. In the longer-running games, I discuss pretty clearly how I like to run the game since it's more of a commitment. It's what players can expect during actual play. In the one-session games, I'm less verbose. Here's what I post for my longer games: TL;DR Version: Just say \"Yes,\" because everyone else is going to be saying \"Yes\" to you. First, I'll be in-game 15 minutes before start to get situated so you can do mic checks or the like. I recommend testing your setup prior to play. Unlike the Marines, we will leave you behind. Nothing personal. When actual play begins, I will frame the cold open - your current situation and some tension to be resolved. This is like that part of the TV show or movie before the opening credits. I'll answer any questions you have about the scene. Following the cold open, I will begin a session of questions and answers. This serves a few purposes. First, it will allow you to introduce your character to everyone - the concept, the mechanical abilities, memorable features. Then I will ask you some questions that will tie your character to the adventure and world, fleshing out both. Once we've gotten to everyone, I will then ask each player one more question that will deal with character bonds. This will tie you to at least one other character. As you answer these questions, you should note that no answer is wrong that doesn't contradict a previous bit of fiction that was established. Also, if your character is mentioned in someone's answer, you are encouraged to accept and build onto that player's contribution in a supportive manner. (The only exception is if that person said something that contradicts established fiction or if you find it offensive in some way.) Aside from fleshing things out, this is an exercise akin to what improvisational actors do before going on stage. It's a warm-up that allows you to brainstorm and get your mind into a creative mode prior to play. This is the time to get used to saying, \"Yes.\" It makes the rest of the game that much smoother. A note about your answers: Be concise. A Twitter-length response that is packed with possibilities is better than a long soliloquy about the intricate leatherwork of your codpiece. Conciseness is not a lack of detail. It's simply hitting the details that really matter or are particularly memorable. We have 5 people to get through. Keep that in mind. More details can and will emerge during play. To start, we just need something to work with and get us going. Once the Q&A is done, we'll flash back to the cold open scene and begin play. There are a couple of things to keep in mind here. First, there is no plot or predetermined story. It's just an adventure location with some stuff in it, creatures and NPCs pursuing their own instincts and goals. You have a main goal and no doubt some sub-goals that will arise as we play. When your goals conflict with others in the location, it will snowball into action and we'll play to find out what happens. The story is the things you guys do, not something the DM made up for you to experience. So make it grand. To that end, I will present you with challenges, but I have no idea what the solutions are. I don't even think about it or try to predict what you will do. There are no contingencies. Thus, you won't have to engage in boring discussions trying to figure out what the \"correct\" answer is (\"correct\" being traditionally defined as \"that thing the DM is thinking\"). The most correct answer is the one that is the most fun, whatever that means in context. I encourage you to say \"Yes\" to other players' ideas and add onto it with your own ideas. Don't say \"No\" because there is no particularly good reason to do this. This is known as the \"Yes, and...\" technique, the foundation to improvisational acting. Once the plan is in motion, the dice will determine its outcome. You can spend an hour to come up with the most \"foolproof\" plan ever and it will be tested with dice with standard level DCs, so that hour was most likely a waste of time. I have no bias and will not adjust DCs or number of successes required in any way. Even if your plan fails, it will fail in a way that is interesting, challenging, and fun. So don't worry about planning for every contingency, and certainly don't use that as an excuse to shoot down ideas and discourage your fellow players. Accept them and add onto them if you need to refine them. One of the worst ways to play, in my opinion, is to try and mitigate every possibility of failure. You're pulp action adventurers, so embrace it. Indiana Jones failed in the very first scene in Raiders of the Lost Ark and he went on to make three more movies! About an hour before our agreed-upon stopping point, I'm going to start looking for a cliffhanger ending. When it happens, I'll call for end of session. At that point, we'll have a little concluding Q&A to talk about what happened during the game, get feedback, and see what interesting questions remain to be answered in a future session. And that's it! I look forward to the game and if you have any questions, feel free to ask anytime. April 22 (11 years ago) Jamez B. Permalink for 130016 Quote I try to get character sheets and any workup to playing done before the first game session, so we can start playing 10-15 mins from when everyone gets there or scheduled start time. I think of my session zero more as any workup, that's how I use the game's forum. I try to get the hour+ of people writing up sheets and basic basic structure out of the way. I could try setting up a meeting/session before hand to do a more organic version rather than writing it up, just not something I've tried beyond having one on one conversations and discussion on game thread. I think newer DMs like a lot more structure. I'm not a total newb...but I'm still at that stage where I like to have a plan to fall back on, rather than trying to improvise most everything. (I'm not railroading, but having multiple NPCs, monsters, and scenarios outlined.) Lets say...the players just completely skipped the plot hooks they were offered to recover a stolen item for a reward and head out into the forest? That's ok, I've got a preservation society's representatives ready to ask them to find a magical beast and capture it, without killing it. They decided to kill the society representatives? Well next time they are in town the guards are going to be questioning them...and when they head into the forest deeper they find a camp of monsters roasting the rare mystical monster. On roll20 there's many people we don't know. If a DM says yes to everything when players have vastly different play styles....lets say one is trying to kill everything in sight while another had wanted to roleplay, interrogate or go on a quest. That can cause conflict (character conflict being ok if not disruptive, but not when it spills outside the roles of the game). A player's character dies because they purposely tried burning down a town for no reason and the town guard confiscated their items? Well we did discuss/outline you'd come back at a level lower, it's not a surprise. Maybe I've just been in too many groups with problem players and am focusing too much on heading off issues before they ever occur. It's just my experience mismatched expectations are the source of most problems and all being on the same page helps things go more smoothly and lets people focus on the story telling, adventure and fun. Thanks for your input ^.^ April 22 (11 years ago) iserith2 Permalink for 130025 Quote I don't use plot hooks as I find them problematic, in part, for the reasons you've given. I use premises the players want to see played (I ask them directly for their buy-in as players) and craft questions to link their characters to that premise as needed. A plot hook is essentially the DM asking if the players are interested in his or her idea - but in the context of the game. A \"No\" may mean wasted prep, or at least, having it shelved for an indeterminate amount of time. I prefer to ask directly outside of the context of the game. The upside here is that if you're playing scenarios your players have expressed interest in, there's nobody going off and killing quest givers or skipping content. They've already given their inherent buy-in on the goals and objectives of the premise, so you can get right to it. Lots of focus, no wasted prep, and a faster pace for your game. If you've got players that are doing the things you describe in your examples, I can share solutions for that. But this sort of thing is certainly better for another thread. If you start it up, I'll surely participate. April 22 (11 years ago) Jamez B. Permalink for 130053 Quote That stuff isn't happening, but the general type of thing is the reasoning behind why I'd posted. 'Social contracts' seamed like a interesting idea, possibly extending the sort of outline we do already. It's a gentleman's agreement...I'm not asking anyone to sign anything. I might run a one-shot tower defense style D&D game where you have to protect something from wave after wave of enemies, all combat. The next week I could start a campaign where players are investigating strange happenings in a sleepy town with more roleplay and puzzles than anything. This is just a summery of things that sets each world apart, special rules, or agreements made with the party. There's enough people here you could probably find interest in all sorts of games, but you want to try to make sure you let them know what kind of game you've set up. April 22 (11 years ago) iserith2 Permalink for 130347 Quote James B. said: you want to try to make sure you let them know what kind of game you've set up. I completely agree. My only quibble is that a lot of DMs make these social contracts to put a patch on problems they themselves cause in the game due to their approach. DMs that post, \"I prefer roleplaying more than combat\" just says to me that the DM doesn't actually know what roleplaying is, and so I won't play in their game. A DM that denies certain source books (and not for thematic reasons) or decries evil characters similarly may be causing the problems they're trying to head off by limiting the players instead of reflecting on their own approach. If it works and players are willing to buy in to that, that's just fine, of course. It's good to have that information upfront. April 25 (11 years ago) The Evil DM Permalink for 134094 Quote Lou The Mad said: I gotta agree with the Lord of Cameras: some players dig that structure, some don't. Just as some GMing styles are appreciated by some players, while others will chafe, James. Lou... See the movie Hackers, you'll understand my name :) April 26 (11 years ago) Lou The Mad Pro Permalink for 134987 Quote Sorry. Anytime I see \"Hackers\" I get distracted by Angelina Jolie....mmmmm, she could corrupt my database any ti--......uh, what was I talking about again? 1 © Roll20, LLC | Terms of Service & Privacy Policy | DMCA | Contact Us | Help Center | All rights reserved. All product and company names are trademarks™ or registered® trademarks of their respective holders. Powered by Roll20 Roll20 The #1 Tabletop for Playing RPGs OnlineRoll20 The #1 Tabletop for Playing RPGs Online Roll20 Tabletop Roll20 Characters Roll20 Marketplace Roll20 Compendium DriveThru The Largest RPG MarketplaceDriveThru The Largest RPG Marketplace DriveThru DriveThruComics DriveThruFiction DriveThruCards Wargame Vault Demiplane Official Character Creation and Game CompanionDemiplane Official Character Creation and Game Companion Demiplane Pathfinder Nexus Daggerheart Nexus Vampire: The Masquerade Nexus Marvel Multiverse RPG Nexus Cosmere RPG Nexus Cyberpunk RED Nexus Dungeon Scrawl Create RPG Maps in MinutesDungeon Scrawl Create RPG Maps in Minutes Dungeon Scrawl Create a Map Community ContentCommunity Content Adventure by Fans Everywhere Dungeon Masters Guild (D&D) Pathfinder Infinite Starfinder Infinite Miskatonic Repository Storytellers Vault Everything for your adventures"
    },
    {
      "url": "https://opensports.net/blog/top-5-concerns-everyone-has-when-organizing-a-pickup-game",
      "content": "Top 5 Concerns Everyone Has When Organizing A Pickup Game | OpenSports Help Customers Log In Sign Up Discovery Toggle navigation Blog Top 5 Concerns Everyone Has When Organizing A Pickup Game Our answers to questions like: Will people join? From no ball to no shows, we have experienced every fear that game organizers face. Here are our solutions so that you and every footballer can play more. 1. Which field do I choose? Will it be taken when I get there? Advice: Do 5 minutes of “field research” in advance or ask us. Look at a map that shows your neighbourhood, and choose a park that is large enough to host a soccer game. If you are unsure about the availability of the field, find a spot where there are nearby backup fields (or seriously, ask us)! Google’s satellite images are very helpful to determine amount of green space and types of fields. Here’s a few stories from other organizers who were prepared with backup fields: On the morning of the Champion’s League Game, James and Kaylin tried hosting a game at Regent Park Athletic Grounds, and the beautiful turf was occupied. No biggie, they knew there was nearby green space a few blocks north (see: Regent Park Aquatic Centre). They brought the group there and had a fantastic game! The first time Juan Diego ever organized a game on his own, he had to migrate a group of 20 players from UofT back campus fields to Christie Pits on a Saturday morning! All 20 players followed, whether they took the TTC, bike rode, cabbed, or jogged there. Alicia goes to back campus fields, knowing that the front campus grass is usually free if the back campus is being used. She feels confident knowing there are backup fields nearby. Bottom line: When people are committed to playing, they will travel to get the game in! When people are committed to playing, they will travel to get the game in! When people are committed to playing, they will travel to get the game in! Check out this guide for some popular nearby fields. 2. Not enough people are joining my game! Advice: Be patient but proactive. After you’ve created a game and sent invites to local players through the app, do not be worried if people don’t join your game right away. Last week, the roster for my Friday morning pickup game went from 11 attendees to 17 over night!! Also make sure the location and time of your game is convenient. For example, players know that on a Saturday afternoon in the middle of the summer, it’s going to be very hot and possibly in the way of other weekend plans, whereas Saturday morning games are cooler and allow time to “enjoy the rest of the day”. Tips: We know that a lot of players will join if they see your game is filling up. If you have any friends that want to come, invite them first, to start to gain attendees faster. If players are not responsive to game invites, try to personalize your messages. Adding a personal touch motivates people to come. Have you double checked your game description? Add lots of details!!! Check out these 4 best game descriptions and you might get a better turn out! Morning games are loved in the Toronto soccer community! 3. Should I cancel my game? Advice: Don’t cancel until 12 hours before the game. You should have at least 8 players for a 4v4 pickup soccer game. However, anything between 5v5 and 8v8 is ideal! If I’m not reaching those numbers, what do I do? If at least 8-10 players don’t join by the night before the game, it is fair to cancel the game and send a message to all the current attendees, briefly explaining that not enough players joined, and asking which other days suit most people, so you can reschedule. What about if the weather is bad? If you are certain the weather is poor (pouring rain, lightening), it is courteous to cancel a game 2 hours before it starts, to give players enough warning so that they do not start travelling to your game. How many people usually don’t show up to games? You can expect about a 20% no-show rate. This means if you have 10 attendees, 2 may not show, and you can likely expect 8 players. Tip: A few hours before a game, send a message to players to confirm they are still coming by asking them to kindly cancel if they can no longer come. Rain does not stop most players, but take proper care if there is a storm. 4. I don’t have equipment. Advice: All you need is a ball. You can ask someone to bring a ball, and use players’ bags to make the nets! You can even use four of their bags to make a field perimeter, otherwise, bring a few cones. 4 1/2. It seems difficult to sort teams. Advice: No pinnies? No problem. Send a message before the game, telling players to bring a white and black jersey (and maybe red, if you anticipate a large turn out). Before the game starts, create two equal teams, by sorting the players by jersey colour (i.e., black jerseys against all; or white jerseys against coloured jerseys). 5. What if too many people show up for my game? Advice: Use subs or create a third team If you create a third team consider this format: Each game lasts 8 minutes, and the winner stays on for a maximum of two games. Subbing at Christie Pits! That’s it! The OpenSports App will take care of the rest — it will remind people of your game, allow you to send instant messages to all attendees, and allow you to make edits to the game which everyone can see! Tip: If you keep organizing games you will build ratings through the app and a reputation as a really credible game organizer in your city. When that happens, players will be flocking to your games. Just watch… Quick Guidelines: Best games times: Weekdays: 9am & 7pm Weekends: 10am Tip: Set aside 2 hours for games, and arrive at least 15 minutes early to make sure the field is not occupied. Best game locations (according to what’s usually free): Weekday Mornings: UofT Back Campus Turf Fields, or front campus grass Evenings: Christie Pits (note: there are no lights, so play when there is still sunlight) Weekends: Riverdale Park, Trinity Bellwoods Park, Regent Park We’ve been doing this for over a year now, and are more than happy to use our experience to answer any questions you have! Please shout out to alicia@opensports.ca if you need any help putting a game together, and don’t forget to embed your games into your website (if you have one!) using this widget. Good luck! Alicia & The OpenSports Team Company About blog Contact Customers Pricing resources Changelog Groups Waitlist Membership Terms privacy Help Center Hockey Pickleball Volleyball How-tos electronic waivers Events Widget Discounts Collect Payment Announcements Refund Deadlines Language (EN) English Español Français",
      "title": "Top 5 Concerns Everyone Has When Organizing A Pickup Game | OpenSports Help Customers Log In Sign Up Discovery Toggle navigation Blog Top 5 Concerns Everyone Has When Organizing A Pickup Game Our answers to questions like: Will people join? From no ball to no shows, we have experienced every fear that game organizers face. Here are our solutions so that you and every footballer can play more. 1. Which field do I choose? Will it be taken when I get there? Advice: Do 5 minutes of “field research” in advance or ask us. Look at a map that shows your neighbourhood, and choose a park that is large enough to host a soccer game. If you are unsure about the availability of the field, find a spot where there are nearby backup fields (or seriously, ask us)! Google’s satellite images are very helpful to determine amount of green space and types of fields. Here’s a few stories from other organizers who were prepared with backup fields: On the morning of the Champion’s League Game, James and Kaylin tried hosting a game at Regent Park Athletic Grounds, and the beautiful turf was occupied. No biggie, they knew there was nearby green space a few blocks north (see: Regent Park Aquatic Centre). They brought the group there and had a fantastic game! The first time Juan Diego ever organized a game on his own, he had to migrate a group of 20 players from UofT back campus fields to Christie Pits on a Saturday morning! All 20 players followed, whether they took the TTC, bike rode, cabbed, or jogged there. Alicia goes to back campus fields, knowing that the front campus grass is usually free if the back campus is being used. She feels confident knowing there are backup fields nearby. Bottom line: When people are committed to playing, they will travel to get the game in! When people are committed to playing, they will travel to get the game in! When people are committed to playing, they will travel to get the game in! Check out this guide for some popular nearby fields. 2. Not enough people are joining my game! Advice: Be patient but proactive. After you’ve created a game and sent invites to local players through the app, do not be worried if people don’t join your game right away. Last week, the roster for my Friday morning pickup game went from 11 attendees to 17 over night!! Also make sure the location and time of your game is convenient. For example, players know that on a Saturday afternoon in the middle of the summer, it’s going to be very hot and possibly in the way of other weekend plans, whereas Saturday morning games are cooler and allow time to “enjoy the rest of the day”. Tips: We know that a lot of players will join if they see your game is filling up. If you have any friends that want to come, invite them first, to start to gain attendees faster. If players are not responsive to game invites, try to personalize your messages. Adding a personal touch motivates people to come. Have you double checked your game description? Add lots of details!!! Check out these 4 best game descriptions and you might get a better turn out! Morning games are loved in the Toronto soccer community! 3. Should I cancel my game? Advice: Don’t cancel until 12 hours before the game. You should have at least 8 players for a 4v4 pickup soccer game. However, anything between 5v5 and 8v8 is ideal! If I’m not reaching those numbers, what do I do? If at least 8-10 players don’t join by the night before the game, it is fair to cancel the game and send a message to all the current attendees, briefly explaining that not enough players joined, and asking which other days suit most people, so you can reschedule. What about if the weather is bad? If you are certain the weather is poor (pouring rain, lightening), it is courteous to cancel a game 2 hours before it starts, to give players enough warning so that they do not start travelling to your game. How many people usually don’t show up to games? You can expect about a 20% no-show rate. This means if you have 10 attendees, 2 may not show, and you can likely expect 8 players. Tip: A few hours before a game, send a message to players to confirm they are still coming by asking them to kindly cancel if they can no longer come. Rain does not stop most players, but take proper care if there is a storm. 4. I don’t have equipment. Advice: All you need is a ball. You can ask someone to bring a ball, and use players’ bags to make the nets! You can even use four of their bags to make a field perimeter, otherwise, bring a few cones. 4 1/2. It seems difficult to sort teams. Advice: No pinnies? No problem. Send a message before the game, telling players to bring a white and black jersey (and maybe red, if you anticipate a large turn out). Before the game starts, create two equal teams, by sorting the players by jersey colour (i.e., black jerseys against all; or white jerseys against coloured jerseys). 5. What if too many people show up for my game? Advice: Use subs or create a third team If you create a third team consider this format: Each game lasts 8 minutes, and the winner stays on for a maximum of two games. Subbing at Christie Pits! That’s it! The OpenSports App will take care of the rest — it will remind people of your game, allow you to send instant messages to all attendees, and allow you to make edits to the game which everyone can see! Tip: If you keep organizing games you will build ratings through the app and a reputation as a really credible game organizer in your city. When that happens, players will be flocking to your games. Just watch… Quick Guidelines: Best games times: Weekdays: 9am & 7pm Weekends: 10am Tip: Set aside 2 hours for games, and arrive at least 15 minutes early to make sure the field is not occupied. Best game locations (according to what’s usually free): Weekday Mornings: UofT Back Campus Turf Fields, or front campus grass Evenings: Christie Pits (note: there are no lights, so play when there is still sunlight) Weekends: Riverdale Park, Trinity Bellwoods Park, Regent Park We’ve been doing this for over a year now, and are more than happy to use our experience to answer any questions you have! Please shout out to alicia@opensports.ca if you need any help putting a game together, and don’t forget to embed your games into your website (if you have one!) using this widget. Good luck! Alicia & The OpenSports Team Company About blog Contact Customers Pricing resources Changelog Groups Waitlist Membership Terms privacy Help Center Hockey Pickleball Volleyball How-tos electronic waivers Events Widget Discounts Collect Payment Announcements Refund Deadlines Language (EN) English Español Français"
    },
    {
      "url": "https://www.quora.com/Is-there-a-need-for-a-better-way-to-organize-pickup-sports",
      "content": "Is there a need for a better way to organize pickup sports? - Quora Something went wrong. Wait a moment and try again. Try again Skip to content Skip to search Sign In Is there a need for a better way to organize pickup sports? All related (27) Sort Recommended Assistant Bot · 6mo Yes, there is definitely a need for better organization of pickup sports. Here are several reasons why improved organization can enhance the experience: Accessibility: Many people want to participate in pickup sports but may not know where or when they are happening. A centralized platform or app can help players find games in their area. Inclusivity: Organized systems can ensure that players of all skill levels are accommodated, promoting a more inclusive environment. This could involve setting up different tiers or groups based on skill level. Scheduling: With better organization, players can e Continue Reading Yes, there is definitely a need for better organization of pickup sports. Here are several reasons why improved organization can enhance the experience: Accessibility: Many people want to participate in pickup sports but may not know where or when they are happening. A centralized platform or app can help players find games in their area. Inclusivity: Organized systems can ensure that players of all skill levels are accommodated, promoting a more inclusive environment. This could involve setting up different tiers or groups based on skill level. Scheduling: With better organization, players can easily find games that fit their schedules, reducing frustration and increasing participation. Automated scheduling tools can help coordinate times and locations. Communication: A structured approach can improve communication among players, allowing for better coordination and planning. This can include notifications about changes in schedule or location. Safety: Organized sports can implement safety protocols, such as injury reporting and emergency contacts, which are often overlooked in informal settings. Community Building: A well-organized system can foster a sense of community among players, encouraging regular participation and social interaction. Resource Management: Organizing pickup games can help in managing resources like fields, courts, and equipment, ensuring that facilities are used efficiently. In summary, embracing better organization for pickup sports can lead to increased participation, improved player experience, and a more vibrant sporting community. Implementing technology solutions like apps or websites could be a significant step in this direction. Upvote · Suraj Mehta Entrepreneur and Software Engineer · 12y While there is a definitive need to create a more functional app for pick-up sports, the problem is much larger than that. Why haven't all these apps tackled the issue of filling up activities? Do people even care enough to go online and find people to play with? These are the questions that the hundreds of web and mobile applications in this space struggle with. Most of the companies in this market simply create an event planning system, and the more advanced ones integrate your facebook and email buds, but the problem still exists. Let me take you through a scenario. You go on an application Continue Reading While there is a definitive need to create a more functional app for pick-up sports, the problem is much larger than that. Why haven't all these apps tackled the issue of filling up activities? Do people even care enough to go online and find people to play with? These are the questions that the hundreds of web and mobile applications in this space struggle with. Most of the companies in this market simply create an event planning system, and the more advanced ones integrate your facebook and email buds, but the problem still exists. Let me take you through a scenario. You go on an application like the ones mentioned above, create an activity, and share it on twitter, facebook or other big boy social media platforms to get some virality. You might even get a few bodies to join,but not enough to complete the activity. What's the problem here? Through the millions of items shared on these platforms, how is joining an ultimate frisbee activity cool vs. looking at some sexy instagram photo, or reading about the Kardashians family vacation? The internet is vain, and posts that get viewed and shared the most are the ones that electrify certain qualities or accomplishments of an individual. There isn't a need for an app to organize pick up sports; we have a bunch of those. We need to incentivize joining or creating these activities by rewarding them. Everyone wants to be healthy, but it's just not as easy, so why not make a game out of who can be the healthiest? If someone posted something like, \"I am about to lose 300 calories in this Frisbee activity\", or \"I am 200 points away from getting a par of Jordans\", I guarantee people will be sharing it. Upvote · 93 91 Sponsored by Amazon Business Smarter business buying starts here. Listen now. Learn how to optimize your purchasing process and improve your bottom line. Subscribe today. Learn More 96 Justin Blair Studied Computer Information Systems (Graduated 2022) · Author has 3K answers and 3.8M answer views · 8y It could work, if it was marketed properly and the logistics were sound. If I were to use it, I think it'd be kind of nice to have. If I got the urge to go play, I wouldn't have to wait to see if my friends text or call me back- just get a group together fairly quickly and go out and play. Maybe even make some new friends. There was another question here awhile back that asked about an app/site that was in the same vein as match.com, where they'd get people together based on personality. Same idea, but skipping the personality match, could work for people just wanting to play and get together Continue Reading It could work, if it was marketed properly and the logistics were sound. If I were to use it, I think it'd be kind of nice to have. If I got the urge to go play, I wouldn't have to wait to see if my friends text or call me back- just get a group together fairly quickly and go out and play. Maybe even make some new friends. There was another question here awhile back that asked about an app/site that was in the same vein as match.com, where they'd get people together based on personality. Same idea, but skipping the personality match, could work for people just wanting to play and get together quickly. Upvote · Related questions More answers below How will you organize a sports event? What is the best/easiest way to pick up a new sport? How can I organize pick-up sport games? Is anyone willing to organize open carry trash pickups? What type of social organization would a sports team fall under? Nat Robinson Marketer - Ideator - Activator · 11y I recommend a new app called SPOTS that connects you with locals to play the sports you love SPOTS - Your Local Sports Community. SPOTS is different from Meetup in that it takes an organic approach to helping you find people into the same sports as you and lets you manage the where and when, pretty much as you describe. Upvote · 95 Related questions How will you organize a sports event? What is the best/easiest way to pick up a new sport? How can I organize pick-up sport games? Is anyone willing to organize open carry trash pickups? What type of social organization would a sports team fall under? Why are sports better to watch live? One way of defining sports is as organized competitive activity. What do you mean by this? I have always wanted to be a part of an organization. Any suggestions? How can custom team apparel benefit a sports team or organization? What is necessary for organizing a simple sport event? What are some ways to get people to play together on a sports team? Are boys better at sports than girls? What sports need insurance? How can I keep track of all my sports teams? How do I start a youth sports organization? Answer 95 Follow Related questions How will you organize a sports event? What is the best/easiest way to pick up a new sport? How can I organize pick-up sport games? Is anyone willing to organize open carry trash pickups? What type of social organization would a sports team fall under? Why are sports better to watch live? Advertisement About · Careers · Privacy · Terms · Contact · Languages · Your Ad Choices · Press · © Quora, Inc. 2025",
      "title": "Is there a need for a better way to organize pickup sports? - Quora Something went wrong. Wait a moment and try again. Try again Skip to content Skip to search Sign In Is there a need for a better way to organize pickup sports? All related (27) Sort Recommended Assistant Bot · 6mo Yes, there is definitely a need for better organization of pickup sports. Here are several reasons why improved organization can enhance the experience: Accessibility: Many people want to participate in pickup sports but may not know where or when they are happening. A centralized platform or app can help players find games in their area. Inclusivity: Organized systems can ensure that players of all skill levels are accommodated, promoting a more inclusive environment. This could involve setting up different tiers or groups based on skill level. Scheduling: With better organization, players can e Continue Reading Yes, there is definitely a need for better organization of pickup sports. Here are several reasons why improved organization can enhance the experience: Accessibility: Many people want to participate in pickup sports but may not know where or when they are happening. A centralized platform or app can help players find games in their area. Inclusivity: Organized systems can ensure that players of all skill levels are accommodated, promoting a more inclusive environment. This could involve setting up different tiers or groups based on skill level. Scheduling: With better organization, players can easily find games that fit their schedules, reducing frustration and increasing participation. Automated scheduling tools can help coordinate times and locations. Communication: A structured approach can improve communication among players, allowing for better coordination and planning. This can include notifications about changes in schedule or location. Safety: Organized sports can implement safety protocols, such as injury reporting and emergency contacts, which are often overlooked in informal settings. Community Building: A well-organized system can foster a sense of community among players, encouraging regular participation and social interaction. Resource Management: Organizing pickup games can help in managing resources like fields, courts, and equipment, ensuring that facilities are used efficiently. In summary, embracing better organization for pickup sports can lead to increased participation, improved player experience, and a more vibrant sporting community. Implementing technology solutions like apps or websites could be a significant step in this direction. Upvote · Suraj Mehta Entrepreneur and Software Engineer · 12y While there is a definitive need to create a more functional app for pick-up sports, the problem is much larger than that. Why haven't all these apps tackled the issue of filling up activities? Do people even care enough to go online and find people to play with? These are the questions that the hundreds of web and mobile applications in this space struggle with. Most of the companies in this market simply create an event planning system, and the more advanced ones integrate your facebook and email buds, but the problem still exists. Let me take you through a scenario. You go on an application Continue Reading While there is a definitive need to create a more functional app for pick-up sports, the problem is much larger than that. Why haven't all these apps tackled the issue of filling up activities? Do people even care enough to go online and find people to play with? These are the questions that the hundreds of web and mobile applications in this space struggle with. Most of the companies in this market simply create an event planning system, and the more advanced ones integrate your facebook and email buds, but the problem still exists. Let me take you through a scenario. You go on an application like the ones mentioned above, create an activity, and share it on twitter, facebook or other big boy social media platforms to get some virality. You might even get a few bodies to join,but not enough to complete the activity. What's the problem here? Through the millions of items shared on these platforms, how is joining an ultimate frisbee activity cool vs. looking at some sexy instagram photo, or reading about the Kardashians family vacation? The internet is vain, and posts that get viewed and shared the most are the ones that electrify certain qualities or accomplishments of an individual. There isn't a need for an app to organize pick up sports; we have a bunch of those. We need to incentivize joining or creating these activities by rewarding them. Everyone wants to be healthy, but it's just not as easy, so why not make a game out of who can be the healthiest? If someone posted something like, \"I am about to lose 300 calories in this Frisbee activity\", or \"I am 200 points away from getting a par of Jordans\", I guarantee people will be sharing it. Upvote · 93 91 Sponsored by Amazon Business Smarter business buying starts here. Listen now. Learn how to optimize your purchasing process and improve your bottom line. Subscribe today. Learn More 96 Justin Blair Studied Computer Information Systems (Graduated 2022) · Author has 3K answers and 3.8M answer views · 8y It could work, if it was marketed properly and the logistics were sound. If I were to use it, I think it'd be kind of nice to have. If I got the urge to go play, I wouldn't have to wait to see if my friends text or call me back- just get a group together fairly quickly and go out and play. Maybe even make some new friends. There was another question here awhile back that asked about an app/site that was in the same vein as match.com, where they'd get people together based on personality. Same idea, but skipping the personality match, could work for people just wanting to play and get together Continue Reading It could work, if it was marketed properly and the logistics were sound. If I were to use it, I think it'd be kind of nice to have. If I got the urge to go play, I wouldn't have to wait to see if my friends text or call me back- just get a group together fairly quickly and go out and play. Maybe even make some new friends. There was another question here awhile back that asked about an app/site that was in the same vein as match.com, where they'd get people together based on personality. Same idea, but skipping the personality match, could work for people just wanting to play and get together quickly. Upvote · Related questions More answers below How will you organize a sports event? What is the best/easiest way to pick up a new sport? How can I organize pick-up sport games? Is anyone willing to organize open carry trash pickups? What type of social organization would a sports team fall under? Nat Robinson Marketer - Ideator - Activator · 11y I recommend a new app called SPOTS that connects you with locals to play the sports you love SPOTS - Your Local Sports Community. SPOTS is different from Meetup in that it takes an organic approach to helping you find people into the same sports as you and lets you manage the where and when, pretty much as you describe. Upvote · 95 Related questions How will you organize a sports event? What is the best/easiest way to pick up a new sport? How can I organize pick-up sport games? Is anyone willing to organize open carry trash pickups? What type of social organization would a sports team fall under? Why are sports better to watch live? One way of defining sports is as organized competitive activity. What do you mean by this? I have always wanted to be a part of an organization. Any suggestions? How can custom team apparel benefit a sports team or organization? What is necessary for organizing a simple sport event? What are some ways to get people to play together on a sports team? Are boys better at sports than girls? What sports need insurance? How can I keep track of all my sports teams? How do I start a youth sports organization? Answer 95 Follow Related questions How will you organize a sports event? What is the best/easiest way to pick up a new sport? How can I organize pick-up sport games? Is anyone willing to organize open carry trash pickups? What type of social organization would a sports team fall under? Why are sports better to watch live? Advertisement About · Careers · Privacy · Terms · Contact · Languages · Your Ad Choices · Press · © Quora, Inc. 2025"
    },
    {
      "url": "https://www.mlssoccer.com/news/jogabo-smartphone-app-organizes-pick-games-finds-new-players-and-tracks-stats",
      "content": "Published Time: 2013-10-03T15:51:39Z Jogabo: The smartphone app that organizes pick-up games, finds new players and tracks stats | SIDELINE | MLSSoccer.com Skip to main content Schedule MLS Season Pass News Watch Standings Stats Clubs Competitions Rosters MLS QUEST Gaming eMLS MLS GO MLS NEXT MLS NEXT Pro MLS App Tickets Store Español Sign in Schedule MLS Season Pass News Watch Standings Stats Clubs Competitions Rosters MLS QUEST Gaming eMLS MLS GO MLS NEXT MLS NEXT Pro Sign in MLS App Tickets Store Español Schedule MLS Season Pass News Watch Standings Stats Clubs Competitions Rosters MLS QUEST Gaming eMLS MLS GO MLS NEXT MLS NEXT Pro MLS App Tickets Store Español Sign in Jogabo: The smartphone app that organizes pick-up games, finds new players and tracks stats | SIDELINE Andy Edwards Thursday, Oct 3, 2013, 03:51 PM Copy URL Share on Facebook Share on X Scene: Friday night; 6 pm, time for your weekly pick-up game at the park; three friends that meet you every week inform you last minute they're unavailable tonight. You're already at the field and now short of soccer-playing friends. Tonight's game is now in jeopardy. Elementary logic would first tell you to get better friends. Upon further consideration, it would probably be easier to make more friends. But in what time? You're supposed to play in 15 minutes. What do you do? Pull the smartphone out of your pocket and open up Jogabo, the new mobile app that connects soccer players of any and all skill levels and presents playing opportunities no matter what city you live. It's basically Twitter, Facebook and Foursquare for pick-up soccer, all in one. More from The Sideline Inforgraphic: 549 MLS players from 62 countries The up-and-coming soccer mecca of the USA: St. Louis? Nashville FC: 100 percent supporter owned club Before you can do that, though, the creators of Jogabo need you to help fund the development of the app through this IndieGoGo page. At time of writing this story on Thursday afternoon, the funding total was a few dollars more than $12,000 — the goal is $50,000 — up almost $3,000 from Wednesday evening, with 46 days remaining. Jogabo will not only find games for you to play in whatever day of the week, but will also provide a social media-like platform to track and share your playing stats. That means when you score more than 91 pick-up goals in a calendar year and you've got statistical proof of it thanks to Jogabo, you can claim to have outdone Lionel Messi. Never cancel a kick-around ever again because you're short on players; help fund Jogabo today and let the app do all the game organizing for you. Andy Edwards - @AndyEdMLS Copy URL Share on Facebook Share on X More News More News Young Players: Who stepped up on Matchday 2? -------------------------------------------- Player of the Matchday Philadelphia Union: Tai Baribo named Player of the Matchday ----------------------------------------------------------- Voices: Joseph Lowery What We Learned: Philadelphia Union silence doubters, LA Galaxy's big problem ----------------------------------------------------------------------------- Energy Moment of the Matchday Jacob Murrell's acrobatics rescue DC United | Energy Moment of the Matchday --------------------------------------------------------------------------- Team of the Matchday Team of the Matchday: Luis Suárez, Emil Forsberg answer the call ---------------------------------------------------------------- Video Video 9:07 Instant Replay PK in Minnesota, Miami red card: Matchday 2's biggest calls ----------------------------------------------------------- 1:13 Player of the Matchday 2: Tai Baribo ------------------------------------ 1:45 Must-see golazos! | Vote for your Goal of the Matchday ------------------------------------------------------ 1:06 Goal: P. Musa vs. COL, 68' -------------------------- About MLS Fact & Record Book Competition Guidelines Roster Rules & Regulations Fan Code of Conduct Executives Official Partners Jobs/Internships MLS Community Contact Us Customer Service Media Contacts Advertising Contacts Stay Connected MLS on Apple News Newsletters Podcasts iOS App Android App Resources MLS Communications Professional Referee Organization (PRO) \"Simplified Laws of the Game\" Player Engagement MLS Greats Store By club Jerseys Men Women Kids Clearance League Reports Competition Guidelines Postponement Policy All Transfers Player Availability Report Disciplinary Summary Send-off Review Procedure About MLS Fact & Record Book Competition Guidelines Roster Rules & Regulations Fan Code of Conduct Executives Official Partners Jobs/Internships MLS Community Contact Us Customer Service Media Contacts Advertising Contacts Stay Connected MLS on Apple News Newsletters Podcasts iOS App Android App Resources MLS Communications Professional Referee Organization (PRO) \"Simplified Laws of the Game\" Player Engagement MLS Greats Store By club Jerseys Men Women Kids Clearance League Reports Competition Guidelines Postponement Policy All Transfers Player Availability Report Disciplinary Summary Send-off Review Procedure Club Sites Atlanta Atlanta Austin Austin Charlotte Charlotte Chicago Chicago Cincinnati Cincinnati Colorado Colorado Columbus Columbus Dallas Dallas D.C. D.C. Houston Houston Kansas City Kansas City LA LA LAFC LAFC Miami Miami Minnesota Minnesota Montréal Montréal Nashville Nashville New England New England New York New York New York City New York City Orlando Orlando Philadelphia Philadelphia Portland Portland Salt Lake Salt Lake San Diego San Diego San Jose San Jose Seattle Seattle St. Louis St. Louis Toronto Toronto Vancouver Vancouver Terms of Service Privacy Policy Do Not Sell or Share My Personal Information Manage Cookies ©2025 MLS. The Major League Soccer and MLS name and shield are registered trademarks of Major League Soccer, L.L.C. (“MLS”). The names and logos of MLS teams are registered and/or common law trademarks of MLS or are used with the permission of their owners. Any unauthorized use is forbidden.",
      "title": "Published Time: 2013-10-03T15:51:39Z Jogabo: The smartphone app that organizes pick-up games, finds new players and tracks stats | SIDELINE | MLSSoccer.com Skip to main content Schedule MLS Season Pass News Watch Standings Stats Clubs Competitions Rosters MLS QUEST Gaming eMLS MLS GO MLS NEXT MLS NEXT Pro MLS App Tickets Store Español Sign in Schedule MLS Season Pass News Watch Standings Stats Clubs Competitions Rosters MLS QUEST Gaming eMLS MLS GO MLS NEXT MLS NEXT Pro Sign in MLS App Tickets Store Español Schedule MLS Season Pass News Watch Standings Stats Clubs Competitions Rosters MLS QUEST Gaming eMLS MLS GO MLS NEXT MLS NEXT Pro MLS App Tickets Store Español Sign in Jogabo: The smartphone app that organizes pick-up games, finds new players and tracks stats | SIDELINE Andy Edwards Thursday, Oct 3, 2013, 03:51 PM Copy URL Share on Facebook Share on X Scene: Friday night; 6 pm, time for your weekly pick-up game at the park; three friends that meet you every week inform you last minute they're unavailable tonight. You're already at the field and now short of soccer-playing friends. Tonight's game is now in jeopardy. Elementary logic would first tell you to get better friends. Upon further consideration, it would probably be easier to make more friends. But in what time? You're supposed to play in 15 minutes. What do you do? Pull the smartphone out of your pocket and open up Jogabo, the new mobile app that connects soccer players of any and all skill levels and presents playing opportunities no matter what city you live. It's basically Twitter, Facebook and Foursquare for pick-up soccer, all in one. More from The Sideline Inforgraphic: 549 MLS players from 62 countries The up-and-coming soccer mecca of the USA: St. Louis? Nashville FC: 100 percent supporter owned club Before you can do that, though, the creators of Jogabo need you to help fund the development of the app through this IndieGoGo page. At time of writing this story on Thursday afternoon, the funding total was a few dollars more than $12,000 — the goal is $50,000 — up almost $3,000 from Wednesday evening, with 46 days remaining. Jogabo will not only find games for you to play in whatever day of the week, but will also provide a social media-like platform to track and share your playing stats. That means when you score more than 91 pick-up goals in a calendar year and you've got statistical proof of it thanks to Jogabo, you can claim to have outdone Lionel Messi. Never cancel a kick-around ever again because you're short on players; help fund Jogabo today and let the app do all the game organizing for you. Andy Edwards - @AndyEdMLS Copy URL Share on Facebook Share on X More News More News Young Players: Who stepped up on Matchday 2? -------------------------------------------- Player of the Matchday Philadelphia Union: Tai Baribo named Player of the Matchday ----------------------------------------------------------- Voices: Joseph Lowery What We Learned: Philadelphia Union silence doubters, LA Galaxy's big problem ----------------------------------------------------------------------------- Energy Moment of the Matchday Jacob Murrell's acrobatics rescue DC United | Energy Moment of the Matchday --------------------------------------------------------------------------- Team of the Matchday Team of the Matchday: Luis Suárez, Emil Forsberg answer the call ---------------------------------------------------------------- Video Video 9:07 Instant Replay PK in Minnesota, Miami red card: Matchday 2's biggest calls ----------------------------------------------------------- 1:13 Player of the Matchday 2: Tai Baribo ------------------------------------ 1:45 Must-see golazos! | Vote for your Goal of the Matchday ------------------------------------------------------ 1:06 Goal: P. Musa vs. COL, 68' -------------------------- About MLS Fact & Record Book Competition Guidelines Roster Rules & Regulations Fan Code of Conduct Executives Official Partners Jobs/Internships MLS Community Contact Us Customer Service Media Contacts Advertising Contacts Stay Connected MLS on Apple News Newsletters Podcasts iOS App Android App Resources MLS Communications Professional Referee Organization (PRO) \"Simplified Laws of the Game\" Player Engagement MLS Greats Store By club Jerseys Men Women Kids Clearance League Reports Competition Guidelines Postponement Policy All Transfers Player Availability Report Disciplinary Summary Send-off Review Procedure About MLS Fact & Record Book Competition Guidelines Roster Rules & Regulations Fan Code of Conduct Executives Official Partners Jobs/Internships MLS Community Contact Us Customer Service Media Contacts Advertising Contacts Stay Connected MLS on Apple News Newsletters Podcasts iOS App Android App Resources MLS Communications Professional Referee Organization (PRO) \"Simplified Laws of the Game\" Player Engagement MLS Greats Store By club Jerseys Men Women Kids Clearance League Reports Competition Guidelines Postponement Policy All Transfers Player Availability Report Disciplinary Summary Send-off Review Procedure Club Sites Atlanta Atlanta Austin Austin Charlotte Charlotte Chicago Chicago Cincinnati Cincinnati Colorado Colorado Columbus Columbus Dallas Dallas D.C. D.C. Houston Houston Kansas City Kansas City LA LA LAFC LAFC Miami Miami Minnesota Minnesota Montréal Montréal Nashville Nashville New England New England New York New York New York City New York City Orlando Orlando Philadelphia Philadelphia Portland Portland Salt Lake Salt Lake San Diego San Diego San Jose San Jose Seattle Seattle St. Louis St. Louis Toronto Toronto Vancouver Vancouver Terms of Service Privacy Policy Do Not Sell or Share My Personal Information Manage Cookies ©2025 MLS. The Major League Soccer and MLS name and shield are registered trademarks of Major League Soccer, L.L.C. (“MLS”). The names and logos of MLS teams are registered and/or common law trademarks of MLS or are used with the permission of their owners. Any unauthorized use is forbidden."
    },
    {
      "url": "https://www.resetyournest.com/post/game-organization-how-to-keep-games-organized",
      "content": "Published Time: 2021-10-27T08:47:02.189Z Game Organization - How to Keep Games Organized top of page BOOK A FREE CONSULTATION SERVICES MEMBERSHIPS HOME ORGANIZATION CONCIERGE MOVING DECLUTTERING FOR PRO ORGANIZERS ABOUT COMMUNITY PORTFOLIO BLOG FAQ More Use tab to navigate through the menu items. All Posts Organization Tips House Hacks Kitchen Decluttering Styling Pantry Kid Tips Closets Laundry Room Holidays Bathrooms Back to School Summer Gift Guide Reset Your Nest Bedroom Office Playroom & Games Christmas Craft Room Moving Tips Garage Travel Tips Fall/Autumn Spring Healthy Habits Self-Care Search Game Organization - How to Keep Games Organized Jen Martin Oct 27, 20213 min read Updated: Apr 25, 2024 My family LOVES playing games. But I'm sorry to say that for many years, this is not the sight one would see when they opened the closet I kept our games in: In fact, it was probably more like this: I would try to keep everything contained in the correct game boxes. I would try to keep things orderly and stacked by size. But sooner or later, things would get messy, pieces would be lost, and we would all be frustrated on game nights when we couldn't play the game we wanted to. The organizer in me knew there had to be a better way! So I experimented with my family's own games and lived with the system for a while before ever recommending it on Instagram or doing it in a client's home. And I have to tell you, we LOVE having our games organized like this! It might not be for everyone, but here are some tips for how to do this in your own home if you think it might be for you. If you want us to help you with your game closet, contact us HERE! Go-To Game Organization 1. Behold the Zipper Pouch for Board Games I use zipper pouches to organize a lot of things- car items, first aid supplies, plastic cutlery, etc. But this might be my favorite way to use them. Simply empty the contents of your game box into a pouch, stick on a label, and voila! If you have smaller pieces you would like to keep together, you can put them in a smaller zipper pouch to stick inside the larger one that's holding the game as a whole. You might be surprised to learn that most games will indeed fit in a large zipper pouch. If everything fits but the board, you can tuck that on the side of the basket. 2. Find a Bin that You Love These zipper pouches will fit great in a number of large bins. I love the weaved look of Target's budget-friendly y-weave bin pictured above, or the softer look of their felt bins. Measure where you will be storing the bins, and then pick one that will work best for your space. 3. Show Your Cards (or don't!) Card games fit great in the smallest size zipper pouch but I also love to put them in 4x6 photo storage boxes. These fit beautifully filed in a drawer. But if you don't have a drawer to put them in, I also love to use these chancellor bins from The Container Store. They are sturdy and large and have a big handle which makes them easy to pull out. 4. Contain the [Seemingly] Uncontainable There may be games in your collection that don't fit in a zipper pouch (I'm looking at you, Hungry Hungry Hippo). Multi-purpose bins from The Container Store are fantastic to use in these instances. Ditch the box and just keep the board and all the pieces right in the bin. And if that doesn't work, these stackable, modular clear bins from Target might be the right fit. If it makes sense in your storage space, I've also used these hinge-lid bins from mDesign as well. If you have game boxes that are sentimental to you or ones where the box is part of the game, simply stack those neatly somewhere in your game closet. Don't let that hold you back from doing this to the rest of your games! 5. Always, ALWAYS Label Are we at the point in our relationship where this goes without saying? I cannot emphasize enough the importance of labeling when it comes to maintaining systems, especially one like games that will have multiple people getting in and out of it. I love these birch bin clips from The Container Store on the felt bins especially. I used my favorite cube labeler for the modular storage bins from Target. Organizing games in this way not only looks better, but you'll be amazed at how much space it saves and at how easy it is to maintain. I also love that it makes games so easy to transport. Going to a friend's house for game night or up to the family cabin for the weekend? Just pull these bins from their spot in your home and put them in your car. You'll have your whole game collection with you for very little trunk space. Plus, no more lost pieces that have fallen out of broken game boxes. Now tell me, what is your family's favorite game? I'm always looking for new ones! Jen is the founder of Reset Your Nest, a Professional Home Organizing Business in Utah (servicing Salt Lake City, Park City, Ogden, Alpine, Highland, Mapleton, and St. George). She loves creating order and systems out of chaos and is known for bringing a beautiful aesthetic as well as easy to maintain function to any space. She shares her tips and tricks on Instagram @reset_your_nest. organizing hacks kid hacks label maker closet organization game organization decanting board games card games Playroom & Games • Organization Tips • Kid Tips Recent Posts See All 5 Simple Home Hacks Kid Room Organization - 6 Tips for Helping Your Kids to Help Themselves No-Fail System for Organizing Toys RESET YOUR NEST Schedule Services About Portfolio 30 Day Reset Program Blog FAQ Community Contact Press Reset Solutions Consulting info@resetyournest.com 2024 All Rights Reserved by Reset your Nest Salt Lake City, Utah Privacy Policy bottom of page",
      "title": "Published Time: 2021-10-27T08:47:02.189Z Game Organization - How to Keep Games Organized top of page BOOK A FREE CONSULTATION SERVICES MEMBERSHIPS HOME ORGANIZATION CONCIERGE MOVING DECLUTTERING FOR PRO ORGANIZERS ABOUT COMMUNITY PORTFOLIO BLOG FAQ More Use tab to navigate through the menu items. All Posts Organization Tips House Hacks Kitchen Decluttering Styling Pantry Kid Tips Closets Laundry Room Holidays Bathrooms Back to School Summer Gift Guide Reset Your Nest Bedroom Office Playroom & Games Christmas Craft Room Moving Tips Garage Travel Tips Fall/Autumn Spring Healthy Habits Self-Care Search Game Organization - How to Keep Games Organized Jen Martin Oct 27, 20213 min read Updated: Apr 25, 2024 My family LOVES playing games. But I'm sorry to say that for many years, this is not the sight one would see when they opened the closet I kept our games in: In fact, it was probably more like this: I would try to keep everything contained in the correct game boxes. I would try to keep things orderly and stacked by size. But sooner or later, things would get messy, pieces would be lost, and we would all be frustrated on game nights when we couldn't play the game we wanted to. The organizer in me knew there had to be a better way! So I experimented with my family's own games and lived with the system for a while before ever recommending it on Instagram or doing it in a client's home. And I have to tell you, we LOVE having our games organized like this! It might not be for everyone, but here are some tips for how to do this in your own home if you think it might be for you. If you want us to help you with your game closet, contact us HERE! Go-To Game Organization 1. Behold the Zipper Pouch for Board Games I use zipper pouches to organize a lot of things- car items, first aid supplies, plastic cutlery, etc. But this might be my favorite way to use them. Simply empty the contents of your game box into a pouch, stick on a label, and voila! If you have smaller pieces you would like to keep together, you can put them in a smaller zipper pouch to stick inside the larger one that's holding the game as a whole. You might be surprised to learn that most games will indeed fit in a large zipper pouch. If everything fits but the board, you can tuck that on the side of the basket. 2. Find a Bin that You Love These zipper pouches will fit great in a number of large bins. I love the weaved look of Target's budget-friendly y-weave bin pictured above, or the softer look of their felt bins. Measure where you will be storing the bins, and then pick one that will work best for your space. 3. Show Your Cards (or don't!) Card games fit great in the smallest size zipper pouch but I also love to put them in 4x6 photo storage boxes. These fit beautifully filed in a drawer. But if you don't have a drawer to put them in, I also love to use these chancellor bins from The Container Store. They are sturdy and large and have a big handle which makes them easy to pull out. 4. Contain the [Seemingly] Uncontainable There may be games in your collection that don't fit in a zipper pouch (I'm looking at you, Hungry Hungry Hippo). Multi-purpose bins from The Container Store are fantastic to use in these instances. Ditch the box and just keep the board and all the pieces right in the bin. And if that doesn't work, these stackable, modular clear bins from Target might be the right fit. If it makes sense in your storage space, I've also used these hinge-lid bins from mDesign as well. If you have game boxes that are sentimental to you or ones where the box is part of the game, simply stack those neatly somewhere in your game closet. Don't let that hold you back from doing this to the rest of your games! 5. Always, ALWAYS Label Are we at the point in our relationship where this goes without saying? I cannot emphasize enough the importance of labeling when it comes to maintaining systems, especially one like games that will have multiple people getting in and out of it. I love these birch bin clips from The Container Store on the felt bins especially. I used my favorite cube labeler for the modular storage bins from Target. Organizing games in this way not only looks better, but you'll be amazed at how much space it saves and at how easy it is to maintain. I also love that it makes games so easy to transport. Going to a friend's house for game night or up to the family cabin for the weekend? Just pull these bins from their spot in your home and put them in your car. You'll have your whole game collection with you for very little trunk space. Plus, no more lost pieces that have fallen out of broken game boxes. Now tell me, what is your family's favorite game? I'm always looking for new ones! Jen is the founder of Reset Your Nest, a Professional Home Organizing Business in Utah (servicing Salt Lake City, Park City, Ogden, Alpine, Highland, Mapleton, and St. George). She loves creating order and systems out of chaos and is known for bringing a beautiful aesthetic as well as easy to maintain function to any space. She shares her tips and tricks on Instagram @reset_your_nest. organizing hacks kid hacks label maker closet organization game organization decanting board games card games Playroom & Games • Organization Tips • Kid Tips Recent Posts See All 5 Simple Home Hacks Kid Room Organization - 6 Tips for Helping Your Kids to Help Themselves No-Fail System for Organizing Toys RESET YOUR NEST Schedule Services About Portfolio 30 Day Reset Program Blog FAQ Community Contact Press Reset Solutions Consulting info@resetyournest.com 2024 All Rights Reserved by Reset your Nest Salt Lake City, Utah Privacy Policy bottom of page"
    }
  ],
  "researchSummary": "Published Time: 2022-07-11T11:00:21+00:00 Play Pickleball by Organizing Pickup Games - Skip to content Menu Home Newsletter News & Opinion Guides Paddles Paddle Guide Beginners New Releases Spin Under $30 Shoes Other Gear Ball Machines Nets Balls Bags Training Aids T-Shirts We may earn a commission through affiliate links. Details Play Pickleball by Organizing Pickup Games July 11, 2022 Dan Langston Share If you love to play pickleball, then organize pickup games so you can play it anytime. This guide from the Pickleball Portal will show you how. You can set the schedule and name the place. You can also encourage others to learn about this great sport and find your favorite rivals to play with. How Can You Play Pickleball Pickup Games? Say the word pickup, and people mostly think of basketball. Pickups are spontaneous, unstructured games where players are invited to play, but no one is obligated. There are no formal rules and no referees. The whole point is to have fun, and teams are made up on the spot. You don’t suffer any repercussions if you lose, save for a bruised ego, and you aren’t committed to play any future games. Sounds a lot like pickleball, doesn’t it? With pickleball, people have always been able to show up at any pickleball match and find a game to play. That’s what’s so great about pickleball. It’s easy to find a match and make friends with other players. How Can I Organize Games So I Can Play Pickleball? If you’d like to organize pickups but aren’t sure how, there are several ways you can coordinate pickleball pickups. Here are a few ideas. 1. Decide How Many Players You Want First, think about how many pickleball courts you can reserve. If you only have access to one or two courts, then only contact eight or nine pickleball players. You don’t want frustrated players standing around waiting for their turn. If you have two courts and everyone shows up, people can play doubles so all of the players get to play pickleball. 2. Get the Word Out If you c",
  "coreTopic": "The main topic here revolves around organizing and playing pickup games of pickleball. It emphasizes the informal and spontaneous nature of pickup games, similar to how basketball is played, and provides guidance on how to set up these games, encouraging community engagement and participation in the sport. The focus is on making the sport accessible and enjoyable, highlighting the social aspect of playing pickleball with others.",
  "brandInfo": "\n      Website: https://foundertoolkit.org/\n      Brand: foundertoolkit\n      Products: No product images\n      Description: Backed by learnings and experience of solopreneurs who built tech startups doing 1M+ ARR\n\n      Documents: No documents\n      Logo: No logo\n      Posts/Videos: No posts/videos\n      Taglines: None\n      Colours: No colours\n      Country: No country\n    ",
  "youtubeVideo": "No video found.",
  "internalLinks": [
    "/blog/tips-for-growth",
    "/resources/ecommerce-guide"
  ],
  "references": [
    "https://playpickups.app/",
    "https://www.pickleballportal.com/blog/play-pickleball-by-organizing-pickup-games/",
    "https://d36m266ykvepgv.cloudfront.net/uploads/media/I6bIAClbxg/o/how-to-organise-a-game-of-pick-upultimate.pdf",
    "https://www.socceramerica.com/get-up-and-start-a-pickup-game/",
    "https://app.roll20.net/forum/post/111760/pick-up-games-and-social-contracts",
    "https://opensports.net/blog/top-5-concerns-everyone-has-when-organizing-a-pickup-game",
    "https://www.quora.com/Is-there-a-need-for-a-better-way-to-organize-pickup-sports",
    "https://www.mlssoccer.com/news/jogabo-smartphone-app-organizes-pick-games-finds-new-players-and-tracks-stats",
    "https://www.resetyournest.com/post/game-organization-how-to-keep-games-organized",
    "No video found."
  ],
  "existingPosts": "# Let’s Get Real: Ditch the Awkward and Make New Friends!\n\nYo, picture this: me, half-asleep, figuring out the main topic revolves around strategies for socializing and making friends, particularly in the context of reconnecting after the isolation brought on by online learning during the pandemic. It emphasizes overcoming social awkwardness and offers practical tips for engaging with peers in person. Slapped me awake—time to lay it out, bro...\n\nMan, it’s time to talk about this craziness we’ve all been through. Two years of online learning had us all cooped up in our rooms, staring at screens while trying to pretend like we weren’t slowly losing our social skills. Seriously, the last time I tried to talk to someone in person, I felt like a deer caught in headlights. I mean, how do you even start a conversation after being stuck in your house watching Netflix all day?\n\nLet’s dive into the real shit. How do we bounce back from this? How do we make new friends and shake off the rust after all that isolation? \n\n## The Struggle is Real: Acknowledging Social Awkwardness\n\nFirst things first, let’s talk about social awkwardness. If you think you’re the only one who feels that twinge of discomfort when you walk into a room full of people, let me tell you, you're not alone! We’ve all been there. Whether it’s the sweaty palms, the mind going blank, or just an overwhelming desire to slide into the nearest corner and avoid eye contact, it's all part of the game.\n\nThe pandemic cranked this up to eleven. We went from being social butterflies to couch potatoes in record time. And now we’re expected to just flip a switch and be all social again? Like, what the hell? \n\n- Pro tip: \n\n  Accept that it's okay to feel awkward. We’ve all been through a collective trauma (yeah, I said it!). Acknowledging that you're feeling a bit off is the first step to shaking it off. \n\n## Step into the Light: Find Your Reconnecting Vibe\n\nSo, how do we find our groove again? It’s all about finding spaces",
  "targetKeywords": [],
  "timestamp": "2025-03-04",
  "nudge": "huvol"
}