{
  "initialUrl": "https://helpy-ui.com/",
  "initialResearchSummary": "Alright, let's break it down like we're just hanging out, sipping a cold one. So, you’ve thrown me this URL: https://helpy-ui.com/. Just from the name, “helpy” kind of gives off some friendly, approachable vibes, right? It sounds like it’s set up to assist folks in some way, maybe in web design or user interface stuff. When I hear “UI,” my mind goes straight to user interface design. This is all about how applications and websites look and feel for the user. So, I’m betting this site is likely a treasure trove for designers, developers, and anyone looking to jazz up their digital spaces. Maybe they offer tools, templates, or resources that make creating a smooth user experience a piece of cake. Given the “-ui” in the domain, I can imagine there’s probably a lot of focus on aesthetics—think sleek layouts and easy navigation. Maybe they dive into design principles, color theory, or typography, you know, the stuff that makes a site pop and not feel like a total snooze fest. Also, the site might have some interactive elements or demos. I mean, visuals are everything when you’re talking UI. So, it could be showcasing some cool examples or case studies that inspire designers to embrace creativity and innovation. There's a good chance they’ve got a blog or a resource center filled with tips and tricks on how to nail that perfect design. And hey, let’s not forget about the community aspect. A site like this could attract a bunch of like-minded creatives, right? There might be forums or social integration where folks can share their work, get feedback, and collaborate on projects. It’s like a creative watering hole where ideas flow and inspiration bounces around. They might also have some kind of marketplace, where designers can snag assets—icons, illustrations, or even complete design kits to save time and boost their projects. Who doesn’t love a good shortcut when you’re grinding away on something? Now, if I had to throw a guess about the feel of the site, I’d say it leans toward modern and minimalistic, with a dash of friendliness. You know, not the sterile, corporate vibe that makes you feel like you’re staring down a bunch of robots. More like a cozy café where the barista knows your order before you even say it. So, yeah, I’m picturing a site that’s all about making UI design fun and accessible. Helping people who might feel overwhelmed with the tech side of things realize that they can create awesome stuff too. At the end of the day, it’s all about empowering individuals to express themselves through design. Of course, this is all guesswork based on the URL, but if it’s anything like what I’m thinking, I’d definitely want to check it out. Who knows, maybe it’s the secret sauce for my next project! Cheers to that!",
  "researchResults": [
    {
      "url": "https://www.reddit.com/r/Competitiveoverwatch/comments/19612zr/what_do_you_guys_think_about_being_able_to_change/",
      "content": "The customization options vary for each Mythic cosmetic, ranging from different colors and weapon styles to other visual upgrades like different",
      "title": "The customization options vary for each Mythic cosmetic, ranging from different colors and weapon styles to other visual upgrades like different"
    },
    {
      "url": "https://www.youtube.com/watch?v=qAI-GQNFnkU",
      "content": "Creating Custom User Interface! - Make Your First Game Tutorial Series | Part 8 HypeHype: Play & Create Games 7800 subscribers 35 likes 1651 views 6 May 2024 Learn how to create custom User Interface to your game! We'll be adding timer and health bar that follows the player. This tutorial series goes into detail on how to make your first adventure game. If you have any questions, feel free to leave them in the comments! What we made in Part 7 https://hypehype.com/r/hN2jtxIUbJgp46 What we made in Part 8 https://hypehype.com/r/kZMIdjMv9xz4WT Join our Discord: ➡️ https://discord.gg/HypeHype Get HypeHype early access and start creating games with no coding on your phone or tablet! https://hypehype.com Tutorials: https://youtube.com/playlist?list=PLw4nhkGycwNHTR29Nh3GHSCqwR824tmaf Learn docs: https://wiki.hypehype.com Social media: https://twitter.com/HypeHypeGameApp https://tiktok.com/@hypehype_gameapp https://facebook.com/HypeHypeGameApp https://instagram.com/hypehype_gameapp HypeHype is a new revolutionary way to create, remix and play games on your phone. Our mission is to empower anyone to become a game maker through simple, fun and free tools on mobile devices. We are in early access. Jump in to become a game creator and shape the future of gaming! Get access: https://hypehype.com/get-access Time stamps: 00:00 Intro 00:23 Adding User Interface 01:20 User Interface Editor 02:00 Importance of Alignment 03:08 Creating Timer UI 05:58 Adding Time Input 07:07 Connecting Time 07:35 Polishing Time UI 08:57 Custom Health Bar 09:45 Adding Position Input 10:03 Adding Progress Bar 11:08 Adding Custom Inputs 11:21 Connecting Values 12:05 Making UI Follow Player 14:04 Outro 14:30 Bloopers #hypehype #devlog #gamedev #gaming 10 comments Welcome back creators to the Making a Game in Hype Hype Tutorial Series. In the last video, we created a time score and leaderboard for our platforming game, and used the text and speech nodes to show that score and communicate with players. In this video, we'll improve on the look of our score visualization with the UI node. We'll also get a bit into editing pre-mades so we can also add a health bar to our UI. First things first, in the last video, we collected our score and leaderboard logic into this container, but I didn't name it. It's always helpful when returning to a project if things are properly named, so let's fix that now. I'll just call this one \"score\". And now we can open up this container since we'll be working with the nodes we have inside. So in here, we have the logic we created last time, which essentially shows our score as we play, and our score is the time here. But it's really plain looking, and it looks exactly the same as every other game that uses the text node to show their score. If we want our game to stand out, giving this a more unique look will help. So let's add to this container a UI or user interface node, and we'll find this in the visual section of the logic library. Now with this selected in the details panel, we have this edit button, which takes us to the In here we have bunch of new stuff to look at, but instead of looking at each option one by one, let's just start building our time score and look at everything along the way. At the bottom, we have all the UI components we can use to build our UI, and we can drag these items into the UI canvas, which is right above it. I've grabbed here just a panel. Now that we have this panel on our canvas, we can move it around with the widget, we can rescale it, and we can change the alignment. We can also delete it, but deleting requires a long press so you don't accidentally delete stuff. One very important thing when placing things on the UI canvas is the alignment. HypePipe can be played on many different devices with many different screen dimensions. The alignment will anchor the component to a specific part of the screen, so the placement can adjust based on each player's screen size. If you move stuff around, it's going to automatically try and anchor it to the closest anchor point, but that might not always be what you're looking for. As an example, I'm going to drag another panel in here, and I'm going to place these two panels so that they're right on top of each other. Now if we exit and play test, we can see that those two panels are much further apart than they were in our preview. If we want those two panels to appear the same way that they do on the canvas, they both need to be set to the same alignment point. This panel here is aligned to the center, while this panel is aligned to the top, so I'm just going to change this one to the center as well, and you can do this from the properties here or from the widget. Now if we play test again, we're going to see that those two panels look the same way that they do in our preview. Okay, so let's start to actually build our score visualization. I'm going to start by deleting this second panel that was just there as an example. Now I can grab the first one and we can resize it and place where we want. You can resize with the handles, but I already know I want this to be 350 by 100 pixels, so I'll manually input those in the property values here. And for now, I'd like this to be in the same position as our text score, so I'm just going to move it up to the top center and I'm going to use those alignments and snapping to make sure that it is nicely centered at the top of our screen. Now let's look at a few of the properties we have in the properties panel over here. First let's change the color. We can tap the color preview and this opens up our color selection. These are the UI colors, so you can pick from any of the existing ones or make a new one. I like the background to be dark with a little bit of transparency and we already have an alpha 50% there, so I'm going to go ahead and take that. We can also select a shape for our panel. We have a bunch of different shapes to choose from here, but for what we're building right now, the rounded corner shape I think is going to be good for our purposes. We can also change the border. since we have a dark background here, I would like to have a lighter border, so I'm going to change that to white and I'm going to make the width 5 pixels and now we have a nice white border around our shape. We have a bunch more options here, but for our purposes now, this one's looking pretty good. Next we're going to add a text component to display our time. From the components menu here, I'm going to drag the text and I'm going to hover it right over our panel there. This will attach it to the panel. Now in the hierarchy menu, we can see our panel and our text component that's underneath it and indented a little bit to let us know that the text is embedded in that panel. In the hierarchy panel, layers appear in reverse order, so the layer at the bottom of the list appears on top of all the others. If we drag our text score and put it above the panel, we can see there that it's now being obscured a little bit by the panel, but we put it back there and it goes right in. And as we move things around, it's going to automatically attach or detach from items. So if we move this text out of the panel, we can see it automatically detaches from the panel. If we move it back in, it automatically attaches back into the panel. Now let's set up this text component. First, it's always good to give it a name. Let's call this one Time Next, I'm going to set the text to be a zero and this just lets the component know that we're going to be working with values instead of Text We want our text size here to be much larger, so let's try 1.5. The next menu we want to look at is inputs and outputs. This menu allows us to activate inputs or outputs for components on the canvas. For this text node, we want to be able to input a value, so we'll toggle this value input on and hit confirm. With time, it's good to display decimals, so we can see that number climbing every frame. I'll set our decimal value here to 3, and of course our format is going to be time, and I'm going to go ahead and disable this outline. You can barely see it on the dark background, but by default the text has a black outline to help it stand out. Since our panel already helps separate it from the rest of the screen, we don't need this, and removing it is going to make the text a little bit easier to center. Now, let's jump out of the UI Editor and attach our time score. You can see here when I select the UI node, we now have the time value as an input in the details panel, and this uses the name of the component plus the type of input it is, another great reason to properly name things. If you have a bunch of inputs and outputs in your UI node and you haven't named anything, it's going to be really hard to tell which one is which. So now let's grab our old text node and we're just going to delete that. We don't need it anymore, and we're going to grab our time and send that output to our time value. This is just displaying the value, so we do not need to convert this into an executing link, and we're going to talk more about the different types of links in the next video. Now, let's give a test and see how it looks. Not bad. Looks good, but let's jump back into the UI Editor and add a little more polish. From the components, I'm going to grab an image and drag it up to our panel, and then we can tap the image preview in the properties panel to select a different image to use. We want something that's going to represent time, and we have a nice clock icon here that'll do nicely. White's going to be a good color for now as it matches our other elements. We don't need inputs and outputs. When components are embedded into another component, the alignment is going to be based on the parent component, and since our panel here never changes size, it's not super critical exactly where in the panel this item aligns to. And then the last thing we're going to want to edit here is the size. Now, regardless of what these images look like, all of the images in the UI component are square, so I'm going to resize this one to 60 by 60, and that's a pretty good size. Now, I can align it with my text. I'm going to move it over to the side a little bit, and I'm going to take my text, and I'm going to move that to the side a little bit as well to offset it from the icon. And of course I want to make sure that everything is nicely centered in the panel. Now, let's give it another play test. And there we go. We have a nice looking time display. Last thing we'll do this time is add a health bar for our player. For this, we're going to add some nodes into the player health behavior. To find the behavior so that I can edit it, I'm first going to find and select my player, and then in the basics details panel, I'm going to find the player health, expand that, and then hit this little pencil icon to bring up the player health container. Now, before we start working, I'm going to move this off to the side so that it's in a position where it's going to be a little easier to work with. Now that we have a nice space to work, let's add another UI node into this container. Again, we'll start by putting a panel onto our canvas so that we can animate the progress bar to follow the player. So we don't need to see this panel, so I'm going to create a new UI color that is 100% transparent. We'll call this one alpha zero. There we go. Invisible panel. And then to animate it, we'll need an input. In this case, we want this last one, position from World Vector. Now we can drag a progress bar into our panel. Again, with our progress bar, we're going to start with a name. And in this case, we'll simply call it health. The next one is the direction. I like to use right. That means as the bar fills up, it moves to the right. As it is empty, it moves to the left. The amount is current health the player has, while the max amount is the total health they can have. Both of these values are going to come from the behavior, so we don't need to set these here. Some color will be good in the health bar. In a future video, maybe we'll discuss how you can change the color based on the value, but for now, I'm just going to set this to green And I do want the visuals here to match our time score, so I'm going to set the background color to this alpha 50 and the border colro to white. Since this health bar is going to follow our player, it should be pretty small. I'm going to set our dimensions here to 100 width and only 25 height. And again, we'll need to check the inputs so the progress bar can get the health value and the max health value from the behavior. Since the progress bar doesn't work without a value, the amount there is already selected for us. We'll go ahead and toggle on the max amount as well and hit confirm. Now we can back out of the UI editor and get those values. So the first thing I want to do here in the player health is find the values that I need to use. And I can see right here we have both of them, max hit points and hit point calculator. So max hit points is our max hit point value and the hit point calculator is our current hit points value. So I'll just grab that. I'll send our value output here into the health amount. And then from the max hit points, I will send that into the health max amount. And now we should have a working healthbar. Let's give it a test. Oh, oh, it's going down. Oh, it went down again. Oh, went down health bar working. Oh no, I fell off. So our health bar is successfully tracking the player's health, but it is still static on the screen. So let's do one last thing and make it follow the player. For this, we're going to add a few more nodes to the behavior. First, we're going to need a value inspector. And then we will need a vector math operator. So the value inspector is going to get us the position of the player. Since we've put this into the behavior here, it's automatically detected this puzzle piece as our reference object and selected it to the value inspector. It is also by default set to get us the position vector of that object. So we actually don't need to change anything in here. If we drag this value directly to the UI node, the progress bar is going to follow the center of the player, but we want it to be up over his head. So we're going to need to do a little math to make it a little higher. So let's drag this into vector one of the vector math operator. Now in the vector math operator, we have vector one is the value we're getting from that value inspector. Vector two is the value that we're going to add to it for this one, X and Z can stay zero and we'll make Y for now one. The operation is automatically add. So we can just take that value output to our user interface and set it to this panel position from world vector. And now when we play test, we'll see that that health bar is following the position of our player. And of course, it's maybe a little bit too low still. So we could drop back into this, maybe add a little bit more to our Y value until we get it to a position that we like. And of course, we can also see here that we have the green health bar and the green of our ground, maybe conflicts a little bit. We might want to choose a different color for our health bar, but that's something that we'll get into in the polishing phase. For now, we have achieved our goals for today. And that's going to do it for this video. I encourage you to play around with the UI node. We've only scratched the surface of this tool and custom UI is a great way to give your game a more polished feel. In the next video, we'll continue working with logic, discussing some very useful math nodes, push versus pool links, and progress saves so players can save their progress between sessions. Until then, happy creating. Peace out, hypesters.",
      "title": "Creating Custom User Interface! - Make Your First Game Tutorial Series | Part 8 HypeHype: Play & Create Games 7800 subscribers 35 likes 1651 views 6 May 2024 Learn how to create custom User Interface to your game! We'll be adding timer and health bar that follows the player. This tutorial series goes into detail on how to make your first adventure game. If you have any questions, feel free to leave them in the comments! What we made in Part 7 https://hypehype.com/r/hN2jtxIUbJgp46 What we made in Part 8 https://hypehype.com/r/kZMIdjMv9xz4WT Join our Discord: ➡️ https://discord.gg/HypeHype Get HypeHype early access and start creating games with no coding on your phone or tablet! https://hypehype.com Tutorials: https://youtube.com/playlist?list=PLw4nhkGycwNHTR29Nh3GHSCqwR824tmaf Learn docs: https://wiki.hypehype.com Social media: https://twitter.com/HypeHypeGameApp https://tiktok.com/@hypehype_gameapp https://facebook.com/HypeHypeGameApp https://instagram.com/hypehype_gameapp HypeHype is a new revolutionary way to create, remix and play games on your phone. Our mission is to empower anyone to become a game maker through simple, fun and free tools on mobile devices. We are in early access. Jump in to become a game creator and shape the future of gaming! Get access: https://hypehype.com/get-access Time stamps: 00:00 Intro 00:23 Adding User Interface 01:20 User Interface Editor 02:00 Importance of Alignment 03:08 Creating Timer UI 05:58 Adding Time Input 07:07 Connecting Time 07:35 Polishing Time UI 08:57 Custom Health Bar 09:45 Adding Position Input 10:03 Adding Progress Bar 11:08 Adding Custom Inputs 11:21 Connecting Values 12:05 Making UI Follow Player 14:04 Outro 14:30 Bloopers #hypehype #devlog #gamedev #gaming 10 comments Welcome back creators to the Making a Game in Hype Hype Tutorial Series. In the last video, we created a time score and leaderboard for our platforming game, and used the text and speech nodes to show that score and communicate with players. In this video, we'll improve on the look of our score visualization with the UI node. We'll also get a bit into editing pre-mades so we can also add a health bar to our UI. First things first, in the last video, we collected our score and leaderboard logic into this container, but I didn't name it. It's always helpful when returning to a project if things are properly named, so let's fix that now. I'll just call this one \"score\". And now we can open up this container since we'll be working with the nodes we have inside. So in here, we have the logic we created last time, which essentially shows our score as we play, and our score is the time here. But it's really plain looking, and it looks exactly the same as every other game that uses the text node to show their score. If we want our game to stand out, giving this a more unique look will help. So let's add to this container a UI or user interface node, and we'll find this in the visual section of the logic library. Now with this selected in the details panel, we have this edit button, which takes us to the In here we have bunch of new stuff to look at, but instead of looking at each option one by one, let's just start building our time score and look at everything along the way. At the bottom, we have all the UI components we can use to build our UI, and we can drag these items into the UI canvas, which is right above it. I've grabbed here just a panel. Now that we have this panel on our canvas, we can move it around with the widget, we can rescale it, and we can change the alignment. We can also delete it, but deleting requires a long press so you don't accidentally delete stuff. One very important thing when placing things on the UI canvas is the alignment. HypePipe can be played on many different devices with many different screen dimensions. The alignment will anchor the component to a specific part of the screen, so the placement can adjust based on each player's screen size. If you move stuff around, it's going to automatically try and anchor it to the closest anchor point, but that might not always be what you're looking for. As an example, I'm going to drag another panel in here, and I'm going to place these two panels so that they're right on top of each other. Now if we exit and play test, we can see that those two panels are much further apart than they were in our preview. If we want those two panels to appear the same way that they do on the canvas, they both need to be set to the same alignment point. This panel here is aligned to the center, while this panel is aligned to the top, so I'm just going to change this one to the center as well, and you can do this from the properties here or from the widget. Now if we play test again, we're going to see that those two panels look the same way that they do in our preview. Okay, so let's start to actually build our score visualization. I'm going to start by deleting this second panel that was just there as an example. Now I can grab the first one and we can resize it and place where we want. You can resize with the handles, but I already know I want this to be 350 by 100 pixels, so I'll manually input those in the property values here. And for now, I'd like this to be in the same position as our text score, so I'm just going to move it up to the top center and I'm going to use those alignments and snapping to make sure that it is nicely centered at the top of our screen. Now let's look at a few of the properties we have in the properties panel over here. First let's change the color. We can tap the color preview and this opens up our color selection. These are the UI colors, so you can pick from any of the existing ones or make a new one. I like the background to be dark with a little bit of transparency and we already have an alpha 50% there, so I'm going to go ahead and take that. We can also select a shape for our panel. We have a bunch of different shapes to choose from here, but for what we're building right now, the rounded corner shape I think is going to be good for our purposes. We can also change the border. since we have a dark background here, I would like to have a lighter border, so I'm going to change that to white and I'm going to make the width 5 pixels and now we have a nice white border around our shape. We have a bunch more options here, but for our purposes now, this one's looking pretty good. Next we're going to add a text component to display our time. From the components menu here, I'm going to drag the text and I'm going to hover it right over our panel there. This will attach it to the panel. Now in the hierarchy menu, we can see our panel and our text component that's underneath it and indented a little bit to let us know that the text is embedded in that panel. In the hierarchy panel, layers appear in reverse order, so the layer at the bottom of the list appears on top of all the others. If we drag our text score and put it above the panel, we can see there that it's now being obscured a little bit by the panel, but we put it back there and it goes right in. And as we move things around, it's going to automatically attach or detach from items. So if we move this text out of the panel, we can see it automatically detaches from the panel. If we move it back in, it automatically attaches back into the panel. Now let's set up this text component. First, it's always good to give it a name. Let's call this one Time Next, I'm going to set the text to be a zero and this just lets the component know that we're going to be working with values instead of Text We want our text size here to be much larger, so let's try 1.5. The next menu we want to look at is inputs and outputs. This menu allows us to activate inputs or outputs for components on the canvas. For this text node, we want to be able to input a value, so we'll toggle this value input on and hit confirm. With time, it's good to display decimals, so we can see that number climbing every frame. I'll set our decimal value here to 3, and of course our format is going to be time, and I'm going to go ahead and disable this outline. You can barely see it on the dark background, but by default the text has a black outline to help it stand out. Since our panel already helps separate it from the rest of the screen, we don't need this, and removing it is going to make the text a little bit easier to center. Now, let's jump out of the UI Editor and attach our time score. You can see here when I select the UI node, we now have the time value as an input in the details panel, and this uses the name of the component plus the type of input it is, another great reason to properly name things. If you have a bunch of inputs and outputs in your UI node and you haven't named anything, it's going to be really hard to tell which one is which. So now let's grab our old text node and we're just going to delete that. We don't need it anymore, and we're going to grab our time and send that output to our time value. This is just displaying the value, so we do not need to convert this into an executing link, and we're going to talk more about the different types of links in the next video. Now, let's give a test and see how it looks. Not bad. Looks good, but let's jump back into the UI Editor and add a little more polish. From the components, I'm going to grab an image and drag it up to our panel, and then we can tap the image preview in the properties panel to select a different image to use. We want something that's going to represent time, and we have a nice clock icon here that'll do nicely. White's going to be a good color for now as it matches our other elements. We don't need inputs and outputs. When components are embedded into another component, the alignment is going to be based on the parent component, and since our panel here never changes size, it's not super critical exactly where in the panel this item aligns to. And then the last thing we're going to want to edit here is the size. Now, regardless of what these images look like, all of the images in the UI component are square, so I'm going to resize this one to 60 by 60, and that's a pretty good size. Now, I can align it with my text. I'm going to move it over to the side a little bit, and I'm going to take my text, and I'm going to move that to the side a little bit as well to offset it from the icon. And of course I want to make sure that everything is nicely centered in the panel. Now, let's give it another play test. And there we go. We have a nice looking time display. Last thing we'll do this time is add a health bar for our player. For this, we're going to add some nodes into the player health behavior. To find the behavior so that I can edit it, I'm first going to find and select my player, and then in the basics details panel, I'm going to find the player health, expand that, and then hit this little pencil icon to bring up the player health container. Now, before we start working, I'm going to move this off to the side so that it's in a position where it's going to be a little easier to work with. Now that we have a nice space to work, let's add another UI node into this container. Again, we'll start by putting a panel onto our canvas so that we can animate the progress bar to follow the player. So we don't need to see this panel, so I'm going to create a new UI color that is 100% transparent. We'll call this one alpha zero. There we go. Invisible panel. And then to animate it, we'll need an input. In this case, we want this last one, position from World Vector. Now we can drag a progress bar into our panel. Again, with our progress bar, we're going to start with a name. And in this case, we'll simply call it health. The next one is the direction. I like to use right. That means as the bar fills up, it moves to the right. As it is empty, it moves to the left. The amount is current health the player has, while the max amount is the total health they can have. Both of these values are going to come from the behavior, so we don't need to set these here. Some color will be good in the health bar. In a future video, maybe we'll discuss how you can change the color based on the value, but for now, I'm just going to set this to green And I do want the visuals here to match our time score, so I'm going to set the background color to this alpha 50 and the border colro to white. Since this health bar is going to follow our player, it should be pretty small. I'm going to set our dimensions here to 100 width and only 25 height. And again, we'll need to check the inputs so the progress bar can get the health value and the max health value from the behavior. Since the progress bar doesn't work without a value, the amount there is already selected for us. We'll go ahead and toggle on the max amount as well and hit confirm. Now we can back out of the UI editor and get those values. So the first thing I want to do here in the player health is find the values that I need to use. And I can see right here we have both of them, max hit points and hit point calculator. So max hit points is our max hit point value and the hit point calculator is our current hit points value. So I'll just grab that. I'll send our value output here into the health amount. And then from the max hit points, I will send that into the health max amount. And now we should have a working healthbar. Let's give it a test. Oh, oh, it's going down. Oh, it went down again. Oh, went down health bar working. Oh no, I fell off. So our health bar is successfully tracking the player's health, but it is still static on the screen. So let's do one last thing and make it follow the player. For this, we're going to add a few more nodes to the behavior. First, we're going to need a value inspector. And then we will need a vector math operator. So the value inspector is going to get us the position of the player. Since we've put this into the behavior here, it's automatically detected this puzzle piece as our reference object and selected it to the value inspector. It is also by default set to get us the position vector of that object. So we actually don't need to change anything in here. If we drag this value directly to the UI node, the progress bar is going to follow the center of the player, but we want it to be up over his head. So we're going to need to do a little math to make it a little higher. So let's drag this into vector one of the vector math operator. Now in the vector math operator, we have vector one is the value we're getting from that value inspector. Vector two is the value that we're going to add to it for this one, X and Z can stay zero and we'll make Y for now one. The operation is automatically add. So we can just take that value output to our user interface and set it to this panel position from world vector. And now when we play test, we'll see that that health bar is following the position of our player. And of course, it's maybe a little bit too low still. So we could drop back into this, maybe add a little bit more to our Y value until we get it to a position that we like. And of course, we can also see here that we have the green health bar and the green of our ground, maybe conflicts a little bit. We might want to choose a different color for our health bar, but that's something that we'll get into in the polishing phase. For now, we have achieved our goals for today. And that's going to do it for this video. I encourage you to play around with the UI node. We've only scratched the surface of this tool and custom UI is a great way to give your game a more polished feel. In the next video, we'll continue working with logic, discussing some very useful math nodes, push versus pool links, and progress saves so players can save their progress between sessions. Until then, happy creating. Peace out, hypesters."
    },
    {
      "url": "https://www.sketch.com/blog/game-ui-design/",
      "content": "What is game UI? A complete beginner’s guide to game interface design · Sketch Skip Navigation Menu Sketch Sign In Product Design Collaboration Prototyping Developer Handoff All Features What’s New Sketch in 2024 Smart Animate Easy Library swaps See all updates Explore Blog Resources Extensions & Plugins Courses Sketch 101 Sketch 102 Pricing Support Help Center Documentation Contact Us Community Forum Sign In Get started Download Sign In Product What’s New Design Collaboration Prototyping Developer Handoff All Features Explore Blog Resources Sketch 101 Sketch 102 Extensions & Plugins Support Help Center Documentation Contact Us Community Forum Extra Surprises 🎁 Layout overlay Learn design Inside Sketch What’s new #MadeWithSketch Sketch Categories Learn design Inside Sketch What’s new #MadeWithSketch Most popular tags Prototyping Commenting Templates Libraries Case Study Tutorial Roundup Beginner Intermediate Tips Vector Editing Symbols Mac app Developer Handoff Insight Open Format Overlays Behind the Feature Meet the Maker Blog by Sketch Learn design 12 Sep 2022 What is game UI? A complete beginner’s guide to game interface design Press A to continue Insight Author Gabrielle van Welie Share When we think about video games, animation and character design usually come to mind. But no game is complete — or even usable — without some good ol’ UI design. Yup! There’s a huge space for UI designers in the video game industry, and you’ll soon see why. Ready to go from gamer to budding game interface designer? All you’ll need is this guide and some trusty game UI design software — like Sketch. Choose a save slot to begin. Load/Save screen of Alike Studio’s All of You via Game UI Database. This image is used for educational purposes. Hint: What is game UI? First things first, let’s talk about what game UI is. Simply put, game interface design focuses on creating visual cues that help users follow the intended course of action in any given video game. Think of on-screen instructions like ‘Press X to open’ or a map of your surroundings. Of course, game interface design is a lot more than that — and it’s a space that keeps evolving with new technologies and platforms. For example, designing a game for Xbox, where the player will be using a controller, is very different from designing a mobile game, where it’s all about the touchscreen. We’ll be diving deeper into these concepts in a bit. But first, let’s get a full-picture view of the game design process. Game design melee: When UX meets UI As with most things in design, wherever there’s a UI designer, you’re likely to find their UX counterpart. Here’s what collaboration between these roles usually looks like in video game design: First, the UX designer will map out the player’s journey. They’ll usually create a mockup or wireframe detailing these steps and where each decision can lead the player. A good rule of thumb for UX designers at this stage is to only include the steps and decision points that are absolutely necessary. Next, the UI designer will start creating a semantic language using elements like color, typography, content hierarchy, and shapes to make these steps as intuitive and appealing as possible. The goal is to empower players to make decisions quickly and confidently — except when you want to lead them astray, of course 😉 All throughout, UX and UI designers will work closely with motion graphics designers, who’ll start thinking of ways to animate those cool character selection screens, maps and skill trees we know and love. And while we could spend hours talking about all of the sides to game design, today’s chosen character is ‘Game UI Designer’. So let’s take a look at what their storyline entails. You’ve chosen Game UI Designer Character screen from Atlus’ 13 Sentinels: Aegis Rim via Game UI Database. This image is used for educational purposes. Want to see more examples of great game UI examples? Take a look at Game UI Database — the team there has curated more than 41,000 screenshots from nearly 1,000 games, so you’re sure to find some inspiration. First quest: Understanding interface components in game UI design When it comes to game UI design, there are four types of visual representation: diegetic, non-diegetic, spatial and meta. To become a great game UI designer, you first have to understand what these mean and how you can use them effectively. Let’s break them down. Diegetic: UI elements that can be seen or heard by the character and fit within the story’s context. Examples: a phone with a visible screen, holograms, and other futuristic gadgets. Non-diegetic: UI elements that exist outside of the game or story and that only the player sees. Examples: menu screens, quest windows, and health bars. Spatial: UI elements that are represented within the game space but aren’t visible to the characters. Examples: character outlines indicating who the enemies are, an arrow showing where a thrown object will land, and text labels. Meta: UI elements that are contextual to the game but aren’t represented within the game space. Examples: scrolling text or colored overlays that indicate a change in the player’s health status. Here’s a quick look at how you can differentiate between the four types of visual representation. Second quest: Game UI design in action As we’ve seen, there are quite a lot of video game elements that actually fall under user interface design. UI designers create anything from health bars to character selection and inventory screens. But there’s one place that’s made up almost entirely of UI elements: the HUD, or Heads-up Display. You can think of the HUD as an overlay that houses all sorts of UI elements. It’s where the player will find most of the information they’re looking for as they play the game. To understand this in context, let’s look at this example from Persona 5. A moment in Atlus’ Persona 5 via Game UI Database. This image is used for educational purposes. Here, you can see how the HUD houses the title character’s health and stamina bars in the bottom-right corner, an actions menu surrounding the character, and even some top-right text guides to remind the player of their next move. As this episode of Game Marker’s Toolkit explains, we can categorize most HUD elements as gauges or previews. Gauges, like health bars and maps, help the player understand what is currently happening in the game and what could happen. These UI elements aim to help the player make informed, big-picture decisions. Previews, such as a text layer indicating you should press X to open a door or throwing arcs showing where an item will land, let the player know about the immediate effects of their actions. The goal is to give the player a sense of reassurance about their next move. You can also increase or decrease a game’s difficulty through UI elements. If you think about it, the player receives most hints through the HUD. Often, when choosing between Easy, Normal and Hard modes, you’re actually selecting the amount of HUD tips you’ll see on screen. That, and maybe some increased HP for the bad guys. Third quest: Choosing a game UI design software Alright, so enough with the lessons! Now that we’ve covered some game UI design basics, it’s time to get to work. How and where should we start creating the next chart-topping video game? For a UI designer, it all starts with choosing the right game UI design software. On top of meeting your basic UI design needs like layer lists, styling tools, and vector editing, here are some essential features to look out for: The ability to create a library of reusable elements so that you can store anything from different versions of the same health bar to maps of varying sizes. Imagine all the time you’ll be saving! A prototyping functionality so you can bring your UX designer’s wireframe to life using overlays and preview your UI in action Collaboration options so that you can work together with UX designers and other teammates as you fine-tune your design Proper handoff tools so that it’s easy for your devs to transform your design into a fully functioning video game. Ready to try your hand at game UI design? Sketch can help — and you can get started for free! TL;DR Game UI focuses on creating visual cues that help users follow the intended course of action in any given video game. Those cues can be diegetic, non-diegetic, spatial or meta. The HUD (Heads-up Display) is a powerful overlay that houses a lot of these cues — especially gauges and previews — during gameplay. Game UI designers work closely with UX designers and motion graphics designers. The right game UI design software will have features like prototyping, collaboration, handoff, and reusable elements. And there you have it! We hope you learned a thing or two about game UI design and that you’re feeling ready to try it out for yourself. And if not… maybe we just gave you a bunch of details you won’t be able to unsee next time you play your favorite video game. So, what do you say? Scene from Undertale via Game UI Database. This image is used for educational purposes. Share Useful Links Learn more about UI design Ready to work on some game UI design? To the Mac app! Read about how RareSloth designed their own video game in Sketch About the Author Gabrielle van Welie Content Writer Share You may also like Learn design 11 Nov 2024 Oh no, I need to design a tinted iOS 18 app icon — how to do it right ---------------------------------------------------------------------Tinted app icons in iOS 18 were met with plenty of concerns over visual hierarchy and brand identity. Here are a few tricks we used to make ours look good and feel right at home. Tips Learn design 30 Sep 2024 Prototyping in Sketch: Everything you need to know --------------------------------------------------Learn how to create realistic prototypes with a variety of tools, like Overlays or scroll areas, add movement with Smart Animate and preview them in our iOS app Prototyping Tutorial Intermediate Learn design 26 Oct 2023 A beginner’s guide to icon design in Sketch -------------------------------------------Learn how to create your own icons without needing to be an amazing illustrator Tutorial Shapes Try Sketch for free Whether you’re new to Sketch, or back to see what’s new, we’ll have you set up and ready to do your best work in minutes. Get started for free Get started for free Never miss an update Get all the latest news, blog posts and product updates from Sketch, delivered directly to your inbox. We’ll rarely send more than one email a month. Email Sign up I agree to receive marketing emails from Sketch. Product What’s New Design Collaboration Prototyping Developer Handoff All Features View & Mirror on iOS Beta Explore Resources Blog Extensions & Plugins Figma to Sketch Pricing Roadmap Free for Education Newsletter Support Help Center Documentation Community Forum Developer Platform Service Status Manage License Contact Us Company About Us Careers Partners Security Terms & Policies Home © 2025 Sketch B.V. 1024x1024",
      "title": "What is game UI? A complete beginner’s guide to game interface design · Sketch Skip Navigation Menu Sketch Sign In Product Design Collaboration Prototyping Developer Handoff All Features What’s New Sketch in 2024 Smart Animate Easy Library swaps See all updates Explore Blog Resources Extensions & Plugins Courses Sketch 101 Sketch 102 Pricing Support Help Center Documentation Contact Us Community Forum Sign In Get started Download Sign In Product What’s New Design Collaboration Prototyping Developer Handoff All Features Explore Blog Resources Sketch 101 Sketch 102 Extensions & Plugins Support Help Center Documentation Contact Us Community Forum Extra Surprises 🎁 Layout overlay Learn design Inside Sketch What’s new #MadeWithSketch Sketch Categories Learn design Inside Sketch What’s new #MadeWithSketch Most popular tags Prototyping Commenting Templates Libraries Case Study Tutorial Roundup Beginner Intermediate Tips Vector Editing Symbols Mac app Developer Handoff Insight Open Format Overlays Behind the Feature Meet the Maker Blog by Sketch Learn design 12 Sep 2022 What is game UI? A complete beginner’s guide to game interface design Press A to continue Insight Author Gabrielle van Welie Share When we think about video games, animation and character design usually come to mind. But no game is complete — or even usable — without some good ol’ UI design. Yup! There’s a huge space for UI designers in the video game industry, and you’ll soon see why. Ready to go from gamer to budding game interface designer? All you’ll need is this guide and some trusty game UI design software — like Sketch. Choose a save slot to begin. Load/Save screen of Alike Studio’s All of You via Game UI Database. This image is used for educational purposes. Hint: What is game UI? First things first, let’s talk about what game UI is. Simply put, game interface design focuses on creating visual cues that help users follow the intended course of action in any given video game. Think of on-screen instructions like ‘Press X to open’ or a map of your surroundings. Of course, game interface design is a lot more than that — and it’s a space that keeps evolving with new technologies and platforms. For example, designing a game for Xbox, where the player will be using a controller, is very different from designing a mobile game, where it’s all about the touchscreen. We’ll be diving deeper into these concepts in a bit. But first, let’s get a full-picture view of the game design process. Game design melee: When UX meets UI As with most things in design, wherever there’s a UI designer, you’re likely to find their UX counterpart. Here’s what collaboration between these roles usually looks like in video game design: First, the UX designer will map out the player’s journey. They’ll usually create a mockup or wireframe detailing these steps and where each decision can lead the player. A good rule of thumb for UX designers at this stage is to only include the steps and decision points that are absolutely necessary. Next, the UI designer will start creating a semantic language using elements like color, typography, content hierarchy, and shapes to make these steps as intuitive and appealing as possible. The goal is to empower players to make decisions quickly and confidently — except when you want to lead them astray, of course 😉 All throughout, UX and UI designers will work closely with motion graphics designers, who’ll start thinking of ways to animate those cool character selection screens, maps and skill trees we know and love. And while we could spend hours talking about all of the sides to game design, today’s chosen character is ‘Game UI Designer’. So let’s take a look at what their storyline entails. You’ve chosen Game UI Designer Character screen from Atlus’ 13 Sentinels: Aegis Rim via Game UI Database. This image is used for educational purposes. Want to see more examples of great game UI examples? Take a look at Game UI Database — the team there has curated more than 41,000 screenshots from nearly 1,000 games, so you’re sure to find some inspiration. First quest: Understanding interface components in game UI design When it comes to game UI design, there are four types of visual representation: diegetic, non-diegetic, spatial and meta. To become a great game UI designer, you first have to understand what these mean and how you can use them effectively. Let’s break them down. Diegetic: UI elements that can be seen or heard by the character and fit within the story’s context. Examples: a phone with a visible screen, holograms, and other futuristic gadgets. Non-diegetic: UI elements that exist outside of the game or story and that only the player sees. Examples: menu screens, quest windows, and health bars. Spatial: UI elements that are represented within the game space but aren’t visible to the characters. Examples: character outlines indicating who the enemies are, an arrow showing where a thrown object will land, and text labels. Meta: UI elements that are contextual to the game but aren’t represented within the game space. Examples: scrolling text or colored overlays that indicate a change in the player’s health status. Here’s a quick look at how you can differentiate between the four types of visual representation. Second quest: Game UI design in action As we’ve seen, there are quite a lot of video game elements that actually fall under user interface design. UI designers create anything from health bars to character selection and inventory screens. But there’s one place that’s made up almost entirely of UI elements: the HUD, or Heads-up Display. You can think of the HUD as an overlay that houses all sorts of UI elements. It’s where the player will find most of the information they’re looking for as they play the game. To understand this in context, let’s look at this example from Persona 5. A moment in Atlus’ Persona 5 via Game UI Database. This image is used for educational purposes. Here, you can see how the HUD houses the title character’s health and stamina bars in the bottom-right corner, an actions menu surrounding the character, and even some top-right text guides to remind the player of their next move. As this episode of Game Marker’s Toolkit explains, we can categorize most HUD elements as gauges or previews. Gauges, like health bars and maps, help the player understand what is currently happening in the game and what could happen. These UI elements aim to help the player make informed, big-picture decisions. Previews, such as a text layer indicating you should press X to open a door or throwing arcs showing where an item will land, let the player know about the immediate effects of their actions. The goal is to give the player a sense of reassurance about their next move. You can also increase or decrease a game’s difficulty through UI elements. If you think about it, the player receives most hints through the HUD. Often, when choosing between Easy, Normal and Hard modes, you’re actually selecting the amount of HUD tips you’ll see on screen. That, and maybe some increased HP for the bad guys. Third quest: Choosing a game UI design software Alright, so enough with the lessons! Now that we’ve covered some game UI design basics, it’s time to get to work. How and where should we start creating the next chart-topping video game? For a UI designer, it all starts with choosing the right game UI design software. On top of meeting your basic UI design needs like layer lists, styling tools, and vector editing, here are some essential features to look out for: The ability to create a library of reusable elements so that you can store anything from different versions of the same health bar to maps of varying sizes. Imagine all the time you’ll be saving! A prototyping functionality so you can bring your UX designer’s wireframe to life using overlays and preview your UI in action Collaboration options so that you can work together with UX designers and other teammates as you fine-tune your design Proper handoff tools so that it’s easy for your devs to transform your design into a fully functioning video game. Ready to try your hand at game UI design? Sketch can help — and you can get started for free! TL;DR Game UI focuses on creating visual cues that help users follow the intended course of action in any given video game. Those cues can be diegetic, non-diegetic, spatial or meta. The HUD (Heads-up Display) is a powerful overlay that houses a lot of these cues — especially gauges and previews — during gameplay. Game UI designers work closely with UX designers and motion graphics designers. The right game UI design software will have features like prototyping, collaboration, handoff, and reusable elements. And there you have it! We hope you learned a thing or two about game UI design and that you’re feeling ready to try it out for yourself. And if not… maybe we just gave you a bunch of details you won’t be able to unsee next time you play your favorite video game. So, what do you say? Scene from Undertale via Game UI Database. This image is used for educational purposes. Share Useful Links Learn more about UI design Ready to work on some game UI design? To the Mac app! Read about how RareSloth designed their own video game in Sketch About the Author Gabrielle van Welie Content Writer Share You may also like Learn design 11 Nov 2024 Oh no, I need to design a tinted iOS 18 app icon — how to do it right ---------------------------------------------------------------------Tinted app icons in iOS 18 were met with plenty of concerns over visual hierarchy and brand identity. Here are a few tricks we used to make ours look good and feel right at home. Tips Learn design 30 Sep 2024 Prototyping in Sketch: Everything you need to know --------------------------------------------------Learn how to create realistic prototypes with a variety of tools, like Overlays or scroll areas, add movement with Smart Animate and preview them in our iOS app Prototyping Tutorial Intermediate Learn design 26 Oct 2023 A beginner’s guide to icon design in Sketch -------------------------------------------Learn how to create your own icons without needing to be an amazing illustrator Tutorial Shapes Try Sketch for free Whether you’re new to Sketch, or back to see what’s new, we’ll have you set up and ready to do your best work in minutes. Get started for free Get started for free Never miss an update Get all the latest news, blog posts and product updates from Sketch, delivered directly to your inbox. We’ll rarely send more than one email a month. Email Sign up I agree to receive marketing emails from Sketch. Product What’s New Design Collaboration Prototyping Developer Handoff All Features View & Mirror on iOS Beta Explore Resources Blog Extensions & Plugins Figma to Sketch Pricing Roadmap Free for Education Newsletter Support Help Center Documentation Community Forum Developer Platform Service Status Manage License Contact Us Company About Us Careers Partners Security Terms & Policies Home © 2025 Sketch B.V. 1024x1024"
    },
    {
      "url": "https://blizzardwatch.com/2022/03/23/games-ui-change-gameplay/",
      "content": "Published Time: 2022-03-23T08:00:39-05:00 How does a game's UI affect the actual gameplay experience for you? Toggle navigation NEXT | How to unlock the ability to equip your second Legendary in patch 9... Warcraft World of Warcraft WoW Patch 11.0.7 WoW Classic Warcraft Rumble Diablo Diablo News Diablo 2 Diablo 3 Diablo 4 Diablo Immortal Hearthstone Hearthstone News Battlegrounds Tavern Brawls Overwatch Podcasts The Queue Off Topic Other Video Games D&D Tabletop RPG TV & Movies About Community Guidelines Discord Donate Now via Patreon Donate Now via PayPal How To Support Supporter Benefits Who We Are Login with Patreon Discussion > Video Games > WoW > WoW ClassicMar 23, 2022 8:00 am CT How does a game’s UI affect the actual gameplay experience for you? By Matthew Rossi @MatthewWRossi E-mail Tweet Like Pin it One of the things that really makes it hard for me to play WoW Classic is the UI. Not because I’m not familiar with it, but because I’ve been playing WoW for so long and through so many iterations of the UI that I can’t keep it all straight — I look for improvements that don’t exist yet, and in the time since the vanilla game, time I’ve used dozens of mods to change my UI. I can customize it, which means that when I can’t get one for WoW Classic I end up not knowing what to do. It’s strange how dependent I can become to a specific set of UI features, and how the changes to WoW‘s UI over the years have really left me unable to grapple with the game. Which is absurd and is something I’m working to overcome, but I do find myself amazed at how small changes and tweaks to the UI can alter a game. I used to use ElvUI and TukUI fairly frequently, and I to this day prefer raiding with a boss mod that pops up some kind of warning sound rather than forcing me to watch yet another visual element. This isn’t just a WoW thing, either — I really love Cyberpunk 2077 but I hate the game’s built in GPS, which uses a dotted line on a minimap that often ends up too faint to see, leading to enraged cursing when I have to backtrack because I couldn’t make out the proper turn to find the quest I was attempting to go complete. So let me ask you guys — is there a game you love or hate entirely due to its user interface? How does the UI of a game help prevent or facilitate a fun time? How does the UI change the gameplay for you? Blizzard Watch is made possible by people like you. Please consider supporting our Patreon! Filed Under: Ui, User Interface Advertisement Join the Discussion Blizzard Watch is a safe space for all readers. By leaving comments on this site you agree to follow our commenting and community guidelines. Blizzard Watch 100 User(s) Online Join Server About Blizzard Watch | Contact Us | Community Guidelines | Privacy Policy | Advertise With Us We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for us to earn fees by linking to Amazon.com and affiliated sites. Toggle Dark Mode: © 2025 Queuevian Media, LLC. All rights reserved.",
      "title": "Published Time: 2022-03-23T08:00:39-05:00 How does a game's UI affect the actual gameplay experience for you? Toggle navigation NEXT | How to unlock the ability to equip your second Legendary in patch 9... Warcraft World of Warcraft WoW Patch 11.0.7 WoW Classic Warcraft Rumble Diablo Diablo News Diablo 2 Diablo 3 Diablo 4 Diablo Immortal Hearthstone Hearthstone News Battlegrounds Tavern Brawls Overwatch Podcasts The Queue Off Topic Other Video Games D&D Tabletop RPG TV & Movies About Community Guidelines Discord Donate Now via Patreon Donate Now via PayPal How To Support Supporter Benefits Who We Are Login with Patreon Discussion > Video Games > WoW > WoW ClassicMar 23, 2022 8:00 am CT How does a game’s UI affect the actual gameplay experience for you? By Matthew Rossi @MatthewWRossi E-mail Tweet Like Pin it One of the things that really makes it hard for me to play WoW Classic is the UI. Not because I’m not familiar with it, but because I’ve been playing WoW for so long and through so many iterations of the UI that I can’t keep it all straight — I look for improvements that don’t exist yet, and in the time since the vanilla game, time I’ve used dozens of mods to change my UI. I can customize it, which means that when I can’t get one for WoW Classic I end up not knowing what to do. It’s strange how dependent I can become to a specific set of UI features, and how the changes to WoW‘s UI over the years have really left me unable to grapple with the game. Which is absurd and is something I’m working to overcome, but I do find myself amazed at how small changes and tweaks to the UI can alter a game. I used to use ElvUI and TukUI fairly frequently, and I to this day prefer raiding with a boss mod that pops up some kind of warning sound rather than forcing me to watch yet another visual element. This isn’t just a WoW thing, either — I really love Cyberpunk 2077 but I hate the game’s built in GPS, which uses a dotted line on a minimap that often ends up too faint to see, leading to enraged cursing when I have to backtrack because I couldn’t make out the proper turn to find the quest I was attempting to go complete. So let me ask you guys — is there a game you love or hate entirely due to its user interface? How does the UI of a game help prevent or facilitate a fun time? How does the UI change the gameplay for you? Blizzard Watch is made possible by people like you. Please consider supporting our Patreon! Filed Under: Ui, User Interface Advertisement Join the Discussion Blizzard Watch is a safe space for all readers. By leaving comments on this site you agree to follow our commenting and community guidelines. Blizzard Watch 100 User(s) Online Join Server About Blizzard Watch | Contact Us | Community Guidelines | Privacy Policy | Advertise With Us We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for us to earn fees by linking to Amazon.com and affiliated sites. Toggle Dark Mode: © 2025 Queuevian Media, LLC. All rights reserved."
    },
    {
      "url": "https://www.youtube.com/watch?v=f1spX7Qtv7k",
      "content": "Easy Drywall Tricks to Fix Any Mistake Home RenoVision DIY 3480000 subscribers 212796 likes 8777293 views 5 Jul 2020 Today I'm showing you easy drywall tricks to fix ANY mistake! Watch all of my drywall videos here: https://youtube.com/playlist?list=PL34cQkzKfXWbi6XYXmn4dodhusK_i4nZ6 Jeff Favourite Drywall Tools 🇺🇸https://amzlink.to/az0zbw8o6yeIK Jeff's Favourite Drywall Tools 🇨🇦 https://amzlink.to/az0Iq81BuFfM3 Shop Jeff’s favorite tools and great products and help support our next project! ► Shop Wayfair 🇨🇦: http://www.jdoqocy.com/click-9148559-14525657 ► Shop Wayfair 🇺🇸: http://www.jdoqocy.com/click-9148559-14524913 ► Shop Amazon 🇨🇦: https://geni.us/mlVE (Amazon) ► Shop Amazon 🇺🇸: https://www.amazon.com/shop/homerenovisiondiy ► Shop Home Depot: https://homedepot.sjv.io/nBVOX ► For discounts on flooring, paint, hardscapes, soundproofing and more visit our website: https://homerenovisiondiy.com/our-affiliates/ *****Be sure to use the coupon codes before checkout 0:00 - Intro 1:05 - Repairing Holes 5:41 - Inspecting Valves 7:30 - Filling Big Gaps 13:24 - Fixing Blemishes 15:23 - Quick Set Mud 21:49 - Dents 24:10 - The Mess 25:52 - Stucco Ceilings 27:57 - Mud At The End Of The Day Did you know we launched a newsletter? Sign up here: https://homerenovisiondiy.com Need Answers or Advice for your DIY Project? BECOME A DIY MEMBER NOW! Become a DIY Member by clicking the “join” button beside the “subscribe” button - https://www.youtube.com/c/HomeRenoVisionDIY/membership ► Get FULL access to me and my team for Q and A’s in the DIY Crew Forum ► Participate in monthly LIVE streams for live consulting and Member support! 🔨 PRODUCTS MENTIONED 🔨 OLFA Utility Knife https://geni.us/UtilityKnife 3-Pack Drywall Scrapers https://geni.us/DrywallScrapers Plaster Hawk Aluminum Plaster Mortar Board https://geni.us/PlasterMortarBoard Drywall Finishing Trowel https://geni.us/DrywallTrowel Great Stuff Pro Window & Door Insulating Foam https://geni.us/GreatStuffProFoam Great Stuff Pro Dispensing Gun https://geni.us/GreatStuffProGun Kilz Oil-Based Primer https://geni.us/KilzPrimer Sheetrock 45 https://geni.us/Sheetrock45 Drywall Sweeping Compound https://geni.us/SweepingCompound Drywall Laminating Screws https://geni.us/DrywallLaminatingScrew Check out more Drywall videos here: ►Top 40 Drywall Tools | Trade Secrets https://www.youtube.com/watch?v=ok-wK-4g7_U&t=494s ► Before you Start Hanging Drywall You Must Do This! https://www.youtube.com/watch?v=sl-lCpb3He0 ►DIY Drywall Finishing | 18 Tips and Tricks https://www.youtube.com/watch?v=0M60wWmdFRU&t=2s #justdoityourself #drywall #drywallrepair HomeRenoVisionDIY may earn an affiliate commission if you purchase something through recommended links. #commissionsearned WANT TO WATCH MORE VIDEOS?? Watch our most popular videos: ► How to Tile Over Tile https://www.youtube.com/watch?v=XRRYDEa-pDM ►How to Paint Like a Pro https://www.youtube.com/watch?v=2eUxz_or2Qs Watch our most popular playlists: ►Our Latest Videos https://www.youtube.com/playlist?list=PL34cQkzKfXWZr1cbnz0ct4stmfAFbUlbl ► Drywall Masterclass Playlist https://www.youtube.com/watch?v=sl-lCpb3He0&list=PL34cQkzKfXWanlUzNzLhfMK1s7w0Un9gt For instant updates check out the links below and FOLLOW me on social media where you can stay up to date on new episodes and what other nonsense is going on in my life FOLLOW US: ► INSTAGRAM: https://www.instagram.com/homerenovisiondiy/ ► FACEBOOK: https://www.facebook.com/homerenovisiondiy/ ► PINTEREST: https://www.pinterest.com/homerenovisiondiy/ ► TWITTER: https://twitter.com/renodiy Produced by: Home Renovision DIY 2020 Video & Editing Services Provided by: Subdivision Film LTD. https://www.SubdivisionFilms.com Disclaimer: Videos produced by Home Renovision are provided for informational purposes only. All material provided within this website is for informational, educational, & entertainment purposes only. Some of these projects, materials, and techniques may not be appropriate for all ages or skill levels. The DIY instructions used here are used to simply breakdown projects to their simplest steps. Please use a clear mind and use all safety precautions while following the tutorials provided by this site. Home Renovision does not make any claims of the safety of the projects, techniques, or resources listed on this site and will not take responsibility of what you do with the information provided by this site. Viewers must be aware by doing projects on their homes they are doing it at their own risk and Home Renovision cannot be held liable if they cause any damage to their homes. With different codes around the world and constantly changing standards, regulations and rules, it is the sole responsibility of the viewer to educate themselves on their local requirements before undertaking any sort of project. That being said Home Renovision cannot claim liability with all applicable laws, rules, codes and regulations for a project. Be safe, have fun renovating and ALWAYS stay informed with your local building code. 5200 comments today I'm doing a video just for you guys this is gonna be a response video to answer all of the questions I've been getting on our channel about drywall and repairs and home maintenance and I have a simple message to tell you don't worry about it it's just drywall so in today's video I'm gonna show you all the tips and tricks that learn from my past years of working on the construction site now to fix messes like this messes like this gaps and cracks unevenness holes oil paint transition when you put your drywall in backwards how to cover up stucco ceilings and different kinds of scenarios where you've got texture on the roof there is a lot of information out there that can be really simply applied to solve your problems but if you're intimidated with touching your drywall that you're gonna be too creative and do something risky for instance if you want to know if you have a leaking plumbing valve don't be afraid to open a huge hole in the back of the closet take a look it's so easy to replace and repair drywall we're gonna show you all the steps today to take the fear out of been opening up your walls and solving your problems number one if you have a hole and you've got to repair it the easiest way to do it without damaging your house cutting your electrical circuits cutting a hole in your plumbing take your often knife okay you can get on Amazon just follow our link in the description you set it to just a little bit more than 1/2 inch okay and you want to cut the hole wider than the damage because impact damage always is bigger on the back side of the drywall than the front it's kind of like a hollow-point bullet it doesn't look too bad up front but it's not designed to make a big mess on the front right here we go all right and you want to just run a couple of passes until you're all the way through piece of cake because once you've got a square hole it's easy to patch it now if you've seen some of our other videos you've probably seen this already but this is such a great technique it's worth revisiting this is called the California patch and what I'm doing is I'm just eyeballing to cut a piece of drywall a couple inches wider in both directions so that'll cover my hole okay what I'm gonna do line it up take my knife just inside the cut and I'm gonna score the brown paper from the backside it's both sides and we're gonna do the same here and we're gonna try to give ourselves a little bit of room to work with cuz you only want to do this once it's okay if it's a little smaller than the hole break it and then hold them and then peel it from the paper leaving the paper on the front this makes the perfect patch one of the most amazing benefits is at the white paper on the front of the drywall is thinner than the drywall tape that you would buyer to patch it with so it actually creates a lot less work when you go to finish you're gonna take your drywall compound and you can buy this in a variety of different ways if you're a homeowner you're just doing one repair you can get in a little tub if you're gonna buy just a little bit I would recommend buying the powder by the 45 or the 90 mix up for yourself because then you'll always have it on hand you get real good value it's only ten bucks for a huge bag and the other stuff that you buy in the little tubs generally is really difficult to sand it's gonna drive you crazy now you take a little bit of mud and the idea here is to leave it on the inside of that framing that of the cut okay doesn't work too well in the top ever but here we go here we go alright and then all the way around take it and we're gonna put a little bit on the inside edges of all the rope as well and we're just gonna press it in if you find it not going in all the way maybe there's a little bit of restriction just use your knife to level off the corners and then press the tape in you're just embedding the drywall tape and you want to do this just once okay if you work it too much it's gonna wrinkle because of the moisture and it'll cause you all kinds of pain so get it in wipe off the extra mud and walk away after that's dry you can come back and do another coat and it should be done with a four by ten knife like this alright and I know it's not dry yet so bear with me okay and use outward pressure on the top pull it nice and tight and then come through the middle at the end all right if you let it dry between coats sometimes a second application with this knife is all you're gonna need so you don't have to do it over and over and over again you don't have to sand it between coats just let it set up less is more pull it tight and flat and you'll be happy every single time the second situation I see a lot of people commenting about is they need to check their and do an inspection on their valve or they want to change the valve from the backside if you want to do an inspection anywhere in your house let's say there's sharkbite valves and maybe you think might be dripping or something like that you can buy one of these spring-loaded trap door okay they work great and the idea is the hole that you have on the wall needs to be as big as this framework here plus some distance for this to tie in and put some compression on so what I generally try to do this isn't 8x8 but I'll try to cut the hole so that it's about that big nice and square so here we go not I'm not big enough here and you can use a drywall saw for this and you can cut the hole bigger than you need okay [Music] it only cost six bucks and all we do to set this in is put pressure on the single tab first because it will slide and you push it over and you rest this in and it's snaps back in place now if this is down on the wall by the toilet or if this is in the ceiling of your basement or if this is in the closet on the back wall nobody cares you can put these in all day long you can even paint them the same color as the wall or the ceiling it's very standard you can also use the same trapdoor in the ceiling in the basement for shutoff valves and pipes in different situations or clean outs for your sink island whatever have you so don't be intimidated if you need to have access to the area behind drywall cut a hole stick in a cover because it's that easy to take off and it looks just pretty good the next the next trick I'm going to show you is actually it answers a few different questions what do I do to fill big gaps what about if I'm going from a new wall to an old wall and there's lots of damage or it's lath and plaster and there's lots of damage okay or if the old wall is a different thickness these situations are all taken care of if you own one of these guns having a foam gun gives you lots of control I'm going to just get this started here here we go turn the trigger really low and you can feel just about any gap or crack exactly the amount of foam that you're going to need now if it's really nasty you can overfill it it doesn't matter because what this does this sets up in about 15 or 20 minutes okay and you might find that this is a great alternative to using 45-minute drywall compound all right if you already have this tool it's really handy it does a great job and it becomes the backing remember we're just adding mud and the surface this becomes the backing it also is an adhesive between the different material so you don't get cracks you don't need to apply any paper that's amazing so one of the questions I get is a lot of people their first time renovators they've done all the installation they're down to their last piece of drywall it's not quite big enough to fit or you've got a big gap in the ceiling because you're in an old house like mine and the ceiling has a bit of a ball to it and you can't install everything square and level so again take about the foam open it up pretty healthy shoot it at the corner so it has something to hit and it'll expand in and out of that corner and don't worry about how much of a mess it makes remember the goal here is that when that's done drying its expanded in behind got solid so you can trim off the face and have a backing to do your taping now we're gonna go up to the top of the ceiling where I did this yesterday and I'll show you how it looks so the secret here is we're trading backing right so open up your blade so I this tough to boat where do you think the depth is all right and we've been sawing action and then just gently trim it across there okay and then you can clean it up nice and tight all right now I'm only gonna demonstrate just a little bit less I'll go right into the corners I actually do need this to be finished today okay I'm happy with that it's not looks pretty nasty but it's ready to be worked with so I'm just gonna tape out the joint here a little bit real quick now when you've got a scenario like this I've actually got about an inch gap from where the drywall finished till the ceiling and the ceiling doesn't make it all the way into the corner it's a nasty mess and I made it a nasty mess on purpose to show you how easy it is to fix there we go run your mud off the side of this knife here no this foam does not react to the compound this isn't gonna melt it or affect it at all okay yeah got to keep the dirt out of your mud yeah I'm just gonna go what I call flat taping flat taping flat taping is the process of just going on one surface I'm not going around the corner and you can push that up as nice tight as you want okay and then we'll press it in now that we've got that pressed in you don't have to wait till tomorrow to come back to fix it here's one other trick when you're taping with much you can do multiple layers of mud and paper it's okay you can sandwich it as long as you give it time to dry before you come back the next time to fiddle around with it okay try to keep your mud in the middle of your hock the whole time you're working all right now we're gonna apply them under the ceiling catch your drips try to work as clean as possible okay there we go and then again off the side of the knife we're gonna snowplow it right in there okay just pretend that that paper and bud there it wasn't a tear of previously and I measure off a piece of tape gonna get a nice straight edge pre fold it there we go we have a nice flat surface up top so I'm gonna use that to trust my line gentle pressure all the way across okay painting the edge one more pass that's good now hold the knife flat against the wall cuz if you are ain't too loosey-goosey with it you'll just push everything in and make a mess there we go IMAX zoom in there and tell me if that corner doesn't look perfect now if you want to save even more time and you're comfortable with using your knife you can go back over top and you can apply the inside corner of the forage application right over that paper tape alright and then the next time you come back all you'll need to do is a six inch knife just to make sure that it's perfectly smooth and feathered oh all right done it's not that tricky anybody can do this the next issue you're gonna run into is I get questions like this all the time hey I got a rusty nail or a rusty staple or residue from tape or oops I was doing a weird angle and I installed the drywall backwards and I see the brown paper can i tape over that and the answer is yes of course but you have to prep it first you need to use a Primus so here we go I've got tape let's get this out of here okay well the tapes gone but I still got that red stuff left got broke a poor showing I've got dark pencil I don't care even if it's marker there is one solution for all your problems and if you're taping your house you've got to have this can on you at all times pom pom yeah if you're a fan of the channel you've seen me use it before I put this on everything okay brown paper no problem oil-based primer red tape no problem oil-based primer marker no problem oil-based primer with the pigment look at that this just disappearing I'm doing an infomercial here oil-based primer works on everything let's say you have an old house with laughs and plaster and oil paint kills you can buy it in a can and roll it on the wall they even have an odorless formula of an oil primer just for transitioning from oil to latex so that you don't have your paint peeling off over time if you're ever stuck and you were in trouble and you don't know how to solve a problem think oil-based primer and then all of your new muds and compounds will bond to it if you use oil-based primer over plaster new drywall compound will bond to that so you don't have to go to the buy plaster and mix it up yourself saves a lot of time and money this is money in the bank and before anybody starts putting it in the comment section no kills did not sponsor this video I just love the stuff okay let's move on I don't need the tape here anymore now we're gonna get away from the traditional drywall compound we're gonna get into the quick-set mud we're gonna show you everything that it can do here's another one of the most popular questions out there I can't find sheetrock for five anywhere what do I get this is a CGC company that means Canadian gypsum corporation trade from the United States you're gonna find a u.s. G which is United States gypsum okay they make a forty five mix as well this is not proprietary technology all right it's really basic stuff so 45 here is 45 there it's the same stuff just a different supplier we have border issues right so okay I'll just get along all right then what we're gonna do with the powder of course and a lot of you might have seen this alright so we're gonna just do a quick short version of this we're gonna make a lot of volcano on the hawk and I don't know sometimes it's easier to move the hawk than the knife all right volcano time here we go the higher the walls the easier it is to control everything okay now I'm using hot water if you want your coat 45 minute mud to set super fast so you can keep on working use hot water throw a little salt in it right this is a chemical reaction we're dealing with now so basic science grade eight heat plus salt changes all the chemical reactions and speeds things up so we're gonna go add my hot water Oh making a mess this is not the way the demonstrations supposed to work better close that up got a dam up the hole alright got it to do to do I'm gonna sprinkle it in of course and try not to have another dam break on us but it happens here we go doesn't have to go over the top sometimes it start leaking from underneath if you want to you can go with a little bit less water until you know you've got it under control but I found with this hot water and you've really just got to be able to move and manage the mess and it's worth paying for here we go ready now we're gonna go for it we're gonna go making a mess that's okay construction site yeah that's okay we're not gonna worry about it because this reaction happens so fast that if I don't move and get it done by the time I'm done fiddling around it'll ought to be red rock hard try to mix it somewhat smooth this is a race against time here we go and it's already turning into a hard pace now just for fun we're gonna come back after this brief brief word from our sponsors we don't have a sponsor or am I talking about I'm just saying it's not yet yeah I know it's gonna happen that quick give it about 60 seconds okay so now we're back we have only been a couple minutes and to be honest it's not completely hard but it is setup okay it's stiff enough that I can work with and I'm just gonna cover this now with my regular compound and it won't end up blending together and peeling out of the hole and when this is dry it's not gonna shrink or expand or do anything crazy like that on you you can do all this at the same time all right I mean is this mud my goodness it's a little loosey-goosey what I'm gonna do is I'm gonna put paper tape majority on the old wall all right and I'm pressing it on the original hard surface and now I'm just gonna set it into the soft with a little bit of pressure and then I'll watch the mud just rising away from the tape and that's how I know that I've embedded it I don't have a ridge from the mud I haven't embedded it and it will bubble there we go you remember earlier we talked about that we can use expansion foam and it bridges the gap and it seals it together so you don't need the paper tape you should use the tape anyway if you're using the 45 you have to use the tape all right again we're just gonna come down and set this up with a nice new layer mud and we're gonna embed it on the surface here now nice force here on the original drywall okay and what we're trying to do is eliminate the action of having too much blood stuck in behind the basement we don't want to raise the surface off too much now we're going to just press those two pieces of paper together that are floating over that mud in the middle okay look at that it used to be a nasty mess is now really well embedded together and if you see any areas where the paper tape looks like it's coming apart just get your knife in there put a little mud follow it up make sure the surface is nice and wet so that it doesn't bubble so okay while you're working you can always use the pail as a table okay so we're getting close to the end of all of the questions I've still got one two I got three more things to show you but before I do my floor is creaky I've got to screw that down oh yeah let me just address this one issue if you have dents remember drywall is just dust compressed between papers so if you have a dent if it's dented on the surface it's also dented on the backside it doesn't get compressed it gets moved and that's fine because dents can be adjusted simply like that you don't even think twice about them just fill them and go unless they're big enough that they've actually broken through the backside my rule is this if it's not bigger than one and a half inches it's not concerned about all right you don't need tape you don't have to fuss with it just fill it and you'll be fine now getting back to this all right once this is filled you got to treat this like a butt joint you want to fill this side and then you want to fill this side okay and by Phil meaning pressure on the outside here and pressure on the outside here I think it'd take a little bit of mud and run it right down the middle with a fair amount of pressure and here's a secret will be even it be don't touch it again let that's right completely what we've done now is we've set the depth of the wall to this point this Ridge simply means that I have to fill a little bit here and a little bit here to get this nice and smooth this Ridge actually becomes your guide line now tomorrow when it's dry I can come back and I can use my four inch knife just scrape off that Ridge all right and I'll start in the middle with a thin coat and I'll be using pressure going the outside if you want to know how to actually finish a butt joint properly you can click the link to this video here we've done some information on this series previously and it'll go through all of you how to fill corners and do it all that sort of thing when to use the 45 minute mud versus the other it's a great video I think you're gonna like it and one other thing I'm not going to cover today is nail pops we've got a great video on nail pops we call them nail pops if it's a nail or a screw so don't get offended if you have one or the other it's all the same business and it's all dealt with in the same manner if it's a nail hammered in a little bit if it's a screw you screw it in a little bit but follow all that information in the card up in the corner okay yeah let's get on to the next two things that are going to be life savers on your job site so the next thing that people get intimidated about dealing with drywall is the mess and rightly so because drywall dust is actually lighter than air it seems right it goes everywhere there are two things you can do to manage your mess well actually three one you can clean as you go resist the temptation to sweep unless you but this this is what we call drywall sweeping compound all right and there are a couple of different companies that make this stuff one of them makes it green one of them makes it red I buy this stuff because it's available on my local Home Depot and the truth is I've been shopping Home Depot forever because Raya grew up we didn't have options it was Home Depot or no Depot so I'm just really used to their store and products what you do is you just sprinkle it just like as if you're raking your grass right you throw it up against the wall and this step is formulated it instantly bonds with that light drywall compound okay and it will bond to it and then you can sweep so it doesn't go up in the air all right if I sweep compound regular you see all the dust floating around did you see it if I sweep it with the red dust you're not kicking anything up in the air all right that whole bag will last the entire job so 15 20 bucks whatever it is to not be kicking that dust up brilliant invention the other thing you can do is you're gonna open your window and you can shove a fan in it okay the best defense you have against dust in your house - putting a fan in your window like this you can get these at home table for 40 bucks and they blow a ton of air that's what I do without a doubt the most intimidating project in everybody's house is the stucco ceilings everybody's worried about and we get comments every day how do I deal with my stipple ceiling what if I have asbestos should I remove it should I take it down should I go over top should I skim coat it dear Lord no skim coating that ceiling will take you more time to energy and money than doing this take your piece of drywall get yourself a lift or a couple friends okay throw some mud on it and the thicker the texture the more mud you're gonna want to have I'm just doing a quick demonstration so I think for purpose of demonstration I'm gonna cut this down to size you're gonna want to use these to install these are called drywall laminating screws and it's just like it sounds it's for sticking one sheet of drywall into another sheet of drywall when you have no idea where the framework is here's our worse you take your sheet with your compound okay you stick it under your ceiling yeah that easy and you throw these in all right now these screws will not tighten up and be pretty okay what they will do is they'll hold that sheet in place until the drywall compound dries then the next day you come back you guess it um removed the screws tape your joints fill your little holes you can put in one of these screws every couple of feet it's not necessary to put a ton of them in just make sure you're holding it in place till it's dry and you can put a brand new ceiling over top of any textured ceiling in just a couple of hours no mess no worry about asbestos mwah perfect every time and if you want to know how good that drywall mud holds trust me when I say it's not going anywhere it creates like a vacuum so here is my secret for what to do with my mud at the end of the day you've already mixed it in a pail clean down the sides okay and if you like you can even use a sponge the closer you get to the bottom the more you're going to want to have a sponge clean all the mud off okay you know nothing's perfect in this world this mud has been exposed to the air the whole time you're working and drying it you're going to put your hock on top of it as a lid and it's going to dry out a little bit more so what you do just put a layer of water on there here's your lid there's your tools okay and you're good to go the next day now the next day when you get here you don't have crusty dry mud on the pail so when you're taking your compound on you're not gonna have those hard chunks in the mud which will wreck your finish this is how you protect it so it's silky smooth all the time soapy smooth like Zohan now one of the questions we get all the time is should I buy the small tubs no I always buy it buy a big box or big pail it's not a lot of money and if you don't use it all it'll only last three or four weeks after you've opened it up and started using it okay it's not a big deal you can make your own compound and put it in a pail and store it like this in the last three weeks bottom line is you want to make sure that your mud is in perfect condition for doing the job now listen guys we've got other great drywall videos that help you with a lot of your other questions we put a playlist together you can click the link over here and if you learn anything today make sure you hit the like button okay help support our channel by promoting our channel by hitting that button we'd appreciate it don't forget to subscribe if you haven't and if you're interested in what's in behind that plastic wall over there then go into the video description click the link for reality Renta vision it's our other channel you're going to love it it's got all the project videos that we're putting up from this farmhouse renovation we'll see you next",
      "title": "Easy Drywall Tricks to Fix Any Mistake Home RenoVision DIY 3480000 subscribers 212796 likes 8777293 views 5 Jul 2020 Today I'm showing you easy drywall tricks to fix ANY mistake! Watch all of my drywall videos here: https://youtube.com/playlist?list=PL34cQkzKfXWbi6XYXmn4dodhusK_i4nZ6 Jeff Favourite Drywall Tools 🇺🇸https://amzlink.to/az0zbw8o6yeIK Jeff's Favourite Drywall Tools 🇨🇦 https://amzlink.to/az0Iq81BuFfM3 Shop Jeff’s favorite tools and great products and help support our next project! ► Shop Wayfair 🇨🇦: http://www.jdoqocy.com/click-9148559-14525657 ► Shop Wayfair 🇺🇸: http://www.jdoqocy.com/click-9148559-14524913 ► Shop Amazon 🇨🇦: https://geni.us/mlVE (Amazon) ► Shop Amazon 🇺🇸: https://www.amazon.com/shop/homerenovisiondiy ► Shop Home Depot: https://homedepot.sjv.io/nBVOX ► For discounts on flooring, paint, hardscapes, soundproofing and more visit our website: https://homerenovisiondiy.com/our-affiliates/ *****Be sure to use the coupon codes before checkout 0:00 - Intro 1:05 - Repairing Holes 5:41 - Inspecting Valves 7:30 - Filling Big Gaps 13:24 - Fixing Blemishes 15:23 - Quick Set Mud 21:49 - Dents 24:10 - The Mess 25:52 - Stucco Ceilings 27:57 - Mud At The End Of The Day Did you know we launched a newsletter? Sign up here: https://homerenovisiondiy.com Need Answers or Advice for your DIY Project? BECOME A DIY MEMBER NOW! Become a DIY Member by clicking the “join” button beside the “subscribe” button - https://www.youtube.com/c/HomeRenoVisionDIY/membership ► Get FULL access to me and my team for Q and A’s in the DIY Crew Forum ► Participate in monthly LIVE streams for live consulting and Member support! 🔨 PRODUCTS MENTIONED 🔨 OLFA Utility Knife https://geni.us/UtilityKnife 3-Pack Drywall Scrapers https://geni.us/DrywallScrapers Plaster Hawk Aluminum Plaster Mortar Board https://geni.us/PlasterMortarBoard Drywall Finishing Trowel https://geni.us/DrywallTrowel Great Stuff Pro Window & Door Insulating Foam https://geni.us/GreatStuffProFoam Great Stuff Pro Dispensing Gun https://geni.us/GreatStuffProGun Kilz Oil-Based Primer https://geni.us/KilzPrimer Sheetrock 45 https://geni.us/Sheetrock45 Drywall Sweeping Compound https://geni.us/SweepingCompound Drywall Laminating Screws https://geni.us/DrywallLaminatingScrew Check out more Drywall videos here: ►Top 40 Drywall Tools | Trade Secrets https://www.youtube.com/watch?v=ok-wK-4g7_U&t=494s ► Before you Start Hanging Drywall You Must Do This! https://www.youtube.com/watch?v=sl-lCpb3He0 ►DIY Drywall Finishing | 18 Tips and Tricks https://www.youtube.com/watch?v=0M60wWmdFRU&t=2s #justdoityourself #drywall #drywallrepair HomeRenoVisionDIY may earn an affiliate commission if you purchase something through recommended links. #commissionsearned WANT TO WATCH MORE VIDEOS?? Watch our most popular videos: ► How to Tile Over Tile https://www.youtube.com/watch?v=XRRYDEa-pDM ►How to Paint Like a Pro https://www.youtube.com/watch?v=2eUxz_or2Qs Watch our most popular playlists: ►Our Latest Videos https://www.youtube.com/playlist?list=PL34cQkzKfXWZr1cbnz0ct4stmfAFbUlbl ► Drywall Masterclass Playlist https://www.youtube.com/watch?v=sl-lCpb3He0&list=PL34cQkzKfXWanlUzNzLhfMK1s7w0Un9gt For instant updates check out the links below and FOLLOW me on social media where you can stay up to date on new episodes and what other nonsense is going on in my life FOLLOW US: ► INSTAGRAM: https://www.instagram.com/homerenovisiondiy/ ► FACEBOOK: https://www.facebook.com/homerenovisiondiy/ ► PINTEREST: https://www.pinterest.com/homerenovisiondiy/ ► TWITTER: https://twitter.com/renodiy Produced by: Home Renovision DIY 2020 Video & Editing Services Provided by: Subdivision Film LTD. https://www.SubdivisionFilms.com Disclaimer: Videos produced by Home Renovision are provided for informational purposes only. All material provided within this website is for informational, educational, & entertainment purposes only. Some of these projects, materials, and techniques may not be appropriate for all ages or skill levels. The DIY instructions used here are used to simply breakdown projects to their simplest steps. Please use a clear mind and use all safety precautions while following the tutorials provided by this site. Home Renovision does not make any claims of the safety of the projects, techniques, or resources listed on this site and will not take responsibility of what you do with the information provided by this site. Viewers must be aware by doing projects on their homes they are doing it at their own risk and Home Renovision cannot be held liable if they cause any damage to their homes. With different codes around the world and constantly changing standards, regulations and rules, it is the sole responsibility of the viewer to educate themselves on their local requirements before undertaking any sort of project. That being said Home Renovision cannot claim liability with all applicable laws, rules, codes and regulations for a project. Be safe, have fun renovating and ALWAYS stay informed with your local building code. 5200 comments today I'm doing a video just for you guys this is gonna be a response video to answer all of the questions I've been getting on our channel about drywall and repairs and home maintenance and I have a simple message to tell you don't worry about it it's just drywall so in today's video I'm gonna show you all the tips and tricks that learn from my past years of working on the construction site now to fix messes like this messes like this gaps and cracks unevenness holes oil paint transition when you put your drywall in backwards how to cover up stucco ceilings and different kinds of scenarios where you've got texture on the roof there is a lot of information out there that can be really simply applied to solve your problems but if you're intimidated with touching your drywall that you're gonna be too creative and do something risky for instance if you want to know if you have a leaking plumbing valve don't be afraid to open a huge hole in the back of the closet take a look it's so easy to replace and repair drywall we're gonna show you all the steps today to take the fear out of been opening up your walls and solving your problems number one if you have a hole and you've got to repair it the easiest way to do it without damaging your house cutting your electrical circuits cutting a hole in your plumbing take your often knife okay you can get on Amazon just follow our link in the description you set it to just a little bit more than 1/2 inch okay and you want to cut the hole wider than the damage because impact damage always is bigger on the back side of the drywall than the front it's kind of like a hollow-point bullet it doesn't look too bad up front but it's not designed to make a big mess on the front right here we go all right and you want to just run a couple of passes until you're all the way through piece of cake because once you've got a square hole it's easy to patch it now if you've seen some of our other videos you've probably seen this already but this is such a great technique it's worth revisiting this is called the California patch and what I'm doing is I'm just eyeballing to cut a piece of drywall a couple inches wider in both directions so that'll cover my hole okay what I'm gonna do line it up take my knife just inside the cut and I'm gonna score the brown paper from the backside it's both sides and we're gonna do the same here and we're gonna try to give ourselves a little bit of room to work with cuz you only want to do this once it's okay if it's a little smaller than the hole break it and then hold them and then peel it from the paper leaving the paper on the front this makes the perfect patch one of the most amazing benefits is at the white paper on the front of the drywall is thinner than the drywall tape that you would buyer to patch it with so it actually creates a lot less work when you go to finish you're gonna take your drywall compound and you can buy this in a variety of different ways if you're a homeowner you're just doing one repair you can get in a little tub if you're gonna buy just a little bit I would recommend buying the powder by the 45 or the 90 mix up for yourself because then you'll always have it on hand you get real good value it's only ten bucks for a huge bag and the other stuff that you buy in the little tubs generally is really difficult to sand it's gonna drive you crazy now you take a little bit of mud and the idea here is to leave it on the inside of that framing that of the cut okay doesn't work too well in the top ever but here we go here we go alright and then all the way around take it and we're gonna put a little bit on the inside edges of all the rope as well and we're just gonna press it in if you find it not going in all the way maybe there's a little bit of restriction just use your knife to level off the corners and then press the tape in you're just embedding the drywall tape and you want to do this just once okay if you work it too much it's gonna wrinkle because of the moisture and it'll cause you all kinds of pain so get it in wipe off the extra mud and walk away after that's dry you can come back and do another coat and it should be done with a four by ten knife like this alright and I know it's not dry yet so bear with me okay and use outward pressure on the top pull it nice and tight and then come through the middle at the end all right if you let it dry between coats sometimes a second application with this knife is all you're gonna need so you don't have to do it over and over and over again you don't have to sand it between coats just let it set up less is more pull it tight and flat and you'll be happy every single time the second situation I see a lot of people commenting about is they need to check their and do an inspection on their valve or they want to change the valve from the backside if you want to do an inspection anywhere in your house let's say there's sharkbite valves and maybe you think might be dripping or something like that you can buy one of these spring-loaded trap door okay they work great and the idea is the hole that you have on the wall needs to be as big as this framework here plus some distance for this to tie in and put some compression on so what I generally try to do this isn't 8x8 but I'll try to cut the hole so that it's about that big nice and square so here we go not I'm not big enough here and you can use a drywall saw for this and you can cut the hole bigger than you need okay [Music] it only cost six bucks and all we do to set this in is put pressure on the single tab first because it will slide and you push it over and you rest this in and it's snaps back in place now if this is down on the wall by the toilet or if this is in the ceiling of your basement or if this is in the closet on the back wall nobody cares you can put these in all day long you can even paint them the same color as the wall or the ceiling it's very standard you can also use the same trapdoor in the ceiling in the basement for shutoff valves and pipes in different situations or clean outs for your sink island whatever have you so don't be intimidated if you need to have access to the area behind drywall cut a hole stick in a cover because it's that easy to take off and it looks just pretty good the next the next trick I'm going to show you is actually it answers a few different questions what do I do to fill big gaps what about if I'm going from a new wall to an old wall and there's lots of damage or it's lath and plaster and there's lots of damage okay or if the old wall is a different thickness these situations are all taken care of if you own one of these guns having a foam gun gives you lots of control I'm going to just get this started here here we go turn the trigger really low and you can feel just about any gap or crack exactly the amount of foam that you're going to need now if it's really nasty you can overfill it it doesn't matter because what this does this sets up in about 15 or 20 minutes okay and you might find that this is a great alternative to using 45-minute drywall compound all right if you already have this tool it's really handy it does a great job and it becomes the backing remember we're just adding mud and the surface this becomes the backing it also is an adhesive between the different material so you don't get cracks you don't need to apply any paper that's amazing so one of the questions I get is a lot of people their first time renovators they've done all the installation they're down to their last piece of drywall it's not quite big enough to fit or you've got a big gap in the ceiling because you're in an old house like mine and the ceiling has a bit of a ball to it and you can't install everything square and level so again take about the foam open it up pretty healthy shoot it at the corner so it has something to hit and it'll expand in and out of that corner and don't worry about how much of a mess it makes remember the goal here is that when that's done drying its expanded in behind got solid so you can trim off the face and have a backing to do your taping now we're gonna go up to the top of the ceiling where I did this yesterday and I'll show you how it looks so the secret here is we're trading backing right so open up your blade so I this tough to boat where do you think the depth is all right and we've been sawing action and then just gently trim it across there okay and then you can clean it up nice and tight all right now I'm only gonna demonstrate just a little bit less I'll go right into the corners I actually do need this to be finished today okay I'm happy with that it's not looks pretty nasty but it's ready to be worked with so I'm just gonna tape out the joint here a little bit real quick now when you've got a scenario like this I've actually got about an inch gap from where the drywall finished till the ceiling and the ceiling doesn't make it all the way into the corner it's a nasty mess and I made it a nasty mess on purpose to show you how easy it is to fix there we go run your mud off the side of this knife here no this foam does not react to the compound this isn't gonna melt it or affect it at all okay yeah got to keep the dirt out of your mud yeah I'm just gonna go what I call flat taping flat taping flat taping is the process of just going on one surface I'm not going around the corner and you can push that up as nice tight as you want okay and then we'll press it in now that we've got that pressed in you don't have to wait till tomorrow to come back to fix it here's one other trick when you're taping with much you can do multiple layers of mud and paper it's okay you can sandwich it as long as you give it time to dry before you come back the next time to fiddle around with it okay try to keep your mud in the middle of your hock the whole time you're working all right now we're gonna apply them under the ceiling catch your drips try to work as clean as possible okay there we go and then again off the side of the knife we're gonna snowplow it right in there okay just pretend that that paper and bud there it wasn't a tear of previously and I measure off a piece of tape gonna get a nice straight edge pre fold it there we go we have a nice flat surface up top so I'm gonna use that to trust my line gentle pressure all the way across okay painting the edge one more pass that's good now hold the knife flat against the wall cuz if you are ain't too loosey-goosey with it you'll just push everything in and make a mess there we go IMAX zoom in there and tell me if that corner doesn't look perfect now if you want to save even more time and you're comfortable with using your knife you can go back over top and you can apply the inside corner of the forage application right over that paper tape alright and then the next time you come back all you'll need to do is a six inch knife just to make sure that it's perfectly smooth and feathered oh all right done it's not that tricky anybody can do this the next issue you're gonna run into is I get questions like this all the time hey I got a rusty nail or a rusty staple or residue from tape or oops I was doing a weird angle and I installed the drywall backwards and I see the brown paper can i tape over that and the answer is yes of course but you have to prep it first you need to use a Primus so here we go I've got tape let's get this out of here okay well the tapes gone but I still got that red stuff left got broke a poor showing I've got dark pencil I don't care even if it's marker there is one solution for all your problems and if you're taping your house you've got to have this can on you at all times pom pom yeah if you're a fan of the channel you've seen me use it before I put this on everything okay brown paper no problem oil-based primer red tape no problem oil-based primer marker no problem oil-based primer with the pigment look at that this just disappearing I'm doing an infomercial here oil-based primer works on everything let's say you have an old house with laughs and plaster and oil paint kills you can buy it in a can and roll it on the wall they even have an odorless formula of an oil primer just for transitioning from oil to latex so that you don't have your paint peeling off over time if you're ever stuck and you were in trouble and you don't know how to solve a problem think oil-based primer and then all of your new muds and compounds will bond to it if you use oil-based primer over plaster new drywall compound will bond to that so you don't have to go to the buy plaster and mix it up yourself saves a lot of time and money this is money in the bank and before anybody starts putting it in the comment section no kills did not sponsor this video I just love the stuff okay let's move on I don't need the tape here anymore now we're gonna get away from the traditional drywall compound we're gonna get into the quick-set mud we're gonna show you everything that it can do here's another one of the most popular questions out there I can't find sheetrock for five anywhere what do I get this is a CGC company that means Canadian gypsum corporation trade from the United States you're gonna find a u.s. G which is United States gypsum okay they make a forty five mix as well this is not proprietary technology all right it's really basic stuff so 45 here is 45 there it's the same stuff just a different supplier we have border issues right so okay I'll just get along all right then what we're gonna do with the powder of course and a lot of you might have seen this alright so we're gonna just do a quick short version of this we're gonna make a lot of volcano on the hawk and I don't know sometimes it's easier to move the hawk than the knife all right volcano time here we go the higher the walls the easier it is to control everything okay now I'm using hot water if you want your coat 45 minute mud to set super fast so you can keep on working use hot water throw a little salt in it right this is a chemical reaction we're dealing with now so basic science grade eight heat plus salt changes all the chemical reactions and speeds things up so we're gonna go add my hot water Oh making a mess this is not the way the demonstrations supposed to work better close that up got a dam up the hole alright got it to do to do I'm gonna sprinkle it in of course and try not to have another dam break on us but it happens here we go doesn't have to go over the top sometimes it start leaking from underneath if you want to you can go with a little bit less water until you know you've got it under control but I found with this hot water and you've really just got to be able to move and manage the mess and it's worth paying for here we go ready now we're gonna go for it we're gonna go making a mess that's okay construction site yeah that's okay we're not gonna worry about it because this reaction happens so fast that if I don't move and get it done by the time I'm done fiddling around it'll ought to be red rock hard try to mix it somewhat smooth this is a race against time here we go and it's already turning into a hard pace now just for fun we're gonna come back after this brief brief word from our sponsors we don't have a sponsor or am I talking about I'm just saying it's not yet yeah I know it's gonna happen that quick give it about 60 seconds okay so now we're back we have only been a couple minutes and to be honest it's not completely hard but it is setup okay it's stiff enough that I can work with and I'm just gonna cover this now with my regular compound and it won't end up blending together and peeling out of the hole and when this is dry it's not gonna shrink or expand or do anything crazy like that on you you can do all this at the same time all right I mean is this mud my goodness it's a little loosey-goosey what I'm gonna do is I'm gonna put paper tape majority on the old wall all right and I'm pressing it on the original hard surface and now I'm just gonna set it into the soft with a little bit of pressure and then I'll watch the mud just rising away from the tape and that's how I know that I've embedded it I don't have a ridge from the mud I haven't embedded it and it will bubble there we go you remember earlier we talked about that we can use expansion foam and it bridges the gap and it seals it together so you don't need the paper tape you should use the tape anyway if you're using the 45 you have to use the tape all right again we're just gonna come down and set this up with a nice new layer mud and we're gonna embed it on the surface here now nice force here on the original drywall okay and what we're trying to do is eliminate the action of having too much blood stuck in behind the basement we don't want to raise the surface off too much now we're going to just press those two pieces of paper together that are floating over that mud in the middle okay look at that it used to be a nasty mess is now really well embedded together and if you see any areas where the paper tape looks like it's coming apart just get your knife in there put a little mud follow it up make sure the surface is nice and wet so that it doesn't bubble so okay while you're working you can always use the pail as a table okay so we're getting close to the end of all of the questions I've still got one two I got three more things to show you but before I do my floor is creaky I've got to screw that down oh yeah let me just address this one issue if you have dents remember drywall is just dust compressed between papers so if you have a dent if it's dented on the surface it's also dented on the backside it doesn't get compressed it gets moved and that's fine because dents can be adjusted simply like that you don't even think twice about them just fill them and go unless they're big enough that they've actually broken through the backside my rule is this if it's not bigger than one and a half inches it's not concerned about all right you don't need tape you don't have to fuss with it just fill it and you'll be fine now getting back to this all right once this is filled you got to treat this like a butt joint you want to fill this side and then you want to fill this side okay and by Phil meaning pressure on the outside here and pressure on the outside here I think it'd take a little bit of mud and run it right down the middle with a fair amount of pressure and here's a secret will be even it be don't touch it again let that's right completely what we've done now is we've set the depth of the wall to this point this Ridge simply means that I have to fill a little bit here and a little bit here to get this nice and smooth this Ridge actually becomes your guide line now tomorrow when it's dry I can come back and I can use my four inch knife just scrape off that Ridge all right and I'll start in the middle with a thin coat and I'll be using pressure going the outside if you want to know how to actually finish a butt joint properly you can click the link to this video here we've done some information on this series previously and it'll go through all of you how to fill corners and do it all that sort of thing when to use the 45 minute mud versus the other it's a great video I think you're gonna like it and one other thing I'm not going to cover today is nail pops we've got a great video on nail pops we call them nail pops if it's a nail or a screw so don't get offended if you have one or the other it's all the same business and it's all dealt with in the same manner if it's a nail hammered in a little bit if it's a screw you screw it in a little bit but follow all that information in the card up in the corner okay yeah let's get on to the next two things that are going to be life savers on your job site so the next thing that people get intimidated about dealing with drywall is the mess and rightly so because drywall dust is actually lighter than air it seems right it goes everywhere there are two things you can do to manage your mess well actually three one you can clean as you go resist the temptation to sweep unless you but this this is what we call drywall sweeping compound all right and there are a couple of different companies that make this stuff one of them makes it green one of them makes it red I buy this stuff because it's available on my local Home Depot and the truth is I've been shopping Home Depot forever because Raya grew up we didn't have options it was Home Depot or no Depot so I'm just really used to their store and products what you do is you just sprinkle it just like as if you're raking your grass right you throw it up against the wall and this step is formulated it instantly bonds with that light drywall compound okay and it will bond to it and then you can sweep so it doesn't go up in the air all right if I sweep compound regular you see all the dust floating around did you see it if I sweep it with the red dust you're not kicking anything up in the air all right that whole bag will last the entire job so 15 20 bucks whatever it is to not be kicking that dust up brilliant invention the other thing you can do is you're gonna open your window and you can shove a fan in it okay the best defense you have against dust in your house - putting a fan in your window like this you can get these at home table for 40 bucks and they blow a ton of air that's what I do without a doubt the most intimidating project in everybody's house is the stucco ceilings everybody's worried about and we get comments every day how do I deal with my stipple ceiling what if I have asbestos should I remove it should I take it down should I go over top should I skim coat it dear Lord no skim coating that ceiling will take you more time to energy and money than doing this take your piece of drywall get yourself a lift or a couple friends okay throw some mud on it and the thicker the texture the more mud you're gonna want to have I'm just doing a quick demonstration so I think for purpose of demonstration I'm gonna cut this down to size you're gonna want to use these to install these are called drywall laminating screws and it's just like it sounds it's for sticking one sheet of drywall into another sheet of drywall when you have no idea where the framework is here's our worse you take your sheet with your compound okay you stick it under your ceiling yeah that easy and you throw these in all right now these screws will not tighten up and be pretty okay what they will do is they'll hold that sheet in place until the drywall compound dries then the next day you come back you guess it um removed the screws tape your joints fill your little holes you can put in one of these screws every couple of feet it's not necessary to put a ton of them in just make sure you're holding it in place till it's dry and you can put a brand new ceiling over top of any textured ceiling in just a couple of hours no mess no worry about asbestos mwah perfect every time and if you want to know how good that drywall mud holds trust me when I say it's not going anywhere it creates like a vacuum so here is my secret for what to do with my mud at the end of the day you've already mixed it in a pail clean down the sides okay and if you like you can even use a sponge the closer you get to the bottom the more you're going to want to have a sponge clean all the mud off okay you know nothing's perfect in this world this mud has been exposed to the air the whole time you're working and drying it you're going to put your hock on top of it as a lid and it's going to dry out a little bit more so what you do just put a layer of water on there here's your lid there's your tools okay and you're good to go the next day now the next day when you get here you don't have crusty dry mud on the pail so when you're taking your compound on you're not gonna have those hard chunks in the mud which will wreck your finish this is how you protect it so it's silky smooth all the time soapy smooth like Zohan now one of the questions we get all the time is should I buy the small tubs no I always buy it buy a big box or big pail it's not a lot of money and if you don't use it all it'll only last three or four weeks after you've opened it up and started using it okay it's not a big deal you can make your own compound and put it in a pail and store it like this in the last three weeks bottom line is you want to make sure that your mud is in perfect condition for doing the job now listen guys we've got other great drywall videos that help you with a lot of your other questions we put a playlist together you can click the link over here and if you learn anything today make sure you hit the like button okay help support our channel by promoting our channel by hitting that button we'd appreciate it don't forget to subscribe if you haven't and if you're interested in what's in behind that plastic wall over there then go into the video description click the link for reality Renta vision it's our other channel you're going to love it it's got all the project videos that we're putting up from this farmhouse renovation we'll see you next"
    },
    {
      "url": "https://www.youtube.com/watch?v=x1LxffCk3RU",
      "content": "FIX Your Game's UI in UNDER 4 MINUTES b3agz 16800 subscribers 81 likes 17203 views 8 Jan 2025 Struggling with organising UI menus in Unity? Do you end up with a messy system for tracking which UI panels are open and which aren't? Do you have 3 minutes and 40 seconds to spare? GOOD NEWS EVERYBODY! In this video we go over a super simple system for handling UI panels. Think in-game menu, settings menu, controls, etc. Basically any time you might have several panels open at once and the order that they were opened in needs to be respected. Still unclear? Well the video is less than 4 minutes, just watch it. Jeeze, the Internet today. No attention span smh my head. VIDEO LINKS ------------------------------ @Blackthornprod's 100 Devs Make a Game vid (feat. me!): https://www.youtube.com/watch?v=_imM3cmRGIQ @b3agzAD: https://www.youtube.com/@b3agzAD B3AGZ LINKS ------------------------------ Support the Content - https://b3agz.com/support-the-content/ Join the Discord - https://discord.gg/aZgBgC2 Get b3agz Merch - https://shop.b3agz.com/ B3AGZ SOCIALS ------------------------------ Twitch - https://www.twitch.tv/b3agz Website - https://b3agz.com/ BlueSky - https://bsky.app/profile/b3agz.com TikTok - https://www.tiktok.com/@b3agz Instagram - https://www.instagram.com/b3agz_/ Facebook - https://www.facebook.com/b3agz/ Chapters: 0:00 Intro 0:24 The Problem 1:11 Setting Up The Hierarchy 1:25 Making The Script 2:06 Dealing With Focused-Only Logic 2:30 Handling Window Disabling 3:00 Focus OnClick/Outro #unity3d #unitytutorials #gamedev 22 comments so you started making your game everything's going great you follow optimism and then you get slapped in the face by the cold hard fish of reality otherwise known as user interface well fear not this video will show you a dead simple and fast way to handle multiple UI elements in your unity game but wait maybe you're sitting there wondering what the problem is Oh My Sweet Summer child well let me show you I've set up a simple dummy UI system in nice bright colors and big numbers because I know some of you are a bit slow these buttons at the side will turn their respective windows on and off each window also has some Logic on it that toggles its number on and off when I press the space bar so let's look at the first problem unity's UI system uses an object's position in the hierarchy to determine its sorting [Music] order that means that if a UI element is on top of another UI element it will always be on top of the other UI element until you shuffle them around in the hierarchy secondly any logic you have on a UI element needs to know if it's allowed to run or not for example closing the active window when the player presses Escape or cancel versus closing all of the open Windows cuz they all have that logic on them so let's fix it we're going to move fast here because the title of this video made a promise and I hate clickbait make an object in your UI that will act as a parent for any UI elements you want to manage with this system this isn't just an organizational thing it allows you to position the managed elements as one so that if you have something that you want to be always on top or always on beneath of these elements you can next create a script for handling these UI elements I'm just going to call my window inside that script we need a reference to the rec transform of the UI element we'll grab this in a wake but we also want to do a little bit of validation because I just know some of you numes will put this thing on a regular game object now for the magic using the UN enabled class we want to make it so that anytime this object becomes enabled it sets itself to be the last child under its parent making it the one on top now change of scripts on your UI element to inherit from this new script if you don't have a script on any element you can just drop this script on as it is and there's the Sorting Auto fixed but we still have this issue with the logic so back to the code because the lowest item in the hierarchy is always on top we don't actually have to keep track of which window is in Focus we can just look and see if a given window is the last sibling then in our logic script use this new Bool to prevent anything happening that we don't want to happen if the window isn't in focus [Music] nice but not perfect when we deactivate a window that was in focus it stays in that last slot in the hierarchy so none of the other windows will be in Focus until one of them is enabled but don't worry this one's easy as well when we disable a window just move it to the back of the UI and whatever was open last will become the new focused window and that's it dead simple UI management system that only requires one script [Music] and just as a bonus what's going on in the background right now is me adding the code so that if you click on the UI element it will bring it to the front cuz that's also something you might want to do sometimes but while that's going on I just want to thank my amazing patreons twitch supporters Discord Nitro boosters all the people who support this channel it was an amazing 2024 and I'm hoping for an even bigger 2025 so yeah and also if you didn't see it I was in the latest black Thor prod video 100 devs make a game go check that out and also don't forget to check out the be's after that channel okay that's it that's what I'm going now I'll see you next time bye",
      "title": "FIX Your Game's UI in UNDER 4 MINUTES b3agz 16800 subscribers 81 likes 17203 views 8 Jan 2025 Struggling with organising UI menus in Unity? Do you end up with a messy system for tracking which UI panels are open and which aren't? Do you have 3 minutes and 40 seconds to spare? GOOD NEWS EVERYBODY! In this video we go over a super simple system for handling UI panels. Think in-game menu, settings menu, controls, etc. Basically any time you might have several panels open at once and the order that they were opened in needs to be respected. Still unclear? Well the video is less than 4 minutes, just watch it. Jeeze, the Internet today. No attention span smh my head. VIDEO LINKS ------------------------------ @Blackthornprod's 100 Devs Make a Game vid (feat. me!): https://www.youtube.com/watch?v=_imM3cmRGIQ @b3agzAD: https://www.youtube.com/@b3agzAD B3AGZ LINKS ------------------------------ Support the Content - https://b3agz.com/support-the-content/ Join the Discord - https://discord.gg/aZgBgC2 Get b3agz Merch - https://shop.b3agz.com/ B3AGZ SOCIALS ------------------------------ Twitch - https://www.twitch.tv/b3agz Website - https://b3agz.com/ BlueSky - https://bsky.app/profile/b3agz.com TikTok - https://www.tiktok.com/@b3agz Instagram - https://www.instagram.com/b3agz_/ Facebook - https://www.facebook.com/b3agz/ Chapters: 0:00 Intro 0:24 The Problem 1:11 Setting Up The Hierarchy 1:25 Making The Script 2:06 Dealing With Focused-Only Logic 2:30 Handling Window Disabling 3:00 Focus OnClick/Outro #unity3d #unitytutorials #gamedev 22 comments so you started making your game everything's going great you follow optimism and then you get slapped in the face by the cold hard fish of reality otherwise known as user interface well fear not this video will show you a dead simple and fast way to handle multiple UI elements in your unity game but wait maybe you're sitting there wondering what the problem is Oh My Sweet Summer child well let me show you I've set up a simple dummy UI system in nice bright colors and big numbers because I know some of you are a bit slow these buttons at the side will turn their respective windows on and off each window also has some Logic on it that toggles its number on and off when I press the space bar so let's look at the first problem unity's UI system uses an object's position in the hierarchy to determine its sorting [Music] order that means that if a UI element is on top of another UI element it will always be on top of the other UI element until you shuffle them around in the hierarchy secondly any logic you have on a UI element needs to know if it's allowed to run or not for example closing the active window when the player presses Escape or cancel versus closing all of the open Windows cuz they all have that logic on them so let's fix it we're going to move fast here because the title of this video made a promise and I hate clickbait make an object in your UI that will act as a parent for any UI elements you want to manage with this system this isn't just an organizational thing it allows you to position the managed elements as one so that if you have something that you want to be always on top or always on beneath of these elements you can next create a script for handling these UI elements I'm just going to call my window inside that script we need a reference to the rec transform of the UI element we'll grab this in a wake but we also want to do a little bit of validation because I just know some of you numes will put this thing on a regular game object now for the magic using the UN enabled class we want to make it so that anytime this object becomes enabled it sets itself to be the last child under its parent making it the one on top now change of scripts on your UI element to inherit from this new script if you don't have a script on any element you can just drop this script on as it is and there's the Sorting Auto fixed but we still have this issue with the logic so back to the code because the lowest item in the hierarchy is always on top we don't actually have to keep track of which window is in Focus we can just look and see if a given window is the last sibling then in our logic script use this new Bool to prevent anything happening that we don't want to happen if the window isn't in focus [Music] nice but not perfect when we deactivate a window that was in focus it stays in that last slot in the hierarchy so none of the other windows will be in Focus until one of them is enabled but don't worry this one's easy as well when we disable a window just move it to the back of the UI and whatever was open last will become the new focused window and that's it dead simple UI management system that only requires one script [Music] and just as a bonus what's going on in the background right now is me adding the code so that if you click on the UI element it will bring it to the front cuz that's also something you might want to do sometimes but while that's going on I just want to thank my amazing patreons twitch supporters Discord Nitro boosters all the people who support this channel it was an amazing 2024 and I'm hoping for an even bigger 2025 so yeah and also if you didn't see it I was in the latest black Thor prod video 100 devs make a game go check that out and also don't forget to check out the be's after that channel okay that's it that's what I'm going now I'll see you next time bye"
    },
    {
      "url": "https://medium.com/@nicolaskraj/designing-efficient-user-interfaces-for-games-be20b516f1c2",
      "content": "Published Time: 2020-02-25T00:00:00.000Z Designing Efficient User Interfaces For Games | by Nicolas Kraj | Medium Open in app Sign up Sign in Write Sign up Sign in Designing Efficient User Interfaces For Games Going over common mistakes, core guidelines, and all the theory you need to get started. Nicolas Kraj ·Follow 15 min read · Feb 25, 2020 27 Listen Share Talking about User Interface (UI in short) isn’t an easy thing: the web is literally filled with amazing articles on this topic: accessibility, art direction, famous UI break-downs, you name it. But very few articles talk about UI in games, and that is a whole new level of complexity. UI in most games isn’t the primary focus of players: it exists for the sole purpose of making sense of the insane amount of things happening in said games: tracking players' life, bullets, highlighting enemies, interactable elements, displaying quests, contextualizing systems… UI is vital, and yet it is the first immersion breaker. Game: Fallout New Vegas After 10+ years reviewing, designing, and iterating on UI in games like Assassin’s Creed: Origins or The Crew, I realized that I often ask myself the same questions, apply the same principles. And this is what I would like us to go through today: an introduction to designing efficient games’ UI and my thought process while designing or reviewing said UI: the questions I want to answer myself, the big categories of UI, why using one instead of the other, the tests I perform to challenge it, etc. At the end of this article, I’d like you to have a base of theory as well as your first keys to design and challenge your own games’ UI (or spot the mistakes next time you are playing one!). But first, an important question we need to answer ourself every time we consider adding a new UI element to a system: Do we really need UI for that? There is an easy rule to keep in mind: every single part of our games needs Signs and Feedback (S&F in short). Everything! There are rare occasions where we’d like not to include any but they are anecdotical. So now let’s imagine we are working on a feature and we have some information we need to convey to our players: an ability ready to be used, a “stunned” state on the player, an enemy appearing on screen, etc. Usually, this is the moment we end up hearing something in the line of “ We need an icon!”, or “ Let’s ask the UI artists to figure something out”. And don’t get me wrong, plenty of time this is a very legit thing to consider! The issue here is that it is the easiest answer, and we may miss plenty of more elegant opportunities. Mistake #1: considering UI as our only way for S&F. There are reasons why UI is often considered first: it has a lot of qualities! It is extremely versatile and allows for very efficient solutions. It is usually fast to implement and cost-effective compared to new animation sets or hungry VFX. It expresses itself on a different layer than the one of the game world, reducing dependencies issues. But using it unreasonably leads to cluttered interfaces, creating a thick layer between our players and our games. Most of the time our players do not even need this information, creating immersion breakers and confusion. Which leads us to: Mistake #2: displaying everything, all the time. So before even starting discussing the “How to UI”, let’s try and remember these 2 critical facts: UI may not be the best way to pass specific information to players. This information may not be relevant to players at this moment. Let’s think about the format: UI is where we put text and numbers, pictograms, widgets (minimaps, quest log…), gauges, menus and games overlays, and plenty of other options exist to convey information: haptic feedback, SFX, VFX, animation, 3D models, lighting… The 4 categories of UI We need to start talking about theory by understanding that there are 4 categories of UIs. We need to understand what they are, and what are the reasons for using one instead of the other: Games (Left to right, top to bottom): Destiny 2, Ghost Recon Future Soldier, Watch Dogs 2, Far Cry 2 These categories are done based on 2 fundamental questions that we will have to ask ourself for every piece of information we want to display through the UI: Does this information exist in the 3D view of the game (the game’s world)? Does this information exist in the game’s universe & narrative? Non-Diegetic Game: Street Fighter V This is the most common type of UI: it acts as an overlay over the game. It doesn’t exist in the 3D view, neither does it in the game universe: in the Street Fighter series, neither Chun-Li nor Ryu are aware of the existence of their combo meters or the visual representation of their health. This kind of UI is extremely convenient as it won’t be affected by the game’s non-controllable states: whatever happens to the camera, the game’s reality or the state of our in-game characters, the UI can take whatever shape or form we want it to be while keeping each element on a fixed position on the screen. Pros: We have full control over shapes, forms, and colors, protecting accessibility and readability. It can be freely placed around the screen, smartly using corners and other unexploited screen areas. It is independent of what happens in the game’s world: camera movements, camera shakes, explosions… There is no possible disappearance from the player’s field-of-view or cover-up by other game’s elements. Cons: The denser the UI, the more we are creating a layer between the player in the game. It harms immersion and creates a disconnection with the action. With a fixed position on the screen, and being so impervious to cover-ups as the first layer displayed, it can on the contrary cover critical information happening in the game, if designed with a heavy hand. Diegetic Game: Metro Last Light (Let’s use another example than Dead Space for once) If you worked with UI before, you probably know already what a Diegetic interface means: it has been pushed for years as the next revolution in UI design (Spoiler alert: it is not), highly popularized by the Dead Space series. In short, this category contains all the game elements answering YES to both our question: they do exist in the 3D view, and not as an overlay like previously, and they also do exist for our characters, in the world fantasy. In the example above from Metro Last Light, the mission panel is written on Artyom’s very own notebook and makes total sense in the game’s universe. It creates a deeply believable world, one where most (if not all) the UI is fully merged within the game’s reality. And I can’t but agree: it’s a beauty! Unfortunately, it comes with its long list of issues. Pros: The perfect immersion, the moment where we are not controlling the hero anymore, but instead ARE the hero. Reinforce the game’s narrative: how does the character in Far Cry 2 keep track of the time or orient himself? With his watch, map, and compass of course! It ties the universe pieces together. Cons: In most games, this reality just doesn’t make sense. This utopia that every game could go full diegetic should they invest the time and effort in it is just wrong. I can’t see Sonic holding all his rings while carrying 3 clones of himself should he die for example (though imagining the grim “clone activation” scene, it may actually be a brilliant idea!). Extremely expensive to develop: more than the concept, it often implies new animations, assets, camera contexts, etc. Efforts that could be put where it matters most, in the places making our game truly unique. Can push the game into unwanted flows: in our previous example, Artyom can’t do anything else while checking his objective, which slows down the flow and put him in a potentially dangerous situation. In this game, I do believe that it is a wanted behavior. But for our own games, this is definitely a question we need to answer ourself. Spatial Game: Splinter Cell: Blacklist These two remaining categories are less exploited but very interesting nonetheless. Take this example from Splinter Cell: Blacklist. The objectives and tutorials are directly displayed inside the world. It not only creates a one-of-a-kind UI but also anchors the world and drives the player better than any objective marker. This UI category exists directly in the game world while remaining at the player’s discretion. It creates either a very cinematographic effect (can you think of movies using the same principle? Plenty have understood this trick!) or helps our players orient themselves a lot better. Another interesting example would be Left 4 Dead 2 highlighting teammates through the game’s geometry. Pros: Anchors our world and gives consistency to it. Creates a visual connection between a piece of information “your teammate is down” and its location “on the roof, pretty far from your location”. Cons: It can be missed: as they exist in the world, we have little control over where our players will look. They will work perfectly on very linear games or segments (i.e. when we are 100% certain our player will see it) or when it is part of the core-loop (like how players need to be constantly checking on their teammates in L4D2) Meta Game: Forza Horizon 4 This last category is simply put an evolution of the non-diegetic UI. In short, it doesn’t exist in the world (i.e. it is part of this layer standing above the game) but makes sense, and exists, in the game’s fantasy. In GTA5 for example, where would Trevor get access to his missions or map? On his phone of course! And in Forza Horizon 4, why not represent the car’s speed with a speedometer? We need to see this category as an opportunity. Evolving a non-diegetic element into a meta one reinforces our fantasy and helps our players make sense of our world. Pros: Same as the non-diegetic ones: creative freedom, protected layer over the game, and independence from the game world… … plus a very good opportunity to ground our world and fantasy! Cons: Same as the non-diegetic ones: potentially hurting the immersion with this extra layer, or covering critical game’s information… … plus running the risk of overcrowding, even more, our screen: a speedometer will take a lot more space on the screen than a simple gauge or number. A fake phone interface will always need some extras pixels. This is a decision for us to make: is our element so important in our fantasy that we are willing to clutter our screen for it? Now that we have our 4 categories, I’d like to focus the rest of this article on some tips and tricks that helped me challenge my UI systems over the years. Protecting the core of our games Every game has very unique critical focus areas. What I’m talking about here is the zone on the screen that MUST remain un-cluttered whatever happens! This is the zone where the most high-stakes moments happen for our players: it can be a challenging platforming sequence, an aim-and-shoot moment, the horizon in a racing game… All these moments that, if occluded, will ruin our player experience. Defining them precisely could be done with an eye-tracking study, but we do not always have the material, time or energy to do that… So let’s use a designer’s best tools: intuition and experience! Game: Mortal Kombat 11 In a fighting game like Mortal Kombat 11, the critical focus area (in red above) is very straight-forward: as the entirety of the gameplay is animation based, it is critical to have a constant view on each character and the zone between them (hit distance). As expected, no UI will ever temper with this area ( i.e. once the match starts of course). The yellow zone, yet not critical, is still an important one as it highlights the boundaries of the arena. It is then reserved for either light UI elements (located in the corners) or non-permanent highlights (“kounters”, points, etc.). Finally, the green zone is our safe space where heavy, permanent UI elements can be displayed without risks. You may point, rightfully, that this is not a matter of chance but more because of a carefully designed camera context, born after decades of iteration of our medium. This emphasizes a very important part of our work: mindful researches. We will probably stumble upon issues designing our critical focus areas. When this happens, we need to think about tuning our cameras (angle, zoom factor, depth of field) or using the spatial & diegetic category to merge our UI into your world! Game: Need for Speed Heat In a racing game like Need for Speed Heat, the critical focus area is a diamond shape encompassing the horizon, the players' direct surroundings, and their car. Why the car? Because this zone isn’t only about gameplay, but about the core of our experiences. Letting our players get a premium view of their car is a must-have to engage them in a premium driving experience. Defining these areas, that will always be highly specific to each of our games, will help us enormously design the position, shape, and size our UI will take. It is always the first step I take while designing a UI. Key #1: Identify your critical focus area (you may have multiple depending of the game segment) and organize your UI accordingly. Combining all 4 categories Game: Halo 5 Let’s put one possible worry to rest: we can use the 4 categories of UI, together, at the same time, without any limitation! We do not need to pick one and stick to it: instead, we need to ask ourself, for each UI element, which category would fit best and roll with it. If you still doubt this statement, let’s have a look at the in-game UI of Halo 5 displayed above: this game uses all 4 categories, at the same time, and yet has an extremely slick UI! Non-Diegetic: match advancement (red vs. blue team, time remaining), crosshair, mini-map and gear (if we consider them out of the narrative). Diegetic: bullets counter and extra display on the gun itself. Spatial: objectives, allies, and enemies markers in the world. Meta: HUD information, like the shield widget on top of the screen, embedded in the helmet fantasy. Key #2: Mix and match categories without limitations. For each UI element, pick the one that makes the most sense. Displaying only relevant information Let’s remember Mistake #2: displaying everything, all the time. This is, to me, one of the most common mistakes leading to a cluttered screen and a messy UI perception. The reality is that our players need only very little information at a specific time, and displaying irrelevant information will only lead to confusion, and critical information being lost. In Assassin’s Creed: Origins, the health bar of the player and the enemies, which seems to be a critical piece of information to display at all times, is instead displayed only during conflicts. Game: Assassin’s Creed: Origins By deciding to hide it outside of conflicts, the game lets more important UI elements shine while emphasizing that not everything in the game is about combat. It relates to the game’s core experiences. We need to ask ourself, for each of our UI elements, when and why it makes sense to display them and define rules for having them appearing or disappearing (toggle on button press? always displayed? fade-in fade-out? parameters?). This opens the door for bigger talks about game contexts: moments (fighting, exploration, dialogues, parkour, investigation, etc.) that require specific controls, camera setup, rules, and, you guessed it, UI. There is a saying: “ If everything is important, nothing is important”. This applies very much to our topic here, and I like to use a simple trick to see how UI can affect the legibility of a screen: I pick the brightest/ugliest color I have and overpaint my entire UI. Is the game still pleasant to play? Is it still usable? Accessible? Game: Battleborn This screen above is from Battleborn: a lot of information seems very unnecessary in this scenario, from tutorials, to story characters avatars and prompts. Well, let’s repaint it and see what we get! A much better way to spot potential issues. What do you think of this screen? Would you enjoy playing the game if this was constantly displayed? Can you play it efficiently (visibility, accessibility…)? If not, we may have some trimming and redesign to do (and yes, I took an extreme example, but doing this exercise teaches a lot!) Key #3: for each of your game’s context, display only what matters at that specific moment. Do not hesitate to hide core elements if the player has no use of it. Design for minimum eye travel distance This part is both very straightforward yet simple to misinterpret: in short, a good UI minimizes the eye travel distance over the screen. This has to do with our players’ comfort, of course, but not only: by grouping elements on the screen, we create a visual connection between them, making it easier for our players to build mental models over these elements. One easy mistake to make is to assume that the most important elements need to be located in the middle of the screen and that the least important ones must be pushed in the corners. Many games have a critical focus area in the middle of the screen, making, indeed, elements appearing there more visible. But the key here goes beyond physical location on the screen: it is about flows. In short: what connects different elements together and how does the player bounces between them. Fighting games, for example, understood long ago how important this topic is. One key-moment in a fighting game is the last moments of a match: Both players are running out of life, the timer is ticking its last seconds… It’s a very tense moment where a small mistake can cost them the victory. A player, on top of focusing on the fight itself, needs to be able to extremely quickly check the timer and both player’s health. This is the main reason why health bars are emptying towards the middle of the screen, being so close to the central timer. Game: Tekken 7 This is a perfect example: designers understood the players’ flow at that specific moment and designed a compact and extremely efficient UI around it, to the point it became the norm in (almost) every fighting game. Key #4: do not think in terms of physical screen’s location, but instead in terms of player flows: they have specific needs at specific times. Being mindful of the weight of our UI elements Game: Half-Life 2 This is a given in any design discipline: to be mindful of the visual strength of our components. Too subtle and our players will miss it. Too strong and we will shift the experience towards these elements, breaking the immersion in the process. One reference that is widely regarded as a precursor in good UI design is Half-Life 2. It managed a minimalistic, yet extremely efficient UI, its monochrome beige UI becoming one of the most recognizable elements of this game. Key #5: Iterate on the visual strength of your UI and the balance between an invisible UI and an overwhelming one by prioritizing elements based on your game pillars and players needs and motivations. Considering our worst-case scenarios Game: Black Desert Online We may have in our games some variable UI systems: an expandable text-chat widget, a notification system pilling them up one over another if multiple get received close to each other, a kill-log or quest-log that could get out of hand in some extreme scenario… If this is the case, we need to always consider them at their worst, and judge our UI based on this result: many players will find themselves in this situation at a point or another and at worse it could totally ruin their experience (I have seen notifications system ending up covering some critical buttons making them non-interactable while the notification is displayed). Alternatively, a worst-case scenario could be the absence of many of these elements (onboarding, specific gameplay sequences, etc.) that may leave other UI elements floating and unanchored. Key #6: Make sure to integrate limitations and safeguards in case your UI goes into some extreme scenarios (example: a maximum number of notification displayed at a specific time). Finally, never forget A key we all forget sometimes… Originally published at http://gdkeys.com Sign up to discover human stories that deepen your understanding of the world. Free Distraction-free reading. No ads. Organize your knowledge with lists and highlights. Tell your story. Find your audience. Sign up for free Membership Read member-only stories Support writers you read most Earn money for your writing Listen to audio narrations Read offline with the Medium app Try for $5/month UX UI Game Development Game Design Design 27 27 Follow Written by Nicolas Kraj ----------------------- 17 Followers ·1 Following UX Director for Ubisoft with 10+ years in the industry (Lead Game Designer on Assassin’s Creed: Origins, Beyond Good & Evil 2, Gods & Monsters and more). Follow No responses yet Write a response What are your thoughts? Cancel Respond Also publish to my profile More from Nicolas Kraj In UX Collective by Nicolas Kraj Game UX: introduction to players motivation ------------------------------------------- ### As any game designer knows too well, the biggest mystery in our design equations will always remain our players themselves. Their variance… Sep 15, 2020 41 Nicolas Kraj Game Design Dirty Little Secrets -------------------------------- ### A lesson on creating epic experiences for our players May 5, 2020 In UX Collective by Nicolas Kraj 7 tips to apply for a Game Designer position -------------------------------------------- ### Lessons from 10 years of recruitment and game design teams management Aug 14, 2020 44 See all from Nicolas Kraj Recommended from Medium In Muzli - Design Inspiration by Souptik Debnath UI Design Trends In 2025 ------------------------ ### Designing for 2025 isn’t just about hopping on the latest trends — it’s about creating experiences that truly matters the most. As the… Jan 20 1K 13 Jessica Stillman Jeff Bezos Says the 1-Hour Rule Makes Him Smarter. New Neuroscience Says He’s Right ----------------------------------------------------------------------------------- ### Jeff Bezos’s morning routine has long included the one-hour rule. New neuroscience says yours probably should too. Oct 30, 2024 25K 733 Lists Stories to Help You Grow as a Designer -------------------------------------- 11 stories·1124 saves Interesting Design Topics ------------------------- 258 stories·984 saves Figma 101 --------- 7 stories·847 saves Icon Design ----------- 39 stories·506 saves Michal Malewicz Figma is not forever. --------------------- ### And inVision is now gone. Jan 6, 2024 3.8K 91 In UX Collective by Darren Yeo The hype and risks of vibe coding --------------------------------- ### and why designers should not head down this path. 3d ago 375 6 In Prototypr by Melody Koh 🤔 Your portfolios are fucking boring ---------------------------------- ### Sincerely, every design hiring manager out there Oct 29, 2022 18.5K 16 In UX in Motion by Issara Willenskomer Creating Usability with Motion: The UX in Motion Manifesto ---------------------------------------------------------- ### The following manifesto represents my answer to the question — “As a UX or UI, designer, how do I know when and where to implement motion… Mar 31, 2017 87K 196 See more recommendations Help Status About Careers Press Blog Privacy Terms Text to speech Teams",
      "title": "Published Time: 2020-02-25T00:00:00.000Z Designing Efficient User Interfaces For Games | by Nicolas Kraj | Medium Open in app Sign up Sign in Write Sign up Sign in Designing Efficient User Interfaces For Games Going over common mistakes, core guidelines, and all the theory you need to get started. Nicolas Kraj ·Follow 15 min read · Feb 25, 2020 27 Listen Share Talking about User Interface (UI in short) isn’t an easy thing: the web is literally filled with amazing articles on this topic: accessibility, art direction, famous UI break-downs, you name it. But very few articles talk about UI in games, and that is a whole new level of complexity. UI in most games isn’t the primary focus of players: it exists for the sole purpose of making sense of the insane amount of things happening in said games: tracking players' life, bullets, highlighting enemies, interactable elements, displaying quests, contextualizing systems… UI is vital, and yet it is the first immersion breaker. Game: Fallout New Vegas After 10+ years reviewing, designing, and iterating on UI in games like Assassin’s Creed: Origins or The Crew, I realized that I often ask myself the same questions, apply the same principles. And this is what I would like us to go through today: an introduction to designing efficient games’ UI and my thought process while designing or reviewing said UI: the questions I want to answer myself, the big categories of UI, why using one instead of the other, the tests I perform to challenge it, etc. At the end of this article, I’d like you to have a base of theory as well as your first keys to design and challenge your own games’ UI (or spot the mistakes next time you are playing one!). But first, an important question we need to answer ourself every time we consider adding a new UI element to a system: Do we really need UI for that? There is an easy rule to keep in mind: every single part of our games needs Signs and Feedback (S&F in short). Everything! There are rare occasions where we’d like not to include any but they are anecdotical. So now let’s imagine we are working on a feature and we have some information we need to convey to our players: an ability ready to be used, a “stunned” state on the player, an enemy appearing on screen, etc. Usually, this is the moment we end up hearing something in the line of “ We need an icon!”, or “ Let’s ask the UI artists to figure something out”. And don’t get me wrong, plenty of time this is a very legit thing to consider! The issue here is that it is the easiest answer, and we may miss plenty of more elegant opportunities. Mistake #1: considering UI as our only way for S&F. There are reasons why UI is often considered first: it has a lot of qualities! It is extremely versatile and allows for very efficient solutions. It is usually fast to implement and cost-effective compared to new animation sets or hungry VFX. It expresses itself on a different layer than the one of the game world, reducing dependencies issues. But using it unreasonably leads to cluttered interfaces, creating a thick layer between our players and our games. Most of the time our players do not even need this information, creating immersion breakers and confusion. Which leads us to: Mistake #2: displaying everything, all the time. So before even starting discussing the “How to UI”, let’s try and remember these 2 critical facts: UI may not be the best way to pass specific information to players. This information may not be relevant to players at this moment. Let’s think about the format: UI is where we put text and numbers, pictograms, widgets (minimaps, quest log…), gauges, menus and games overlays, and plenty of other options exist to convey information: haptic feedback, SFX, VFX, animation, 3D models, lighting… The 4 categories of UI We need to start talking about theory by understanding that there are 4 categories of UIs. We need to understand what they are, and what are the reasons for using one instead of the other: Games (Left to right, top to bottom): Destiny 2, Ghost Recon Future Soldier, Watch Dogs 2, Far Cry 2 These categories are done based on 2 fundamental questions that we will have to ask ourself for every piece of information we want to display through the UI: Does this information exist in the 3D view of the game (the game’s world)? Does this information exist in the game’s universe & narrative? Non-Diegetic Game: Street Fighter V This is the most common type of UI: it acts as an overlay over the game. It doesn’t exist in the 3D view, neither does it in the game universe: in the Street Fighter series, neither Chun-Li nor Ryu are aware of the existence of their combo meters or the visual representation of their health. This kind of UI is extremely convenient as it won’t be affected by the game’s non-controllable states: whatever happens to the camera, the game’s reality or the state of our in-game characters, the UI can take whatever shape or form we want it to be while keeping each element on a fixed position on the screen. Pros: We have full control over shapes, forms, and colors, protecting accessibility and readability. It can be freely placed around the screen, smartly using corners and other unexploited screen areas. It is independent of what happens in the game’s world: camera movements, camera shakes, explosions… There is no possible disappearance from the player’s field-of-view or cover-up by other game’s elements. Cons: The denser the UI, the more we are creating a layer between the player in the game. It harms immersion and creates a disconnection with the action. With a fixed position on the screen, and being so impervious to cover-ups as the first layer displayed, it can on the contrary cover critical information happening in the game, if designed with a heavy hand. Diegetic Game: Metro Last Light (Let’s use another example than Dead Space for once) If you worked with UI before, you probably know already what a Diegetic interface means: it has been pushed for years as the next revolution in UI design (Spoiler alert: it is not), highly popularized by the Dead Space series. In short, this category contains all the game elements answering YES to both our question: they do exist in the 3D view, and not as an overlay like previously, and they also do exist for our characters, in the world fantasy. In the example above from Metro Last Light, the mission panel is written on Artyom’s very own notebook and makes total sense in the game’s universe. It creates a deeply believable world, one where most (if not all) the UI is fully merged within the game’s reality. And I can’t but agree: it’s a beauty! Unfortunately, it comes with its long list of issues. Pros: The perfect immersion, the moment where we are not controlling the hero anymore, but instead ARE the hero. Reinforce the game’s narrative: how does the character in Far Cry 2 keep track of the time or orient himself? With his watch, map, and compass of course! It ties the universe pieces together. Cons: In most games, this reality just doesn’t make sense. This utopia that every game could go full diegetic should they invest the time and effort in it is just wrong. I can’t see Sonic holding all his rings while carrying 3 clones of himself should he die for example (though imagining the grim “clone activation” scene, it may actually be a brilliant idea!). Extremely expensive to develop: more than the concept, it often implies new animations, assets, camera contexts, etc. Efforts that could be put where it matters most, in the places making our game truly unique. Can push the game into unwanted flows: in our previous example, Artyom can’t do anything else while checking his objective, which slows down the flow and put him in a potentially dangerous situation. In this game, I do believe that it is a wanted behavior. But for our own games, this is definitely a question we need to answer ourself. Spatial Game: Splinter Cell: Blacklist These two remaining categories are less exploited but very interesting nonetheless. Take this example from Splinter Cell: Blacklist. The objectives and tutorials are directly displayed inside the world. It not only creates a one-of-a-kind UI but also anchors the world and drives the player better than any objective marker. This UI category exists directly in the game world while remaining at the player’s discretion. It creates either a very cinematographic effect (can you think of movies using the same principle? Plenty have understood this trick!) or helps our players orient themselves a lot better. Another interesting example would be Left 4 Dead 2 highlighting teammates through the game’s geometry. Pros: Anchors our world and gives consistency to it. Creates a visual connection between a piece of information “your teammate is down” and its location “on the roof, pretty far from your location”. Cons: It can be missed: as they exist in the world, we have little control over where our players will look. They will work perfectly on very linear games or segments (i.e. when we are 100% certain our player will see it) or when it is part of the core-loop (like how players need to be constantly checking on their teammates in L4D2) Meta Game: Forza Horizon 4 This last category is simply put an evolution of the non-diegetic UI. In short, it doesn’t exist in the world (i.e. it is part of this layer standing above the game) but makes sense, and exists, in the game’s fantasy. In GTA5 for example, where would Trevor get access to his missions or map? On his phone of course! And in Forza Horizon 4, why not represent the car’s speed with a speedometer? We need to see this category as an opportunity. Evolving a non-diegetic element into a meta one reinforces our fantasy and helps our players make sense of our world. Pros: Same as the non-diegetic ones: creative freedom, protected layer over the game, and independence from the game world… … plus a very good opportunity to ground our world and fantasy! Cons: Same as the non-diegetic ones: potentially hurting the immersion with this extra layer, or covering critical game’s information… … plus running the risk of overcrowding, even more, our screen: a speedometer will take a lot more space on the screen than a simple gauge or number. A fake phone interface will always need some extras pixels. This is a decision for us to make: is our element so important in our fantasy that we are willing to clutter our screen for it? Now that we have our 4 categories, I’d like to focus the rest of this article on some tips and tricks that helped me challenge my UI systems over the years. Protecting the core of our games Every game has very unique critical focus areas. What I’m talking about here is the zone on the screen that MUST remain un-cluttered whatever happens! This is the zone where the most high-stakes moments happen for our players: it can be a challenging platforming sequence, an aim-and-shoot moment, the horizon in a racing game… All these moments that, if occluded, will ruin our player experience. Defining them precisely could be done with an eye-tracking study, but we do not always have the material, time or energy to do that… So let’s use a designer’s best tools: intuition and experience! Game: Mortal Kombat 11 In a fighting game like Mortal Kombat 11, the critical focus area (in red above) is very straight-forward: as the entirety of the gameplay is animation based, it is critical to have a constant view on each character and the zone between them (hit distance). As expected, no UI will ever temper with this area ( i.e. once the match starts of course). The yellow zone, yet not critical, is still an important one as it highlights the boundaries of the arena. It is then reserved for either light UI elements (located in the corners) or non-permanent highlights (“kounters”, points, etc.). Finally, the green zone is our safe space where heavy, permanent UI elements can be displayed without risks. You may point, rightfully, that this is not a matter of chance but more because of a carefully designed camera context, born after decades of iteration of our medium. This emphasizes a very important part of our work: mindful researches. We will probably stumble upon issues designing our critical focus areas. When this happens, we need to think about tuning our cameras (angle, zoom factor, depth of field) or using the spatial & diegetic category to merge our UI into your world! Game: Need for Speed Heat In a racing game like Need for Speed Heat, the critical focus area is a diamond shape encompassing the horizon, the players' direct surroundings, and their car. Why the car? Because this zone isn’t only about gameplay, but about the core of our experiences. Letting our players get a premium view of their car is a must-have to engage them in a premium driving experience. Defining these areas, that will always be highly specific to each of our games, will help us enormously design the position, shape, and size our UI will take. It is always the first step I take while designing a UI. Key #1: Identify your critical focus area (you may have multiple depending of the game segment) and organize your UI accordingly. Combining all 4 categories Game: Halo 5 Let’s put one possible worry to rest: we can use the 4 categories of UI, together, at the same time, without any limitation! We do not need to pick one and stick to it: instead, we need to ask ourself, for each UI element, which category would fit best and roll with it. If you still doubt this statement, let’s have a look at the in-game UI of Halo 5 displayed above: this game uses all 4 categories, at the same time, and yet has an extremely slick UI! Non-Diegetic: match advancement (red vs. blue team, time remaining), crosshair, mini-map and gear (if we consider them out of the narrative). Diegetic: bullets counter and extra display on the gun itself. Spatial: objectives, allies, and enemies markers in the world. Meta: HUD information, like the shield widget on top of the screen, embedded in the helmet fantasy. Key #2: Mix and match categories without limitations. For each UI element, pick the one that makes the most sense. Displaying only relevant information Let’s remember Mistake #2: displaying everything, all the time. This is, to me, one of the most common mistakes leading to a cluttered screen and a messy UI perception. The reality is that our players need only very little information at a specific time, and displaying irrelevant information will only lead to confusion, and critical information being lost. In Assassin’s Creed: Origins, the health bar of the player and the enemies, which seems to be a critical piece of information to display at all times, is instead displayed only during conflicts. Game: Assassin’s Creed: Origins By deciding to hide it outside of conflicts, the game lets more important UI elements shine while emphasizing that not everything in the game is about combat. It relates to the game’s core experiences. We need to ask ourself, for each of our UI elements, when and why it makes sense to display them and define rules for having them appearing or disappearing (toggle on button press? always displayed? fade-in fade-out? parameters?). This opens the door for bigger talks about game contexts: moments (fighting, exploration, dialogues, parkour, investigation, etc.) that require specific controls, camera setup, rules, and, you guessed it, UI. There is a saying: “ If everything is important, nothing is important”. This applies very much to our topic here, and I like to use a simple trick to see how UI can affect the legibility of a screen: I pick the brightest/ugliest color I have and overpaint my entire UI. Is the game still pleasant to play? Is it still usable? Accessible? Game: Battleborn This screen above is from Battleborn: a lot of information seems very unnecessary in this scenario, from tutorials, to story characters avatars and prompts. Well, let’s repaint it and see what we get! A much better way to spot potential issues. What do you think of this screen? Would you enjoy playing the game if this was constantly displayed? Can you play it efficiently (visibility, accessibility…)? If not, we may have some trimming and redesign to do (and yes, I took an extreme example, but doing this exercise teaches a lot!) Key #3: for each of your game’s context, display only what matters at that specific moment. Do not hesitate to hide core elements if the player has no use of it. Design for minimum eye travel distance This part is both very straightforward yet simple to misinterpret: in short, a good UI minimizes the eye travel distance over the screen. This has to do with our players’ comfort, of course, but not only: by grouping elements on the screen, we create a visual connection between them, making it easier for our players to build mental models over these elements. One easy mistake to make is to assume that the most important elements need to be located in the middle of the screen and that the least important ones must be pushed in the corners. Many games have a critical focus area in the middle of the screen, making, indeed, elements appearing there more visible. But the key here goes beyond physical location on the screen: it is about flows. In short: what connects different elements together and how does the player bounces between them. Fighting games, for example, understood long ago how important this topic is. One key-moment in a fighting game is the last moments of a match: Both players are running out of life, the timer is ticking its last seconds… It’s a very tense moment where a small mistake can cost them the victory. A player, on top of focusing on the fight itself, needs to be able to extremely quickly check the timer and both player’s health. This is the main reason why health bars are emptying towards the middle of the screen, being so close to the central timer. Game: Tekken 7 This is a perfect example: designers understood the players’ flow at that specific moment and designed a compact and extremely efficient UI around it, to the point it became the norm in (almost) every fighting game. Key #4: do not think in terms of physical screen’s location, but instead in terms of player flows: they have specific needs at specific times. Being mindful of the weight of our UI elements Game: Half-Life 2 This is a given in any design discipline: to be mindful of the visual strength of our components. Too subtle and our players will miss it. Too strong and we will shift the experience towards these elements, breaking the immersion in the process. One reference that is widely regarded as a precursor in good UI design is Half-Life 2. It managed a minimalistic, yet extremely efficient UI, its monochrome beige UI becoming one of the most recognizable elements of this game. Key #5: Iterate on the visual strength of your UI and the balance between an invisible UI and an overwhelming one by prioritizing elements based on your game pillars and players needs and motivations. Considering our worst-case scenarios Game: Black Desert Online We may have in our games some variable UI systems: an expandable text-chat widget, a notification system pilling them up one over another if multiple get received close to each other, a kill-log or quest-log that could get out of hand in some extreme scenario… If this is the case, we need to always consider them at their worst, and judge our UI based on this result: many players will find themselves in this situation at a point or another and at worse it could totally ruin their experience (I have seen notifications system ending up covering some critical buttons making them non-interactable while the notification is displayed). Alternatively, a worst-case scenario could be the absence of many of these elements (onboarding, specific gameplay sequences, etc.) that may leave other UI elements floating and unanchored. Key #6: Make sure to integrate limitations and safeguards in case your UI goes into some extreme scenarios (example: a maximum number of notification displayed at a specific time). Finally, never forget A key we all forget sometimes… Originally published at http://gdkeys.com Sign up to discover human stories that deepen your understanding of the world. Free Distraction-free reading. No ads. Organize your knowledge with lists and highlights. Tell your story. Find your audience. Sign up for free Membership Read member-only stories Support writers you read most Earn money for your writing Listen to audio narrations Read offline with the Medium app Try for $5/month UX UI Game Development Game Design Design 27 27 Follow Written by Nicolas Kraj ----------------------- 17 Followers ·1 Following UX Director for Ubisoft with 10+ years in the industry (Lead Game Designer on Assassin’s Creed: Origins, Beyond Good & Evil 2, Gods & Monsters and more). Follow No responses yet Write a response What are your thoughts? Cancel Respond Also publish to my profile More from Nicolas Kraj In UX Collective by Nicolas Kraj Game UX: introduction to players motivation ------------------------------------------- ### As any game designer knows too well, the biggest mystery in our design equations will always remain our players themselves. Their variance… Sep 15, 2020 41 Nicolas Kraj Game Design Dirty Little Secrets -------------------------------- ### A lesson on creating epic experiences for our players May 5, 2020 In UX Collective by Nicolas Kraj 7 tips to apply for a Game Designer position -------------------------------------------- ### Lessons from 10 years of recruitment and game design teams management Aug 14, 2020 44 See all from Nicolas Kraj Recommended from Medium In Muzli - Design Inspiration by Souptik Debnath UI Design Trends In 2025 ------------------------ ### Designing for 2025 isn’t just about hopping on the latest trends — it’s about creating experiences that truly matters the most. As the… Jan 20 1K 13 Jessica Stillman Jeff Bezos Says the 1-Hour Rule Makes Him Smarter. New Neuroscience Says He’s Right ----------------------------------------------------------------------------------- ### Jeff Bezos’s morning routine has long included the one-hour rule. New neuroscience says yours probably should too. Oct 30, 2024 25K 733 Lists Stories to Help You Grow as a Designer -------------------------------------- 11 stories·1124 saves Interesting Design Topics ------------------------- 258 stories·984 saves Figma 101 --------- 7 stories·847 saves Icon Design ----------- 39 stories·506 saves Michal Malewicz Figma is not forever. --------------------- ### And inVision is now gone. Jan 6, 2024 3.8K 91 In UX Collective by Darren Yeo The hype and risks of vibe coding --------------------------------- ### and why designers should not head down this path. 3d ago 375 6 In Prototypr by Melody Koh 🤔 Your portfolios are fucking boring ---------------------------------- ### Sincerely, every design hiring manager out there Oct 29, 2022 18.5K 16 In UX in Motion by Issara Willenskomer Creating Usability with Motion: The UX in Motion Manifesto ---------------------------------------------------------- ### The following manifesto represents my answer to the question — “As a UX or UI, designer, how do I know when and where to implement motion… Mar 31, 2017 87K 196 See more recommendations Help Status About Careers Press Blog Privacy Terms Text to speech Teams"
    },
    {
      "url": "https://careerfoundry.com/en/blog/ui-design/game-ui-design",
      "content": "Explore UI Design | The CareerFoundry Blog Courses Learn with us Our graduates Online Events Blog Login Courses ✕ Programs to change your career Product Design new UX Design UI Design Full-Stack Web Development Data Analytics Digital Marketing Product Management Agentur für Arbeit programs Product Design AfA new UX Design AfA UI Design AfA Full-Stack Web Development AfA Data Analytics AfA Data Analytics with German AfA Digital Marketing AfA Product Management AfA Data Analytics (Deutsch) AfA new Introductory courses Intro to Product Design new Intro to UX Design Intro to UI Design Intro to Frontend Development Intro to Data Analytics Intro to Digital Marketing Intro to Product Management Advanced courses Voice User Interface Design UI for UX Designers Frontend Development for Designers Animation for UI Designers Python for Web Developers Cloud Computing for Web Devs Machine Learning with Python Data Visualizations with Python Learn with CareerFoundry ✕ ##### Learn online, not alone Our career-change programs are designed to take you from beginner to pro in your tech career—with personalized support every step of the way. How it works ##### Individualized mentorship Nurture your inner tech pro with personalized guidance from not one, but two industry experts. They’ll provide feedback, support, and advice as you build your new career. Meet our mentors ##### Job Guarantee We back our programs with a job guarantee: Follow our career advice, and you’ll land a job within 6 months of graduation, or you’ll get your money back. Get the details ##### Personal career coaching Build a career you love with 1:1 help from a career specialist who knows the job market in your area! Identify your skills, refine your portfolio, and attract the right employers. Explore our career services Our graduates ✕ ##### Graduate outcomes Our graduates come from all walks of life. Whether they’re starting from scratch or upskilling, they have one thing in common: They go on to forge careers they love. Meet our grads ##### Looking for tech talent? If you want easy recruiting from a global pool of skilled candidates, we’re here to help. Our graduates are highly skilled, motivated, and prepared for impactful careers in tech. Hire our grads ✕ Courses Programs to change your career Product Design UX Design UI Design Full-Stack Web Development Data Analytics Digital Marketing Product Management Agentur für Arbeit programs Product Design AfA new UX Design AfA UI Design AfA Full-Stack Web Development AfA Data Analytics AfA Data Analytics with German AfA Digital Marketing AfA Product Management AfA Data Analytics (Deutsch) AfA new Introductory courses Intro to Product Design new Intro to UX Design Intro to UI Design Intro to Frontend Development Intro to Data Analytics Intro to Digital Marketing Intro to Product Management Advanced courses Voice User Interface Design UI for UX Designers Frontend Development for Designers Animation for UI Designers Python for Web Developers Cloud Computing for Web Devs Machine Learning with Python Data Visualizations with Python Learn with us How it works Meet our mentors Job guarantee Career services Our graduates Graduate outcomes Hire our grads Online Events Blog Login UX Design Web Development Data Analytics Student Stories More Categories Digital Marketing Product Design Product Management UI Design Career Change UX Design Web Development More Categories Data Analytics Student Stories Digital Marketing Product Design Product Management UI Design Career Change See our blog categories UX Design Web Development Data Analytics Student Stories Digital Marketing Product Design Product Management UI Design Career Change Start your free UI design course Start your free UI design course UI Design User interface (UI) design is the process of designing the visual interfaces of digital products, most commonly websites and app screens, to facilitate user interaction. Featured articles UI Design #### Game UI Design: Everything You Need To Know May 12, 2023· 14 minutes read UI Design #### How to Become a UI Designer With No Experience November 7, 2023· 7 minutes read UX Design #### The Difference Between UX and UI Design: A Beginner’s Guide February 19, 2025· 21 minutes read UI Design #### 8 Examples of the Best UI Websites Design in 2025 May 10, 2023· 16 minutes read UI Design #### These Are the 9 Best UI Design Courses in 2025 January 3, 2025· 10 minutes read UI Design #### How to Become a User Interface (UI) Designer: A Step-by-Step Guide for 2025 December 8, 2023· 32 minutes read UI Design #### The Best UI Design Certification Programs June 7, 2023· 17 minutes read UI Design #### Are UI Designers In Demand in 2025? Here’s The Current Industry Outlook December 16, 2024· 8 minutes read UI Design #### How Much Will I Earn as a UI Designer? Your Salary Guide for 2025 December 17, 2024· 5 minutes read UI Design #### What Is Typography, and Why Is It Important? A Beginner’s Guide May 11, 2023· 14 minutes read UI Design #### Game UI Design: Everything You Need To Know May 12, 2023· 14 minutes read UI Design #### How to Become a UI Designer With No Experience November 7, 2023· 7 minutes read UX Design #### The Difference Between UX and UI Design: A Beginner’s Guide February 19, 2025· 21 minutes read UI Design #### 8 Examples of the Best UI Websites Design in 2025 May 10, 2023· 16 minutes read UI Design #### These Are the 9 Best UI Design Courses in 2025 January 3, 2025· 10 minutes read Read more articles > User Interface (UI) Design What is UI design? The history of UI design What do UI designers do? What are the most important skills and traits for a UI designer to have? How to become a UI designer What is UI design? User interface (UI) design refers to the visual design of a product’s digital interface, such as an app screen or website. It’s the process of designing the visual and interactive properties of a visual experience, ensuring the interface is both clear for the user to navigate and overall aesthetically pleasing. UI design is a multidisciplinary field involving various elements from visual design, UX design, and graphic design. Users have become familiar with certain layouts and patterns. From the typography to the color, every aspect of a digital screen influences the user’s interaction, and satisfaction, with the app or website. UI design involves the complex art of arranging these elements to guide the user and keep cognitive load to a minimum while creating beautiful, unique experiences that bring the product to life. UI design is so much more than making things look pretty—especially in today’s digitally-led landscape. Most good businesses recognize that exceptional UI design is vital for fostering brand loyalty, recognition, and trust. Customers no longer enjoy well-designed digital experiences; they expect it. In the absence of good design, users will inevitably flee to a competitor. The history of UI design As you might have guessed, the role of the UI designer is relatively recent. In the late 20th century, computing technology was a revolutionary phenomenon, and computers were seen as mostly functional. This all changed in the 80s, when Apple Macintoshes, and Microsoft Windows were released in quick succession. Businesses realized the value in an appealing digital interface when creating memorable user experiences. The early 90’s saw manufacturing begin on a sleeker, more adaptable iteration of the desktop computer with the laptop. The first website went live in 1992, featuring only text with the occasional splash of the default hypertext blue. Other UI elements (color schemes, typography, menu’s, etc.) were gradually introduced into digital experiences throughout the 90’s until the computer software plugin Flash changed the game. For the first time, web designers could create any shape and animation they wanted—all within a single tool. With the introduction of Flash, websites became significantly more engaging. 2007, the year when Apple released the first iPhone, ushered in a golden age for UI design. Boasting sophisticated touchscreen functionality, users would never look at their phones the same again—and UI designers suddenly held a new status. In 2010, web designer Ethan Marcotte created ripples in the UI design world by challenging the approach to mobile UI design. Instead of mobile devices having their own separate websites, he proposed that the same content could be displayed on a desktop—with an adapted layout that optimized the content on a different screen. This revelation was the birth of responsive design, which is now a vital part of UI design. Today, UI design is a booming and ever-evolving field, with even the most senior product designers expected to have some UI design skills in their arsenal. What do UI designers do? UI designers are responsible for ensuring the product’s interface is visually stimulating, easy to navigate, and in line with business goals. They’re also responsible for establishing visual consistency across a digital product through creating style guides and UI pattern libraries. UI designers often work closely with user experience (UX) designers throughout the digital design process. While UX focuses on the optimization of a product for practical use, UI design is all about a product’s look and feel. UI designers will take the foundations laid by the UX designer—the wireframes, user mapping, and information architecture—and bring everything to life with a gorgeous color palette, typography, and shapes. In order to design user-friendly and intuitive interfaces, UI designers keep accessibility and inclusivity in their mind at all times. They’re constantly weighing up each design choice and what it means for the end-user. UI design is all about detail, and UI designers have the complex task of considering all the visual aspects of the user’s journey, including all the individual screens and touchpoints that the user might encounter, from tapping a button to scrolling down a page. What are the most important skills and traits for a UI designer to have? UI designers aren’t just responsible for creating beautiful interfaces. Every design choice, however small it may seem, has an impact on the user and their experience of the product. A career in UI design requires a mixture of both technical and tool-specific know-how together with certain soft skills. To give you a brief overview, some of the most essential UI design skills and traits include: Proficiency in popular industry-standard tools such as Sketch, Adobe XD, Figma, and InVision Knowledge of color theory, UX and interaction design principles, and typography (to name a few) A keen eye for aesthetics and sharp attention to detail—to create harmonious, visually appealing designs, and to be able to spot when something looks “off” An interest in people and human behavior. UI design ties in closely with user experience, so the best UI designers work with empathy, keeping humans at the forefront A certain degree of tech know-how. In addition to working with computer-based tools, UI designers must understand how their designs will operate on different platforms, devices, and screen sizes. It’s therefore useful to be a little tech savvy (especially when liaising with developers) Collaboration and communication. UI designers rarely work in isolation—you’ll collaborate closely with UX designers, product managers, developers, and content / UX writers, so interpersonal skills are a must! For a more in-depth look at the kinds of skills and traits required, it’s worth browsing UI design job ads and descriptions to see which requirements and nice-to-haves frequently crop up. You can also determine whether you’re a good fit for a career in UI design with the help of this guide. How to become a UI designer As with any career path, a career in UI design requires a strong grasp on both the technical and interpersonal skills that will see you slot into a product design team. This includes a mastery of at least one of the popular industry-standard tools, such as Sketch, Adobe XD, Figma, and prototyping tools like InVision. You’ll also need to be well versed in the fundamental methods, theories, and practices of the field, like color theory, typography, and the Gestalt Principles. Before you get started, take stock of your transferable skills. Have any of your previous roles exposed you to design? Do you have experience in creative direction or content creation? If so, it might take less time for you to master the tools and techniques you’ll need. If you’re starting from scratch, you might want to consider opting for a bootcamp course specifically designed to take you from complete beginner to UI designer. We have a full guide on the best UI design bootcamp courses to suit all your needs. It’s important to note that previous design experience is not a prerequisite to starting a career in UI design. In reality, employers are far more interested in your portfolio—and whether you can demonstrate an understanding of core UI design principles—than your formal qualifications. Whatever your goals are, why not get the ball rolling by familiarizing yourself with the industry? Here on the CareerFoundry blog, we’ve got you covered with comprehensive UI design guides and hot takes on industry trends. You can also head to our YouTube channel to check out our various tutorials or follow our Instagram account for daily inspiration. Here are some other ways you can immerse yourself in UI design: Try your hand at designing an app from scratch with a free UI short course Check out examples of UI design for portfolio inspiration Enroll in a UI design program or bootcamp course that offers mentorship and career support Join an upcoming online event and network with like-minded tech-hopefuls What is UI design? User interface (UI) design refers to the visual design of a product’s digital interface, such as an app screen or website. It’s the process of designing the visual and interactive properties of a visual experience, ensuring the interface is both clear for the user to navigate and overall aesthetically pleasing. UI design is a multidisciplinary field involving various elements from visual design, UX design, and graphic design. Users have become familiar with certain layouts and patterns. From the typography to the color, every aspect of a digital screen influences the user’s interaction, and satisfaction, with the app or website. UI design involves the complex art of arranging these elements to guide the user and keep cognitive load to a minimum while creating beautiful, unique experiences that bring the product to life. UI design is so much more than making things look pretty—especially in today’s digitally-led landscape. Most good businesses recognize that exceptional UI design is vital for fostering brand loyalty, recognition, and trust. Customers no longer enjoy well-designed digital experiences; they expect it. In the absence of good design, users will inevitably flee to a competitor. The history of UI design As you might have guessed, the role of the UI designer is relatively recent. In the late 20th century, computing technology was a revolutionary phenomenon, and computers were seen as mostly functional. This all changed in the 80s, when Apple Macintoshes, and Microsoft Windows were released in quick succession. Businesses realized the value in an appealing digital interface when creating memorable user experiences. The early 90’s saw manufacturing begin on a sleeker, more adaptable iteration of the desktop computer with the laptop. The first website went live in 1992, featuring only text with the occasional splash of the default hypertext blue. Other UI elements (color schemes, typography, menu’s, etc.) were gradually introduced into digital experiences throughout the 90’s until the computer software plugin Flash changed the game. For the first time, web designers could create any shape and animation they wanted—all within a single tool. With the introduction of Flash, websites became significantly more engaging. 2007, the year when Apple released the first iPhone, ushered in a golden age for UI design. Boasting sophisticated touchscreen functionality, users would never look at their phones the same again—and UI designers suddenly held a new status. In 2010, web designer Ethan Marcotte created ripples in the UI design world by challenging the approach to mobile UI design. Instead of mobile devices having their own separate websites, he proposed that the same content could be displayed on a desktop—with an adapted layout that optimized the content on a different screen. This revelation was the birth of responsive design, which is now a vital part of UI design. Today, UI design is a booming and ever-evolving field, with even the most senior product designers expected to have some UI design skills in their arsenal. What do UI designers do? UI designers are responsible for ensuring the product’s interface is visually stimulating, easy to navigate, and in line with business goals. They’re also responsible for establishing visual consistency across a digital product through creating style guides and UI pattern libraries. UI designers often work closely with user experience (UX) designers throughout the digital design process. While UX focuses on the optimization of a product for practical use, UI design is all about a product’s look and feel. UI designers will take the foundations laid by the UX designer—the wireframes, user mapping, and information architecture—and bring everything to life with a gorgeous color palette, typography, and shapes. In order to design user-friendly and intuitive interfaces, UI designers keep accessibility and inclusivity in their mind at all times. They’re constantly weighing up each design choice and what it means for the end-user. UI design is all about detail, and UI designers have the complex task of considering all the visual aspects of the user’s journey, including all the individual screens and touchpoints that the user might encounter, from tapping a button to scrolling down a page. What are the most important skills and traits for a UI designer to have? UI designers aren’t just responsible for creating beautiful interfaces. Every design choice, however small it may seem, has an impact on the user and their experience of the product. A career in UI design requires a mixture of both technical and tool-specific know-how together with certain soft skills. To give you a brief overview, some of the most essential UI design skills and traits include: Proficiency in popular industry-standard tools such as Sketch, Adobe XD, Figma, and InVision Knowledge of color theory, UX and interaction design principles, and typography (to name a few) A keen eye for aesthetics and sharp attention to detail—to create harmonious, visually appealing designs, and to be able to spot when something looks “off” An interest in people and human behavior. UI design ties in closely with user experience, so the best UI designers work with empathy, keeping humans at the forefront A certain degree of tech know-how. In addition to working with computer-based tools, UI designers must understand how their designs will operate on different platforms, devices, and screen sizes. It’s therefore useful to be a little tech savvy (especially when liaising with developers) Collaboration and communication. UI designers rarely work in isolation—you’ll collaborate closely with UX designers, product managers, developers, and content / UX writers, so interpersonal skills are a must! For a more in-depth look at the kinds of skills and traits required, it’s worth browsing UI design job ads and descriptions to see which requirements and nice-to-haves frequently crop up. You can also determine whether you’re a good fit for a career in UI design with the help of this guide. How to become a UI designer As with any career path, a career in UI design requires a strong grasp on both the technical and interpersonal skills that will see you slot into a product design team. This includes a mastery of at least one of the popular industry-standard tools, such as Sketch, Adobe XD, Figma, and prototyping tools like InVision. You’ll also need to be well versed in the fundamental methods, theories, and practices of the field, like color theory, typography, and the Gestalt Principles. Before you get started, take stock of your transferable skills. Have any of your previous roles exposed you to design? Do you have experience in creative direction or content creation? If so, it might take less time for you to master the tools and techniques you’ll need. If you’re starting from scratch, you might want to consider opting for a bootcamp course specifically designed to take you from complete beginner to UI designer. We have a full guide on the best UI design bootcamp courses to suit all your needs. It’s important to note that previous design experience is not a prerequisite to starting a career in UI design. In reality, employers are far more interested in your portfolio—and whether you can demonstrate an understanding of core UI design principles—than your formal qualifications. Whatever your goals are, why not get the ball rolling by familiarizing yourself with the industry? Here on the CareerFoundry blog, we’ve got you covered with comprehensive UI design guides and hot takes on industry trends. You can also head to our YouTube channel to check out our various tutorials or follow our Instagram account for daily inspiration. Here are some other ways you can immerse yourself in UI design: Try your hand at designing an app from scratch with a free UI short course Check out examples of UI design for portfolio inspiration Enroll in a UI design program or bootcamp course that offers mentorship and career support Join an upcoming online event and network with like-minded tech-hopefuls All articles UI Design #### The 12 (Best) Free UI Kits to Know About November 20, 2023· 7 minutes read UI Design #### Why Is the TikTok UI So Good? Its Incredible Success Explained October 9, 2023· 10 minutes read UI Design #### Khroma: The Groundbreaking AI Design Tool Explained October 6, 2023· 7 minutes read UI Design #### The 10 Best AI Tools for UI Design August 29, 2023· 8 minutes read UI Design #### How To Use ChatGPT for UI Design: The 9 Best Prompts August 29, 2023· 7 minutes read UI Design #### The UI Design Job Quiz: Which UI Design Role Is for Me? August 21, 2023· 3 minutes read UI Design #### The Impact of AI on UI: Why AI Won’t Replace UI Designers August 28, 2023· 9 minutes read UI Design #### Style Tiles: Everything You Need to Know June 12, 2023· 11 minutes read UI Design #### Game UI Design: Everything You Need To Know May 12, 2023· 14 minutes read Read more articles > Career Change #### Are CareerFoundry Mentors and Tutors Legit? Here’s How We Ensure Top-Quality Support March 10, 2025· 10 minutes read Career Change #### What is an AVGS voucher? A Comprehensive English Guide December 5, 2024· 5 minutes read Data Analytics #### 7 Best Data Warehouse Tools to Explore in 2025 December 18, 2024· 9 minutes read Data Analytics #### 8 of the Best Data Analyst Courses in Germany & How You Could Take Them for Free May 15, 2024· 16 minutes read Read more articles > UI Design #### Game UI Design: Everything You Need To Know May 12, 2023· 14 minutes read Career Change #### What is an AVGS voucher? A Comprehensive English Guide December 5, 2024· 5 minutes read Data Analytics #### 7 Best Data Warehouse Tools to Explore in 2025 December 18, 2024· 9 minutes read Data Analytics #### 8 of the Best Data Analyst Courses in Germany & How You Could Take Them for Free May 15, 2024· 16 minutes read Web Development #### Meet the Mentors: How I Found My Way into Coding May 14, 2024· 10 minutes read Read more articles > What is CareerFoundry? CareerFoundry is an online school for people looking to switch to a rewarding career in tech. Select a program, get paired with an expert mentor and tutor, and become a job-ready designer, developer, or analyst from scratch, or your money back. Learn more about our programs programs to change your career Product Design UX Design UI Design Web Development Data Analytics Digital Marketing Product Management Introductory Courses Intro to Product Design Intro to UX Design Intro to UI Design Intro to Frontend Development Intro to Data Analytics Intro to Digital Marketing Intro to Product Management advanced courses Voice User Interface Design UI for UX Designers Frontend Development for Designers Animation for UI Designers Python for Web Developers Cloud Computing for Web Developers Machine Learning with Python Data Visualizations with Python company About Us Job Guarantee For Businesses Media Jobs at CareerFoundry Become a Mentor Editorial Policy Hire our Grads Career Services Got questions? Ask Olivia Thank you for your message. We'll get back to you shortly. Ask Olivia We'd love to hear from you! Connect with a program advisor terms and conditions | privacy policy | cookie policy | imprint | security",
      "title": "Explore UI Design | The CareerFoundry Blog Courses Learn with us Our graduates Online Events Blog Login Courses ✕ Programs to change your career Product Design new UX Design UI Design Full-Stack Web Development Data Analytics Digital Marketing Product Management Agentur für Arbeit programs Product Design AfA new UX Design AfA UI Design AfA Full-Stack Web Development AfA Data Analytics AfA Data Analytics with German AfA Digital Marketing AfA Product Management AfA Data Analytics (Deutsch) AfA new Introductory courses Intro to Product Design new Intro to UX Design Intro to UI Design Intro to Frontend Development Intro to Data Analytics Intro to Digital Marketing Intro to Product Management Advanced courses Voice User Interface Design UI for UX Designers Frontend Development for Designers Animation for UI Designers Python for Web Developers Cloud Computing for Web Devs Machine Learning with Python Data Visualizations with Python Learn with CareerFoundry ✕ ##### Learn online, not alone Our career-change programs are designed to take you from beginner to pro in your tech career—with personalized support every step of the way. How it works ##### Individualized mentorship Nurture your inner tech pro with personalized guidance from not one, but two industry experts. They’ll provide feedback, support, and advice as you build your new career. Meet our mentors ##### Job Guarantee We back our programs with a job guarantee: Follow our career advice, and you’ll land a job within 6 months of graduation, or you’ll get your money back. Get the details ##### Personal career coaching Build a career you love with 1:1 help from a career specialist who knows the job market in your area! Identify your skills, refine your portfolio, and attract the right employers. Explore our career services Our graduates ✕ ##### Graduate outcomes Our graduates come from all walks of life. Whether they’re starting from scratch or upskilling, they have one thing in common: They go on to forge careers they love. Meet our grads ##### Looking for tech talent? If you want easy recruiting from a global pool of skilled candidates, we’re here to help. Our graduates are highly skilled, motivated, and prepared for impactful careers in tech. Hire our grads ✕ Courses Programs to change your career Product Design UX Design UI Design Full-Stack Web Development Data Analytics Digital Marketing Product Management Agentur für Arbeit programs Product Design AfA new UX Design AfA UI Design AfA Full-Stack Web Development AfA Data Analytics AfA Data Analytics with German AfA Digital Marketing AfA Product Management AfA Data Analytics (Deutsch) AfA new Introductory courses Intro to Product Design new Intro to UX Design Intro to UI Design Intro to Frontend Development Intro to Data Analytics Intro to Digital Marketing Intro to Product Management Advanced courses Voice User Interface Design UI for UX Designers Frontend Development for Designers Animation for UI Designers Python for Web Developers Cloud Computing for Web Devs Machine Learning with Python Data Visualizations with Python Learn with us How it works Meet our mentors Job guarantee Career services Our graduates Graduate outcomes Hire our grads Online Events Blog Login UX Design Web Development Data Analytics Student Stories More Categories Digital Marketing Product Design Product Management UI Design Career Change UX Design Web Development More Categories Data Analytics Student Stories Digital Marketing Product Design Product Management UI Design Career Change See our blog categories UX Design Web Development Data Analytics Student Stories Digital Marketing Product Design Product Management UI Design Career Change Start your free UI design course Start your free UI design course UI Design User interface (UI) design is the process of designing the visual interfaces of digital products, most commonly websites and app screens, to facilitate user interaction. Featured articles UI Design #### Game UI Design: Everything You Need To Know May 12, 2023· 14 minutes read UI Design #### How to Become a UI Designer With No Experience November 7, 2023· 7 minutes read UX Design #### The Difference Between UX and UI Design: A Beginner’s Guide February 19, 2025· 21 minutes read UI Design #### 8 Examples of the Best UI Websites Design in 2025 May 10, 2023· 16 minutes read UI Design #### These Are the 9 Best UI Design Courses in 2025 January 3, 2025· 10 minutes read UI Design #### How to Become a User Interface (UI) Designer: A Step-by-Step Guide for 2025 December 8, 2023· 32 minutes read UI Design #### The Best UI Design Certification Programs June 7, 2023· 17 minutes read UI Design #### Are UI Designers In Demand in 2025? Here’s The Current Industry Outlook December 16, 2024· 8 minutes read UI Design #### How Much Will I Earn as a UI Designer? Your Salary Guide for 2025 December 17, 2024· 5 minutes read UI Design #### What Is Typography, and Why Is It Important? A Beginner’s Guide May 11, 2023· 14 minutes read UI Design #### Game UI Design: Everything You Need To Know May 12, 2023· 14 minutes read UI Design #### How to Become a UI Designer With No Experience November 7, 2023· 7 minutes read UX Design #### The Difference Between UX and UI Design: A Beginner’s Guide February 19, 2025· 21 minutes read UI Design #### 8 Examples of the Best UI Websites Design in 2025 May 10, 2023· 16 minutes read UI Design #### These Are the 9 Best UI Design Courses in 2025 January 3, 2025· 10 minutes read Read more articles > User Interface (UI) Design What is UI design? The history of UI design What do UI designers do? What are the most important skills and traits for a UI designer to have? How to become a UI designer What is UI design? User interface (UI) design refers to the visual design of a product’s digital interface, such as an app screen or website. It’s the process of designing the visual and interactive properties of a visual experience, ensuring the interface is both clear for the user to navigate and overall aesthetically pleasing. UI design is a multidisciplinary field involving various elements from visual design, UX design, and graphic design. Users have become familiar with certain layouts and patterns. From the typography to the color, every aspect of a digital screen influences the user’s interaction, and satisfaction, with the app or website. UI design involves the complex art of arranging these elements to guide the user and keep cognitive load to a minimum while creating beautiful, unique experiences that bring the product to life. UI design is so much more than making things look pretty—especially in today’s digitally-led landscape. Most good businesses recognize that exceptional UI design is vital for fostering brand loyalty, recognition, and trust. Customers no longer enjoy well-designed digital experiences; they expect it. In the absence of good design, users will inevitably flee to a competitor. The history of UI design As you might have guessed, the role of the UI designer is relatively recent. In the late 20th century, computing technology was a revolutionary phenomenon, and computers were seen as mostly functional. This all changed in the 80s, when Apple Macintoshes, and Microsoft Windows were released in quick succession. Businesses realized the value in an appealing digital interface when creating memorable user experiences. The early 90’s saw manufacturing begin on a sleeker, more adaptable iteration of the desktop computer with the laptop. The first website went live in 1992, featuring only text with the occasional splash of the default hypertext blue. Other UI elements (color schemes, typography, menu’s, etc.) were gradually introduced into digital experiences throughout the 90’s until the computer software plugin Flash changed the game. For the first time, web designers could create any shape and animation they wanted—all within a single tool. With the introduction of Flash, websites became significantly more engaging. 2007, the year when Apple released the first iPhone, ushered in a golden age for UI design. Boasting sophisticated touchscreen functionality, users would never look at their phones the same again—and UI designers suddenly held a new status. In 2010, web designer Ethan Marcotte created ripples in the UI design world by challenging the approach to mobile UI design. Instead of mobile devices having their own separate websites, he proposed that the same content could be displayed on a desktop—with an adapted layout that optimized the content on a different screen. This revelation was the birth of responsive design, which is now a vital part of UI design. Today, UI design is a booming and ever-evolving field, with even the most senior product designers expected to have some UI design skills in their arsenal. What do UI designers do? UI designers are responsible for ensuring the product’s interface is visually stimulating, easy to navigate, and in line with business goals. They’re also responsible for establishing visual consistency across a digital product through creating style guides and UI pattern libraries. UI designers often work closely with user experience (UX) designers throughout the digital design process. While UX focuses on the optimization of a product for practical use, UI design is all about a product’s look and feel. UI designers will take the foundations laid by the UX designer—the wireframes, user mapping, and information architecture—and bring everything to life with a gorgeous color palette, typography, and shapes. In order to design user-friendly and intuitive interfaces, UI designers keep accessibility and inclusivity in their mind at all times. They’re constantly weighing up each design choice and what it means for the end-user. UI design is all about detail, and UI designers have the complex task of considering all the visual aspects of the user’s journey, including all the individual screens and touchpoints that the user might encounter, from tapping a button to scrolling down a page. What are the most important skills and traits for a UI designer to have? UI designers aren’t just responsible for creating beautiful interfaces. Every design choice, however small it may seem, has an impact on the user and their experience of the product. A career in UI design requires a mixture of both technical and tool-specific know-how together with certain soft skills. To give you a brief overview, some of the most essential UI design skills and traits include: Proficiency in popular industry-standard tools such as Sketch, Adobe XD, Figma, and InVision Knowledge of color theory, UX and interaction design principles, and typography (to name a few) A keen eye for aesthetics and sharp attention to detail—to create harmonious, visually appealing designs, and to be able to spot when something looks “off” An interest in people and human behavior. UI design ties in closely with user experience, so the best UI designers work with empathy, keeping humans at the forefront A certain degree of tech know-how. In addition to working with computer-based tools, UI designers must understand how their designs will operate on different platforms, devices, and screen sizes. It’s therefore useful to be a little tech savvy (especially when liaising with developers) Collaboration and communication. UI designers rarely work in isolation—you’ll collaborate closely with UX designers, product managers, developers, and content / UX writers, so interpersonal skills are a must! For a more in-depth look at the kinds of skills and traits required, it’s worth browsing UI design job ads and descriptions to see which requirements and nice-to-haves frequently crop up. You can also determine whether you’re a good fit for a career in UI design with the help of this guide. How to become a UI designer As with any career path, a career in UI design requires a strong grasp on both the technical and interpersonal skills that will see you slot into a product design team. This includes a mastery of at least one of the popular industry-standard tools, such as Sketch, Adobe XD, Figma, and prototyping tools like InVision. You’ll also need to be well versed in the fundamental methods, theories, and practices of the field, like color theory, typography, and the Gestalt Principles. Before you get started, take stock of your transferable skills. Have any of your previous roles exposed you to design? Do you have experience in creative direction or content creation? If so, it might take less time for you to master the tools and techniques you’ll need. If you’re starting from scratch, you might want to consider opting for a bootcamp course specifically designed to take you from complete beginner to UI designer. We have a full guide on the best UI design bootcamp courses to suit all your needs. It’s important to note that previous design experience is not a prerequisite to starting a career in UI design. In reality, employers are far more interested in your portfolio—and whether you can demonstrate an understanding of core UI design principles—than your formal qualifications. Whatever your goals are, why not get the ball rolling by familiarizing yourself with the industry? Here on the CareerFoundry blog, we’ve got you covered with comprehensive UI design guides and hot takes on industry trends. You can also head to our YouTube channel to check out our various tutorials or follow our Instagram account for daily inspiration. Here are some other ways you can immerse yourself in UI design: Try your hand at designing an app from scratch with a free UI short course Check out examples of UI design for portfolio inspiration Enroll in a UI design program or bootcamp course that offers mentorship and career support Join an upcoming online event and network with like-minded tech-hopefuls What is UI design? User interface (UI) design refers to the visual design of a product’s digital interface, such as an app screen or website. It’s the process of designing the visual and interactive properties of a visual experience, ensuring the interface is both clear for the user to navigate and overall aesthetically pleasing. UI design is a multidisciplinary field involving various elements from visual design, UX design, and graphic design. Users have become familiar with certain layouts and patterns. From the typography to the color, every aspect of a digital screen influences the user’s interaction, and satisfaction, with the app or website. UI design involves the complex art of arranging these elements to guide the user and keep cognitive load to a minimum while creating beautiful, unique experiences that bring the product to life. UI design is so much more than making things look pretty—especially in today’s digitally-led landscape. Most good businesses recognize that exceptional UI design is vital for fostering brand loyalty, recognition, and trust. Customers no longer enjoy well-designed digital experiences; they expect it. In the absence of good design, users will inevitably flee to a competitor. The history of UI design As you might have guessed, the role of the UI designer is relatively recent. In the late 20th century, computing technology was a revolutionary phenomenon, and computers were seen as mostly functional. This all changed in the 80s, when Apple Macintoshes, and Microsoft Windows were released in quick succession. Businesses realized the value in an appealing digital interface when creating memorable user experiences. The early 90’s saw manufacturing begin on a sleeker, more adaptable iteration of the desktop computer with the laptop. The first website went live in 1992, featuring only text with the occasional splash of the default hypertext blue. Other UI elements (color schemes, typography, menu’s, etc.) were gradually introduced into digital experiences throughout the 90’s until the computer software plugin Flash changed the game. For the first time, web designers could create any shape and animation they wanted—all within a single tool. With the introduction of Flash, websites became significantly more engaging. 2007, the year when Apple released the first iPhone, ushered in a golden age for UI design. Boasting sophisticated touchscreen functionality, users would never look at their phones the same again—and UI designers suddenly held a new status. In 2010, web designer Ethan Marcotte created ripples in the UI design world by challenging the approach to mobile UI design. Instead of mobile devices having their own separate websites, he proposed that the same content could be displayed on a desktop—with an adapted layout that optimized the content on a different screen. This revelation was the birth of responsive design, which is now a vital part of UI design. Today, UI design is a booming and ever-evolving field, with even the most senior product designers expected to have some UI design skills in their arsenal. What do UI designers do? UI designers are responsible for ensuring the product’s interface is visually stimulating, easy to navigate, and in line with business goals. They’re also responsible for establishing visual consistency across a digital product through creating style guides and UI pattern libraries. UI designers often work closely with user experience (UX) designers throughout the digital design process. While UX focuses on the optimization of a product for practical use, UI design is all about a product’s look and feel. UI designers will take the foundations laid by the UX designer—the wireframes, user mapping, and information architecture—and bring everything to life with a gorgeous color palette, typography, and shapes. In order to design user-friendly and intuitive interfaces, UI designers keep accessibility and inclusivity in their mind at all times. They’re constantly weighing up each design choice and what it means for the end-user. UI design is all about detail, and UI designers have the complex task of considering all the visual aspects of the user’s journey, including all the individual screens and touchpoints that the user might encounter, from tapping a button to scrolling down a page. What are the most important skills and traits for a UI designer to have? UI designers aren’t just responsible for creating beautiful interfaces. Every design choice, however small it may seem, has an impact on the user and their experience of the product. A career in UI design requires a mixture of both technical and tool-specific know-how together with certain soft skills. To give you a brief overview, some of the most essential UI design skills and traits include: Proficiency in popular industry-standard tools such as Sketch, Adobe XD, Figma, and InVision Knowledge of color theory, UX and interaction design principles, and typography (to name a few) A keen eye for aesthetics and sharp attention to detail—to create harmonious, visually appealing designs, and to be able to spot when something looks “off” An interest in people and human behavior. UI design ties in closely with user experience, so the best UI designers work with empathy, keeping humans at the forefront A certain degree of tech know-how. In addition to working with computer-based tools, UI designers must understand how their designs will operate on different platforms, devices, and screen sizes. It’s therefore useful to be a little tech savvy (especially when liaising with developers) Collaboration and communication. UI designers rarely work in isolation—you’ll collaborate closely with UX designers, product managers, developers, and content / UX writers, so interpersonal skills are a must! For a more in-depth look at the kinds of skills and traits required, it’s worth browsing UI design job ads and descriptions to see which requirements and nice-to-haves frequently crop up. You can also determine whether you’re a good fit for a career in UI design with the help of this guide. How to become a UI designer As with any career path, a career in UI design requires a strong grasp on both the technical and interpersonal skills that will see you slot into a product design team. This includes a mastery of at least one of the popular industry-standard tools, such as Sketch, Adobe XD, Figma, and prototyping tools like InVision. You’ll also need to be well versed in the fundamental methods, theories, and practices of the field, like color theory, typography, and the Gestalt Principles. Before you get started, take stock of your transferable skills. Have any of your previous roles exposed you to design? Do you have experience in creative direction or content creation? If so, it might take less time for you to master the tools and techniques you’ll need. If you’re starting from scratch, you might want to consider opting for a bootcamp course specifically designed to take you from complete beginner to UI designer. We have a full guide on the best UI design bootcamp courses to suit all your needs. It’s important to note that previous design experience is not a prerequisite to starting a career in UI design. In reality, employers are far more interested in your portfolio—and whether you can demonstrate an understanding of core UI design principles—than your formal qualifications. Whatever your goals are, why not get the ball rolling by familiarizing yourself with the industry? Here on the CareerFoundry blog, we’ve got you covered with comprehensive UI design guides and hot takes on industry trends. You can also head to our YouTube channel to check out our various tutorials or follow our Instagram account for daily inspiration. Here are some other ways you can immerse yourself in UI design: Try your hand at designing an app from scratch with a free UI short course Check out examples of UI design for portfolio inspiration Enroll in a UI design program or bootcamp course that offers mentorship and career support Join an upcoming online event and network with like-minded tech-hopefuls All articles UI Design #### The 12 (Best) Free UI Kits to Know About November 20, 2023· 7 minutes read UI Design #### Why Is the TikTok UI So Good? Its Incredible Success Explained October 9, 2023· 10 minutes read UI Design #### Khroma: The Groundbreaking AI Design Tool Explained October 6, 2023· 7 minutes read UI Design #### The 10 Best AI Tools for UI Design August 29, 2023· 8 minutes read UI Design #### How To Use ChatGPT for UI Design: The 9 Best Prompts August 29, 2023· 7 minutes read UI Design #### The UI Design Job Quiz: Which UI Design Role Is for Me? August 21, 2023· 3 minutes read UI Design #### The Impact of AI on UI: Why AI Won’t Replace UI Designers August 28, 2023· 9 minutes read UI Design #### Style Tiles: Everything You Need to Know June 12, 2023· 11 minutes read UI Design #### Game UI Design: Everything You Need To Know May 12, 2023· 14 minutes read Read more articles > Career Change #### Are CareerFoundry Mentors and Tutors Legit? Here’s How We Ensure Top-Quality Support March 10, 2025· 10 minutes read Career Change #### What is an AVGS voucher? A Comprehensive English Guide December 5, 2024· 5 minutes read Data Analytics #### 7 Best Data Warehouse Tools to Explore in 2025 December 18, 2024· 9 minutes read Data Analytics #### 8 of the Best Data Analyst Courses in Germany & How You Could Take Them for Free May 15, 2024· 16 minutes read Read more articles > UI Design #### Game UI Design: Everything You Need To Know May 12, 2023· 14 minutes read Career Change #### What is an AVGS voucher? A Comprehensive English Guide December 5, 2024· 5 minutes read Data Analytics #### 7 Best Data Warehouse Tools to Explore in 2025 December 18, 2024· 9 minutes read Data Analytics #### 8 of the Best Data Analyst Courses in Germany & How You Could Take Them for Free May 15, 2024· 16 minutes read Web Development #### Meet the Mentors: How I Found My Way into Coding May 14, 2024· 10 minutes read Read more articles > What is CareerFoundry? CareerFoundry is an online school for people looking to switch to a rewarding career in tech. Select a program, get paired with an expert mentor and tutor, and become a job-ready designer, developer, or analyst from scratch, or your money back. Learn more about our programs programs to change your career Product Design UX Design UI Design Web Development Data Analytics Digital Marketing Product Management Introductory Courses Intro to Product Design Intro to UX Design Intro to UI Design Intro to Frontend Development Intro to Data Analytics Intro to Digital Marketing Intro to Product Management advanced courses Voice User Interface Design UI for UX Designers Frontend Development for Designers Animation for UI Designers Python for Web Developers Cloud Computing for Web Developers Machine Learning with Python Data Visualizations with Python company About Us Job Guarantee For Businesses Media Jobs at CareerFoundry Become a Mentor Editorial Policy Hire our Grads Career Services Got questions? Ask Olivia Thank you for your message. We'll get back to you shortly. Ask Olivia We'd love to hear from you! Connect with a program advisor terms and conditions | privacy policy | cookie policy | imprint | security"
    }
  ],
  "researchSummary": "The customization options vary for each Mythic cosmetic, ranging from different colors and weapon styles to other visual upgrades like different\n\nCreating Custom User Interface! - Make Your First Game Tutorial Series | Part 8 HypeHype: Play & Create Games 7800 subscribers 35 likes 1651 views 6 May 2024 Learn how to create custom User Interface to your game! We'll be adding timer and health bar that follows the player. This tutorial series goes into detail on how to make your first adventure game. If you have any questions, feel free to leave them in the comments! What we made in Part 7 https://hypehype.com/r/hN2jtxIUbJgp46 What we made in Part 8 https://hypehype.com/r/kZMIdjMv9xz4WT Join our Discord: ➡️ https://discord.gg/HypeHype Get HypeHype early access and start creating games with no coding on your phone or tablet! https://hypehype.com Tutorials: https://youtube.com/playlist?list=PLw4nhkGycwNHTR29Nh3GHSCqwR824tmaf Learn docs: https://wiki.hypehype.com Social media: https://twitter.com/HypeHypeGameApp https://tiktok.com/@hypehype_gameapp https://facebook.com/HypeHypeGameApp https://instagram.com/hypehype_gameapp HypeHype is a new revolutionary way to create, remix and play games on your phone. Our mission is to empower anyone to become a game maker through simple, fun and free tools on mobile devices. We are in early access. Jump in to become a game creator and shape the future of gaming! Get access: https://hypehype.com/get-access Time stamps: 00:00 Intro 00:23 Adding User Interface 01:20 User Interface Editor 02:00 Importance of Alignment 03:08 Creating Timer UI 05:58 Adding Time Input 07:07 Connecting Time 07:35 Polishing Time UI 08:57 Custom Health Bar 09:45 Adding Position Input 10:03 Adding Progress Bar 11:08 Adding Custom Inputs 11:21 Connecting Values 12:05 Making UI Follow Player 14:04 Outro 14:30 Bloopers #hypehype #devlog #gamedev #gaming 10 comments Welcome back creators to the Making a Game in Hype Hype Tutorial Series. In the last video, we created",
  "coreTopic": "The main topic seems to revolve around game development and customization. It covers aspects of creating and customizing user interfaces for games, specifically through a platform called HypeHype. The content highlights the process of designing various visual elements like health bars and timers, while also promoting the ease of game creation on mobile devices. The overall vibe is about empowering users to become game makers with tools that require no coding skills.",
  "brandInfo": "\n      Website: https://helpy-ui.com/\n      Brand: helpy-ui\n      Products: No product images\n      Description: Like a warm blanket for your projects - all the good stuff developers actually use\n\n      Documents: No documents\n      Logo: No logo\n      Posts/Videos: No posts/videos\n      Taglines: None\n      Colours: No colours\n      Country: global\n    ",
  "youtubeVideo": null,
  "internalLinks": [
    "/blog/tips-for-growth",
    "/resources/ecommerce-guide"
  ],
  "references": [
    "https://helpy-ui.com/",
    "https://www.reddit.com/r/Competitiveoverwatch/comments/19612zr/what_do_you_guys_think_about_being_able_to_change/",
    "https://www.youtube.com/watch?v=qAI-GQNFnkU",
    "https://www.sketch.com/blog/game-ui-design/",
    "https://blizzardwatch.com/2022/03/23/games-ui-change-gameplay/",
    "https://www.youtube.com/watch?v=f1spX7Qtv7k",
    "https://www.youtube.com/watch?v=x1LxffCk3RU",
    "https://medium.com/@nicolaskraj/designing-efficient-user-interfaces-for-games-be20b516f1c2",
    "https://careerfoundry.com/en/blog/ui-design/game-ui-design"
  ],
  "existingPosts": "",
  "targetKeywords": [],
  "timestamp": "2025-03-12",
  "nudge": "amn6b"
}