{
  "initialUrl": "https://foundertoolkit.org/",
  "initialResearchSummary": "FOUNDER TOOLKIT. UNLOCKING OUR METHODS. Proven concepts, case studies and training we offer for free to help you grow your business. What are you looking for? Key concepts & case studies. Interested in a specific topic? Come Behind the Counter and learn something new. ... https: //behindthecounter",
  "researchResults": [
    {
      "url": "https://www.forbes.com/councils/forbesagencycouncil/2024/10/21/17-expert-tips-to-get-creativity-flowing-when-inspiration-runs-dry/",
      "content": "6 Strategies For Agencies To Thrive In The 2025 Tech-Driven Landscape Subscribe To Newsletters 6 Strategies For Agencies To Thrive In The 2025 Tech-Driven Landscape ByAmy Packard Berry for Forbes Agency Council COUNCIL POST | Membership (fee-based) Save Article Leadership 6 Strategies For Agencies To Thrive In The 2025 Tech-Driven Landscape ByAmy Packard Berry, Forbes Councils Member. for Forbes Agency Council COUNCIL POST Expertise from Forbes Councils members, operated under license. Opinions expressed are those of the author. | Membership (fee-based) Nov 05, 2024, 07:30am EST Save Article Amy Packard Berry, Executive Vice President MarCom, Sparkpr. getty As we approach 2025, agency leaders and CMOs face a landscape transformed by technological leaps and evolving client and audience expectations. This isn't just change; it's a revolution in how agencies deliver value. Below are six strategies shaping the marketing landscape and how to leverage them. Invest in developing an AI-forward culture. Generative AI has unlocked new possibilities, and its next phase is as a strategic partner. Here are a few ways to start shifting your teams to be more AI-focused: • Create a C-suite position for AI strategy and ethics. • See where AI can have the biggest impact. Maybe that's data analysis, content creation or media buying. For example, our agency is rapidly deploying an AI-powered PR platform where we can streamline newsjacking and trend identification, optimize targeted media outreach and enhance our content creation. • AI should augment, not replace, human creativity. Our commitment to AI excellence includes weekly AI training syncs that keep our team at the forefront of emerging capabilities and a dedicated Slack channel as a hub for sharing discoveries, best practices and success stories. Overhaul your data strategy. In 2025, mass marketing will be a relic. Clients will demand campaigns that speak to individual consumer preferences with unprecedented precision. Real-time personalization across all touchpoints will become the norm, requiring marketers to increase their data collection and activation capabilities. To begin overhauling your data strategy, consider the following: • Explore innovative methods for first-party data collection, such as QR code campaigns, interactive content or immersive AR experiences. As an example, we combined QR codes with pop-open cards—greeting cards with a surprise message hidden inside—to create a twist on traditional business cards and have transformed them into tools for first-party data collection. • Invest heavily in advanced analytics to turn cross-channel data into actionable, real-time insights. I've found it helpful to invest in a customized dashboard with deep insights into customer behavior. • Develop frameworks for ethical data use that build trust with clients and consumers. Rethink content creation capabilities. I believe the content landscape will soon be unrecognizable from just a few years ago. Short-form video will dominate, while AR and VR will enable immersive experiences. AI-generated content will be ubiquitous, but human creativity will be the key differentiator. • Invest in cutting-edge video production and AR/VR technologies. • Develop strategies to seamlessly integrate AI-generated content with human expertise. For instance, you could create custom GPTs for specific clients and tasks. Writing LinkedIn thought leadership posts for a CEO? Load their previous blog posts, speaking engagement transcripts and social media posts into the GPT’s knowledge bank to capture the CEO’s voice and key themes. Skilled marketers can then add the human touch to make it sing. Embrace CX as an integral part of marketing. With the rise of interactive content and personalized customer journeys, the lines between marketing and customer experience will blur. Clients will seek agencies that deliver holistic strategies encompassing the customer journey—from awareness to advocacy. To achieve this, you'll need to invest in data analytics and the right technology, as well as develop expertise in experience design and customer journey mapping (or hire someone who does). Consider partnerships or acquisitions to build CX capabilities rapidly. For example, a midsized digital marketing agency might partner with a boutique UX design firm to offer more comprehensive services, such as creating end-to-end digital experiences that seamlessly blend marketing messaging with user-friendly interfaces. Specialize to stand out. As marketing complexity increases, 2025 will see a premium placed on deep, specialized expertise. Clients will seek agencies with unparalleled knowledge in specific industries or marketing disciplines. • Identify your unique strengths and double down. • Develop thought leadership that cements your position as the go-to expert in your chosen niches. As one of the first agencies focused on Silicon Valley, we have long-standing expertise in emerging technology, from the dot-com boom through the birth of AI and quantum computing. • Build a network of complementary specialist agencies to offer comprehensive solutions while maintaining focus. Restructure for maximum flexibility. The ability to pivot quickly separates leaders from followers. In 2025, agility will be more than a buzzword. • Implement agile methodologies across all operations—from content creation to client onboarding. • Consider creating an internal \"disruption team\" to anticipate and adapt to emerging trends. • Develop a culture of continuous learning and innovation. Establish quarterly innovation sprints where teams collaborate to solve emerging client challenges or pilot new marketing technologies. We hold Creative Spark Sprints, bringing together the collective agency brain trust to tackle specific client challenges. The Path Forward As marketing evolves, agencies must stay at the forefront of innovation while championing their unique value. Technological advances will soon become the baseline, but human creativity and relationships remain vital differentiators. By embracing these trends and balancing technology with the human touch, your agency can thrive in 2025 and beyond. Forbes Agency Council is an invitation-only community for executives in successful public relations, media strategy, creative and advertising agencies. Do I qualify? Follow me on Twitter or LinkedIn. Check out my website. Editorial StandardsForbes Accolades LOADING VIDEO PLAYER... FORBES’ FEATURED Video © 2025 Forbes Media LLC. All Rights Reserved. AdChoices Privacy Statement Do Not Sell or Share My Personal Information Limit the Use of My Sensitive Personal Information Privacy Preferences Digital Terms of Sale Terms of Service Contact Us Send Us Feedback Report a Security Issue Jobs At Forbes Reprints & Permissions Forbes Press Room Advertise",
      "title": "6 Strategies For Agencies To Thrive In The 2025 Tech-Driven Landscape Subscribe To Newsletters 6 Strategies For Agencies To Thrive In The 2025 Tech-Driven Landscape ByAmy Packard Berry for Forbes Agency Council COUNCIL POST | Membership (fee-based) Save Article Leadership 6 Strategies For Agencies To Thrive In The 2025 Tech-Driven Landscape ByAmy Packard Berry, Forbes Councils Member. for Forbes Agency Council COUNCIL POST Expertise from Forbes Councils members, operated under license. Opinions expressed are those of the author. | Membership (fee-based) Nov 05, 2024, 07:30am EST Save Article Amy Packard Berry, Executive Vice President MarCom, Sparkpr. getty As we approach 2025, agency leaders and CMOs face a landscape transformed by technological leaps and evolving client and audience expectations. This isn't just change; it's a revolution in how agencies deliver value. Below are six strategies shaping the marketing landscape and how to leverage them. Invest in developing an AI-forward culture. Generative AI has unlocked new possibilities, and its next phase is as a strategic partner. Here are a few ways to start shifting your teams to be more AI-focused: • Create a C-suite position for AI strategy and ethics. • See where AI can have the biggest impact. Maybe that's data analysis, content creation or media buying. For example, our agency is rapidly deploying an AI-powered PR platform where we can streamline newsjacking and trend identification, optimize targeted media outreach and enhance our content creation. • AI should augment, not replace, human creativity. Our commitment to AI excellence includes weekly AI training syncs that keep our team at the forefront of emerging capabilities and a dedicated Slack channel as a hub for sharing discoveries, best practices and success stories. Overhaul your data strategy. In 2025, mass marketing will be a relic. Clients will demand campaigns that speak to individual consumer preferences with unprecedented precision. Real-time personalization across all touchpoints will become the norm, requiring marketers to increase their data collection and activation capabilities. To begin overhauling your data strategy, consider the following: • Explore innovative methods for first-party data collection, such as QR code campaigns, interactive content or immersive AR experiences. As an example, we combined QR codes with pop-open cards—greeting cards with a surprise message hidden inside—to create a twist on traditional business cards and have transformed them into tools for first-party data collection. • Invest heavily in advanced analytics to turn cross-channel data into actionable, real-time insights. I've found it helpful to invest in a customized dashboard with deep insights into customer behavior. • Develop frameworks for ethical data use that build trust with clients and consumers. Rethink content creation capabilities. I believe the content landscape will soon be unrecognizable from just a few years ago. Short-form video will dominate, while AR and VR will enable immersive experiences. AI-generated content will be ubiquitous, but human creativity will be the key differentiator. • Invest in cutting-edge video production and AR/VR technologies. • Develop strategies to seamlessly integrate AI-generated content with human expertise. For instance, you could create custom GPTs for specific clients and tasks. Writing LinkedIn thought leadership posts for a CEO? Load their previous blog posts, speaking engagement transcripts and social media posts into the GPT’s knowledge bank to capture the CEO’s voice and key themes. Skilled marketers can then add the human touch to make it sing. Embrace CX as an integral part of marketing. With the rise of interactive content and personalized customer journeys, the lines between marketing and customer experience will blur. Clients will seek agencies that deliver holistic strategies encompassing the customer journey—from awareness to advocacy. To achieve this, you'll need to invest in data analytics and the right technology, as well as develop expertise in experience design and customer journey mapping (or hire someone who does). Consider partnerships or acquisitions to build CX capabilities rapidly. For example, a midsized digital marketing agency might partner with a boutique UX design firm to offer more comprehensive services, such as creating end-to-end digital experiences that seamlessly blend marketing messaging with user-friendly interfaces. Specialize to stand out. As marketing complexity increases, 2025 will see a premium placed on deep, specialized expertise. Clients will seek agencies with unparalleled knowledge in specific industries or marketing disciplines. • Identify your unique strengths and double down. • Develop thought leadership that cements your position as the go-to expert in your chosen niches. As one of the first agencies focused on Silicon Valley, we have long-standing expertise in emerging technology, from the dot-com boom through the birth of AI and quantum computing. • Build a network of complementary specialist agencies to offer comprehensive solutions while maintaining focus. Restructure for maximum flexibility. The ability to pivot quickly separates leaders from followers. In 2025, agility will be more than a buzzword. • Implement agile methodologies across all operations—from content creation to client onboarding. • Consider creating an internal \"disruption team\" to anticipate and adapt to emerging trends. • Develop a culture of continuous learning and innovation. Establish quarterly innovation sprints where teams collaborate to solve emerging client challenges or pilot new marketing technologies. We hold Creative Spark Sprints, bringing together the collective agency brain trust to tackle specific client challenges. The Path Forward As marketing evolves, agencies must stay at the forefront of innovation while championing their unique value. Technological advances will soon become the baseline, but human creativity and relationships remain vital differentiators. By embracing these trends and balancing technology with the human touch, your agency can thrive in 2025 and beyond. Forbes Agency Council is an invitation-only community for executives in successful public relations, media strategy, creative and advertising agencies. Do I qualify? Follow me on Twitter or LinkedIn. Check out my website. Editorial StandardsForbes Accolades LOADING VIDEO PLAYER... FORBES’ FEATURED Video © 2025 Forbes Media LLC. All Rights Reserved. AdChoices Privacy Statement Do Not Sell or Share My Personal Information Limit the Use of My Sensitive Personal Information Privacy Preferences Digital Terms of Sale Terms of Service Contact Us Send Us Feedback Report a Security Issue Jobs At Forbes Reprints & Permissions Forbes Press Room Advertise"
    },
    {
      "url": "https://www.linkedin.com/pulse/13-ways-get-your-creative-juices-flowing-when-youre-feeling-karp",
      "content": "Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. Sign in to view more content Create your free account or sign in to continue your search Welcome back or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. LinkedIn LinkedIn is better on the app Don’t have the app? Get it in the Microsoft Store. Less, but better: a new look at Dieter Rams Sarah Karp Design leader and unofficial Vegemite spokesperson I recently attended a screening of the Dieter Rams documentary that the fabulous Tash Keuneman hosted. You may recognize Dieter Rams as the designer of iconic Braun and Vitsœ products, and as the creator of the 10 principles of good design. The documentary focused on Rams' career and the impact his principles have had over the years. It also revealed the invaluable role he played in getting designers a seat at the product leadership table. Here are a few of my favorite takeaways. The non-principle: Good design is a team effort Rams is credited with an enormous number of innovations and products; however, he regularly emphasizes his reliance on and partnership with the designers and engineers around him. He worked closely with Hans Gugelot and Dr. Fritz Eichler, Braun’s first Head of Design, to create the radios, turntables, and alarm clocks Braun became so known for in the 1950s and 60s. When Gugelot wanted to build a turntable lid out of metal, the engineering team scoffed and pointed out that such a move would have made the entire device rattle. It was only after this pushback that the designers had the idea of using a plexiglass lid, which set the foundation for the product’s global success. For a handheld record player (the “first walkman”), Rams credits engineering for making his design vision (which placed the stylus below rather than on top of the record) a reality. All wasn’t perfect during those decades of great teamwork – women, for instance, had no place in the design department. We've certainly come a long way from there. While the teams we work on and for have thankfully become even more diverse, this non-principle still rings true. By approaching teamwork with a respect for each other’s crafts and a healthy amount of candid feedback, we can create products and experiences people will be talking about decades from now. Connection with people and place Rams cares a lot about the relationship between design and the environment. He dedicated the ninth principle of good design to this need to do better for our planet after realizing how much his plastic products (and their production methods) were contributing to pollution and climate change. There’s a poignant moment in the documentary that shows Rams looking around at a busy intersection in London. In his narration over the scene, he speaks about his distress over the lack of connection people have with each other and their environment. By burying ourselves in digital experiences, he wonders what we’re missing from the physical world around us. There’s no shortage of discourse around the “devices/social media/whatever technology are ruining society” topic. While it’s not all doom and gloom (technology has, after all, given us the ability to instantly connect people across the world), it’s also a good reminder for us to stop and reflect. What responsibility do we have as employees of a software company to shape a society in which we (and future generations) can flourish? How can we continue to ship great products while also enabling users of those products to reengage with the people and physical world around them? Honesty and trust One of the key parts of forming a connection (with each other and the teams who use our products) is establishing trust. Enter Rams' sixth principle of good design. When I reflect on this principle, I reflect back on the work my teams have shipped over the years. We've introduced a lot of change to our products recently and, at times, I think we missed the mark on communicating those changes to our customers. As content designers, it's our job to make sure we're being honest and upfront with customers about any functionality or experience changes. While we should believe in our innovations and the value we were providing, we should also pause before we push those innovations on our customers before they're prepared for them. Less, but better Towards the end of the documentary, Rams passes through an exhibition of his work at a design museum and continues into a gallery full of other iconic modern furniture pieces. When asked about any designers whose work he doesn’t like, he chuckles and launches into an amusing commentary on the pointlessness of Frank Gehry’s cardboard chairs and Ettore Sottsass' room divider. Gehry and Sottsass have created iconic works, though they certainly weren’t designing just for the essentials, as Rams' tenth principle tells us to. There’s something so eloquent about “Less, but better”. It resonates well with our desire to create simply powerful products, to be lean with how much we document those products, and our need to say “no” to the wrong things in order to focus on the right ones. So, are Ram’s principles of good design still good enough? They seem to be. And his lessons about teamwork, connection, honesty, and simplicity definitely are. I highly recommend tracking down a screening of the documentary, and revisiting Rams' principles in the context of your own design work. To view or add a comment, sign in More articles by Sarah Karp I went to TED and all I got was this life-changing experience Read on for a recap of the TED conference experience, spicy discourse around AI, and some of the many takeaways I'm… 13 ways to get your creative juices flowing when you’re feeling uninspired As a followup to 3 questions to ask to spark your team’s creativity, here’s a Friday the 13th list post with 13 tips… Ask these 3 quick questions to spark your team’s creativity… When we fail to tap into our inner creatives, we engage less with our work (bad for us) and end up shipping less… Redesigning my approach to learning In this post, I reflect on what it's like to learn while managing a new craft, how perfectionism and self-doubt almost… Sign in Stay updated on your professional world By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. New to LinkedIn? Join now Insights from the community Others also viewed Studio Nima Winter News 2024 Crafting an Environmentally Conscious Exhibit: Essential Tips for an Eco-Friendly Expo Stand ICONICA presents the colours and tones that encapsulate a world that has changed Material Change Innovating for sustainability with Oserth’s Eco-Friendly design Cutting Costs and Carbon What if we replaced leather with pineapple? Or how to reduce the environmental impact of interior car coatings Art in Sustainability. Nurturing the Creative Path towards a Harmonious Future Designing a Sustainable Future: The Power of Humanity-Centered Design (HCD+) 100% Recyclable Exhibition Stands Explore topics",
      "title": "Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. Sign in to view more content Create your free account or sign in to continue your search Welcome back or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. LinkedIn LinkedIn is better on the app Don’t have the app? Get it in the Microsoft Store. Less, but better: a new look at Dieter Rams Sarah Karp Design leader and unofficial Vegemite spokesperson I recently attended a screening of the Dieter Rams documentary that the fabulous Tash Keuneman hosted. You may recognize Dieter Rams as the designer of iconic Braun and Vitsœ products, and as the creator of the 10 principles of good design. The documentary focused on Rams' career and the impact his principles have had over the years. It also revealed the invaluable role he played in getting designers a seat at the product leadership table. Here are a few of my favorite takeaways. The non-principle: Good design is a team effort Rams is credited with an enormous number of innovations and products; however, he regularly emphasizes his reliance on and partnership with the designers and engineers around him. He worked closely with Hans Gugelot and Dr. Fritz Eichler, Braun’s first Head of Design, to create the radios, turntables, and alarm clocks Braun became so known for in the 1950s and 60s. When Gugelot wanted to build a turntable lid out of metal, the engineering team scoffed and pointed out that such a move would have made the entire device rattle. It was only after this pushback that the designers had the idea of using a plexiglass lid, which set the foundation for the product’s global success. For a handheld record player (the “first walkman”), Rams credits engineering for making his design vision (which placed the stylus below rather than on top of the record) a reality. All wasn’t perfect during those decades of great teamwork – women, for instance, had no place in the design department. We've certainly come a long way from there. While the teams we work on and for have thankfully become even more diverse, this non-principle still rings true. By approaching teamwork with a respect for each other’s crafts and a healthy amount of candid feedback, we can create products and experiences people will be talking about decades from now. Connection with people and place Rams cares a lot about the relationship between design and the environment. He dedicated the ninth principle of good design to this need to do better for our planet after realizing how much his plastic products (and their production methods) were contributing to pollution and climate change. There’s a poignant moment in the documentary that shows Rams looking around at a busy intersection in London. In his narration over the scene, he speaks about his distress over the lack of connection people have with each other and their environment. By burying ourselves in digital experiences, he wonders what we’re missing from the physical world around us. There’s no shortage of discourse around the “devices/social media/whatever technology are ruining society” topic. While it’s not all doom and gloom (technology has, after all, given us the ability to instantly connect people across the world), it’s also a good reminder for us to stop and reflect. What responsibility do we have as employees of a software company to shape a society in which we (and future generations) can flourish? How can we continue to ship great products while also enabling users of those products to reengage with the people and physical world around them? Honesty and trust One of the key parts of forming a connection (with each other and the teams who use our products) is establishing trust. Enter Rams' sixth principle of good design. When I reflect on this principle, I reflect back on the work my teams have shipped over the years. We've introduced a lot of change to our products recently and, at times, I think we missed the mark on communicating those changes to our customers. As content designers, it's our job to make sure we're being honest and upfront with customers about any functionality or experience changes. While we should believe in our innovations and the value we were providing, we should also pause before we push those innovations on our customers before they're prepared for them. Less, but better Towards the end of the documentary, Rams passes through an exhibition of his work at a design museum and continues into a gallery full of other iconic modern furniture pieces. When asked about any designers whose work he doesn’t like, he chuckles and launches into an amusing commentary on the pointlessness of Frank Gehry’s cardboard chairs and Ettore Sottsass' room divider. Gehry and Sottsass have created iconic works, though they certainly weren’t designing just for the essentials, as Rams' tenth principle tells us to. There’s something so eloquent about “Less, but better”. It resonates well with our desire to create simply powerful products, to be lean with how much we document those products, and our need to say “no” to the wrong things in order to focus on the right ones. So, are Ram’s principles of good design still good enough? They seem to be. And his lessons about teamwork, connection, honesty, and simplicity definitely are. I highly recommend tracking down a screening of the documentary, and revisiting Rams' principles in the context of your own design work. To view or add a comment, sign in More articles by Sarah Karp I went to TED and all I got was this life-changing experience Read on for a recap of the TED conference experience, spicy discourse around AI, and some of the many takeaways I'm… 13 ways to get your creative juices flowing when you’re feeling uninspired As a followup to 3 questions to ask to spark your team’s creativity, here’s a Friday the 13th list post with 13 tips… Ask these 3 quick questions to spark your team’s creativity… When we fail to tap into our inner creatives, we engage less with our work (bad for us) and end up shipping less… Redesigning my approach to learning In this post, I reflect on what it's like to learn while managing a new craft, how perfectionism and self-doubt almost… Sign in Stay updated on your professional world By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement, Privacy Policy, and Cookie Policy. New to LinkedIn? Join now Insights from the community Others also viewed Studio Nima Winter News 2024 Crafting an Environmentally Conscious Exhibit: Essential Tips for an Eco-Friendly Expo Stand ICONICA presents the colours and tones that encapsulate a world that has changed Material Change Innovating for sustainability with Oserth’s Eco-Friendly design Cutting Costs and Carbon What if we replaced leather with pineapple? Or how to reduce the environmental impact of interior car coatings Art in Sustainability. Nurturing the Creative Path towards a Harmonious Future Designing a Sustainable Future: The Power of Humanity-Centered Design (HCD+) 100% Recyclable Exhibition Stands Explore topics"
    },
    {
      "url": "https://flocksy.com/resources/10-ways-for-designers-to-keep-their-creative-juices-flowing/",
      "content": "10 Ways for Designers to Keep their Creative Juices Flowing - Flocksy Flocksy How it works Pricing Portfolio Solutions Graphic Design Video Editing Motion Graphics Custom Illustration Copywriting Virtual Assistants Website Development Case Studies Menu How it works Pricing Portfolio Solutions Graphic Design Video Editing Motion Graphics Custom Illustration Copywriting Virtual Assistants Website Development Case Studies Sign up Login Home / Resources / 10 Ways for Designers to Keep their Creative Juices Flowing THE RESOURCE CENTER How Flocksy Works Flocksy’s User Permissions Available Project Categories & Subcategories Do You Love Flocksy? Leave Us A Review! Brand Buckets And How To Use Them How Does Inviting Team Members Work? View All Business How To Lead Successful Virtual Meetings: 5 Guidelines How To Juggle The Perfect Schedule For Remote Work (5 Easy Steps) How To Set Small Business Goals How To Have Secure Passwords Five Steps For Achieving Diversity And Inclusion In The Workforce View All Graphic Design Character Design Basics What is Avatar Design? Mascot Design 101 Custom Line Art Basics The Ultimate Guide to Running a Successful Video Editing Project View All Startups The 19 Best Places To List Your Startup (UPDATED 2022) Kick Start Your New Businesses With These 8 Digital Marketing Practices 5 Benefits Of Outsourcing Turn Your Business Idea Into A Career Operating A Successful Small Business View All Web Development The 8 Most Common Web Design Blunders To Avoid. 6 Website Designs To Get You Inspired How To Make A Great Landing Page 5 Ways Your Business Website Shapes Your Brand A Beginner’s Guide To Web Hosting View All Copywriting Why Google Hates AI, And Why Your Business Needs Flocksy’s Amazing Copywriting Services The 10 Best Copywriting Resources For Budding Copywriters 6 Writing Tips To Help You Write Fast And Professionally How To Proofread To Perfect Your Copywriting Skills 3 Tools You Need To Be A Successful Writer View All Marketing Top 7 Tips For Promoting Your Business During A Recession The Benefits Of Outsourcing Your Social Media Projects What Is The Difference Between Sales And Marketing? Six Tips To Improve Your YouTube Viewership How to Improve Your Email Open Rate View All Company Reviews Design Pickle vs Flocksy Penji vs Flocksy Kimp vs Flocksy Hatchwise: A Logo Design Contest Site Review Hero Design vs Flocksy View All Video Editing How To Hire A YouTube Editor Grow Your Social Media Video Following With These 6 Easy Tips Best Video Editing Tips For Beginners A Guide To Becoming A Freelance Video Editor 4 Things No One Tells You About Video Marketing View All Menu How Flocksy Works Flocksy’s User Permissions Available Project Categories & Subcategories Do You Love Flocksy? Leave Us A Review! Brand Buckets And How To Use Them How Does Inviting Team Members Work? View All Business How To Lead Successful Virtual Meetings: 5 Guidelines How To Juggle The Perfect Schedule For Remote Work (5 Easy Steps) How To Set Small Business Goals How To Have Secure Passwords Five Steps For Achieving Diversity And Inclusion In The Workforce View All Graphic Design Character Design Basics What is Avatar Design? Mascot Design 101 Custom Line Art Basics The Ultimate Guide to Running a Successful Video Editing Project View All Startups The 19 Best Places To List Your Startup (UPDATED 2022) Kick Start Your New Businesses With These 8 Digital Marketing Practices 5 Benefits Of Outsourcing Turn Your Business Idea Into A Career Operating A Successful Small Business View All Web Development The 8 Most Common Web Design Blunders To Avoid. 6 Website Designs To Get You Inspired How To Make A Great Landing Page 5 Ways Your Business Website Shapes Your Brand A Beginner’s Guide To Web Hosting View All Copywriting Why Google Hates AI, And Why Your Business Needs Flocksy’s Amazing Copywriting Services The 10 Best Copywriting Resources For Budding Copywriters 6 Writing Tips To Help You Write Fast And Professionally How To Proofread To Perfect Your Copywriting Skills 3 Tools You Need To Be A Successful Writer View All Marketing Top 7 Tips For Promoting Your Business During A Recession The Benefits Of Outsourcing Your Social Media Projects What Is The Difference Between Sales And Marketing? Six Tips To Improve Your YouTube Viewership How to Improve Your Email Open Rate View All Company Reviews Design Pickle vs Flocksy Penji vs Flocksy Kimp vs Flocksy Hatchwise: A Logo Design Contest Site Review Hero Design vs Flocksy View All Video Editing How To Hire A YouTube Editor Grow Your Social Media Video Following With These 6 Easy Tips Best Video Editing Tips For Beginners A Guide To Becoming A Freelance Video Editor 4 Things No One Tells You About Video Marketing View All Search Search Close this search box. Home / Resources / Design Home / Resources / 10 Ways for Designers to Keep their Creative Juices Flowing 10 Ways for Designers to Keep their Creative Juices Flowing Chynna Cordevilla Designers should make a habit of collecting, organizing, and making lists of their own ideas, strengths, and points of improvement, as well as their favorite designs. These can be used as viable sources for inspiration and reference during creative blocks. Designers should immerse themselves in the world around them– the art, the activities, the people, the knowledge. They will find that the world is bigger than their bubble, and learning more about it can help inspire and spur creativity. Designers should know when to take a step back from their design work in order to give them a fresher and clearer perspective. Any designer can tell you about how inevitable creative blocks tend to be. You can create idea after idea in the span of a week, and then create absolutely nothing you would deem “creative” in the next. These kinds of lapses happen even to the best designers, with their effects ranging from a ruined work schedule to a design hiatus altogether– the latter of which cannot be an option for most. The occasional creativity limbo can be problematic for designers, especially for those with very tight deadlines. Fortunately, there are a lot of mental tools and habits designers like you can introduce into your creative routines to get your minds flowing with those much-needed design juices again. Curate designs you love. Storing designs you strongly admire is a habit that can help you in the long run. There are a lot of places you can look for beautiful designs; the internet is definitely full of them, but you can go as far as photographing local posters, city scapes, and billboards you want to emulate. The real trick is, when you find yourself stuck in a rut, simply scroll through your virtual gallery of design inspirations. You’ll find yourself slowly filling up with the needed motivation to kick start your creativity. Take note that a key part of curation is organization. Organize these designs by designer, by method, or by color– whichever will help you the most when the time comes. Apps such as Pinterest have features that can help you with organization. It also helps to deconstruct each design as you go through them. Ask yourself questions like, “What makes this design attractive to me?” or “What elements were used to create balance in this design?”. You never know what new insight you might uncover while going through your curated content. Log the things you need to improve on. The blank canvas is one of the designer’s biggest enemies; the vastness of possibilities that can go into a design can block you from actually wringing out a good idea. It is one of the notable ironies in design, but it presents a real problem to many designers. Keeping a list of things you want to improve in your work helps limit that broadness, constantly presenting new challenges to overcome, hence giving your brain specific key points to focus on. Each piece of work you produce should be a new challenge, after all. Anything less than that keeps your creativity at risk of stagnation. Go for a deep dive into your previous work. Although keeping track of the things you need to improve on is important, observing all the positive contributions you made in your previous designs lies on the opposite side of the same coin. Going through your previous designs not only gives you insight on your strong points as a designer, but it also jogs your memory on useful design processes that you might have already forgotten. Either way, taking a leap back to memory lane can help give you that boost you need to power through your creative block. Keep track of even the smallest ideas. Wherever you go, whatever you do, your mind is constantly wandering. It is during these wandering times when gems tend to come up. Big or small, something about them will captivate you… even days, months, or years down the line. Skimming through ideas you’ve made during your idle time will definitely help inspire you and get your creativity up and running. The most important part of this tip is to always write that idea down. Grab yourself the nearest pen and paper– or even better, your favorite note-taking app– and write (or draw) that idea down in the most descriptive way you possibly can. If you don’t do this, chances are, you won’t remember what made it a notable idea in the first place, and your brain will scrap it altogether. Most of the time, the idea comes in a very convoluted form, giving you something that looks like remnants of a “light bulb moment”. It is still important that you keep track of these kinds of ideas, as these can be refined later on. Dabble in artistic media. The designs and ideas you’ve collected and very carefully organized may not be enough for your journey back into the creative state of mind. Surrounding yourself with similar styles and ideas might even prove saturating, at times. In this particular case, try taking a step outside of your own bubble by dabbling into new artistic media. You can watch films highly acclaimed for their cinematography, listen to various moods of music, or even visit art museums. These activities will not only inspire you to create art, but will also help you get fresher yet rawer ideas you’ve yet to translate into your design medium. Try something new. Taking the previous tip a step further, trying something new will definitely get you out of your comfort zone and help you learn things faster. Not fond of typography? Maybe you should give it a try. Do you find gradients tricky? Perhaps now is the time to use them. It doesn’t even have to be a design-related change. You can try the new restaurant downtown, or maybe take a walk instead of hailing a cab. So many new thoughts and ideas can come from just the slightest change in your routine. You will definitely learn a thing or two. Keeping your mind open to learning creates opportunities for creativity to spike. Socialize. Two heads are better than one, especially in the case of creative blocks. Curating other people’s designs is one thing, but actually talking to fellow designers and absorbing their tips, feedback, and criticism is a vastly different experience altogether. Join designer communities, attend designer conferences, or simply talk to a designer friend. There is nothing quite like the back-and-forth of speaking your mind and listening to another. If you aren’t fond of face-to-face interactions, you might find more value with online communities and forums. Discord and DeviantArt can get you started with like-minded individuals. The people you interact with aren’t even required to have a background in design. Garnering feedback from various groups of people allows you to get a look at who finds what beautiful– findings which you can definitely apply to your work. Finally, you don’t even have to talk about design. Talk about your day. Talk about current events. Talk about the shows you’ve been watching or the new activities you’ve been doing. One way or another, you’re going to find a new perspective of looking at them through the conversations you make with other people, and that can lead you all the way back to your inspired state. Read design literature. Immerse yourself in literature about design. Subscribe to design blogs, watch design videos. There is always something new to keep those creative gears of yours well-oiled and as good as new. Practice repetition. Even your most repetitive tasks can help you see things in a new light. Practice the mechanical aspect of certain processes you do. If you do this in repetition, as with penmanship, you might find yourself employing a different style and a more efficient process along the way. Take a step back. Sometimes your eyes just need a break from the usual. Taking a huge step back can allow you to look at your predicament with fresher eyes when you step back later on. Take a short walk, or focus on a video game for a couple of minutes, or maybe even watch an episode of that series you’ve always wanted to watch. Give yourself that long and well-deserved sleep. The next day, you will find your creative cells rejuvenated and ready to spew out ideas, as usual. If you feel your creative block is leaning over to the deep end, consider taking a week off with strictly no design work allowed. Traveling is recommended. Conclusion Any good designer can make good designs, but a great designer can conquer even the nastiest of creative blocks and make it work for them. After all, creativity lies not in the patience to wait around for it, but in the approach to get it back. Incorporate these tips into your design habit and you’ll not only crush roadblocks but you’ll find that your design momentum and overall design process will improve significantly. POPULAR ARTICLES: The Top 7 Graphic Design Monthly Subscription Services Table Of Contents Introduction What Is An Unlimited Graphic Design Service? What Is Included In An Unlimited Monthly Subscription? What… The Rise of Unlimited Video Editing There’s no denying that in our current landscape, with the prominence of social media and attention spans getting shorter… 10 Graphic Design Companies Around the World Graphic design is more than just creating eye-catching visuals. It shapes how people see and interact with brands. Around the… ________ 5/5 ________ 5/5 ________ 5/5 ________ 5/5 Flocksy has been the most affordable provider of unlimited creative services since 2016. © 2025 Flocksy LLC Privacy Policy Terms of Service Privacy Policy Terms of Service Categories Graphic Design Copywriting Motion Graphics Video Editing Web Development Graphic Design Copywriting Motion Graphics Video Editing Web Development Custom Illustration Virtiual Assistants Figma Design Canva Design Custom Illustration Virtiual Assistants Figma Design Canva Design Learn More About Us Contact Us Schedule Demo Careers About Us Contact Us Schedule Demo Careers Resources FAQ Freebies Resources Blog Case Studies FAQ Freebies Resources Blog Case Studies Connect With Us Facebook-f Linkedin-in Instagram Twitter Youtube ________ 5/5 ________ 5/5 ________ 5/5 ________ 5/5 Flocksy has been the most affordable provider of unlimited creative services since 2016. © 2025 Flocksy LLC Privacy Policy Terms of Service Privacy Policy Terms of Service Categories Graphic Design Copywriting Motion Graphics Video Editing Web Development Graphic Design Copywriting Motion Graphics Video Editing Web Development Custom Illustration Virtiual Assistants Figma Design Canva Design Custom Illustration Virtiual Assistants Figma Design Canva Design Learn More About Us Contact Us Schedule Demo Careers About Us Contact Us Schedule Demo Careers Resources FAQ Freebies Resources Blog Case Studies FAQ Freebies Resources Blog Case Studies Connect With Us Facebook-f Linkedin-in Instagram Twitter Youtube Manage Cookie Consent We use cookies to ensure you get the best experience. If you continue to use this site, we will assume that you are happy with it. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Ok Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent",
      "title": "10 Ways for Designers to Keep their Creative Juices Flowing - Flocksy Flocksy How it works Pricing Portfolio Solutions Graphic Design Video Editing Motion Graphics Custom Illustration Copywriting Virtual Assistants Website Development Case Studies Menu How it works Pricing Portfolio Solutions Graphic Design Video Editing Motion Graphics Custom Illustration Copywriting Virtual Assistants Website Development Case Studies Sign up Login Home / Resources / 10 Ways for Designers to Keep their Creative Juices Flowing THE RESOURCE CENTER How Flocksy Works Flocksy’s User Permissions Available Project Categories & Subcategories Do You Love Flocksy? Leave Us A Review! Brand Buckets And How To Use Them How Does Inviting Team Members Work? View All Business How To Lead Successful Virtual Meetings: 5 Guidelines How To Juggle The Perfect Schedule For Remote Work (5 Easy Steps) How To Set Small Business Goals How To Have Secure Passwords Five Steps For Achieving Diversity And Inclusion In The Workforce View All Graphic Design Character Design Basics What is Avatar Design? Mascot Design 101 Custom Line Art Basics The Ultimate Guide to Running a Successful Video Editing Project View All Startups The 19 Best Places To List Your Startup (UPDATED 2022) Kick Start Your New Businesses With These 8 Digital Marketing Practices 5 Benefits Of Outsourcing Turn Your Business Idea Into A Career Operating A Successful Small Business View All Web Development The 8 Most Common Web Design Blunders To Avoid. 6 Website Designs To Get You Inspired How To Make A Great Landing Page 5 Ways Your Business Website Shapes Your Brand A Beginner’s Guide To Web Hosting View All Copywriting Why Google Hates AI, And Why Your Business Needs Flocksy’s Amazing Copywriting Services The 10 Best Copywriting Resources For Budding Copywriters 6 Writing Tips To Help You Write Fast And Professionally How To Proofread To Perfect Your Copywriting Skills 3 Tools You Need To Be A Successful Writer View All Marketing Top 7 Tips For Promoting Your Business During A Recession The Benefits Of Outsourcing Your Social Media Projects What Is The Difference Between Sales And Marketing? Six Tips To Improve Your YouTube Viewership How to Improve Your Email Open Rate View All Company Reviews Design Pickle vs Flocksy Penji vs Flocksy Kimp vs Flocksy Hatchwise: A Logo Design Contest Site Review Hero Design vs Flocksy View All Video Editing How To Hire A YouTube Editor Grow Your Social Media Video Following With These 6 Easy Tips Best Video Editing Tips For Beginners A Guide To Becoming A Freelance Video Editor 4 Things No One Tells You About Video Marketing View All Menu How Flocksy Works Flocksy’s User Permissions Available Project Categories & Subcategories Do You Love Flocksy? Leave Us A Review! Brand Buckets And How To Use Them How Does Inviting Team Members Work? View All Business How To Lead Successful Virtual Meetings: 5 Guidelines How To Juggle The Perfect Schedule For Remote Work (5 Easy Steps) How To Set Small Business Goals How To Have Secure Passwords Five Steps For Achieving Diversity And Inclusion In The Workforce View All Graphic Design Character Design Basics What is Avatar Design? Mascot Design 101 Custom Line Art Basics The Ultimate Guide to Running a Successful Video Editing Project View All Startups The 19 Best Places To List Your Startup (UPDATED 2022) Kick Start Your New Businesses With These 8 Digital Marketing Practices 5 Benefits Of Outsourcing Turn Your Business Idea Into A Career Operating A Successful Small Business View All Web Development The 8 Most Common Web Design Blunders To Avoid. 6 Website Designs To Get You Inspired How To Make A Great Landing Page 5 Ways Your Business Website Shapes Your Brand A Beginner’s Guide To Web Hosting View All Copywriting Why Google Hates AI, And Why Your Business Needs Flocksy’s Amazing Copywriting Services The 10 Best Copywriting Resources For Budding Copywriters 6 Writing Tips To Help You Write Fast And Professionally How To Proofread To Perfect Your Copywriting Skills 3 Tools You Need To Be A Successful Writer View All Marketing Top 7 Tips For Promoting Your Business During A Recession The Benefits Of Outsourcing Your Social Media Projects What Is The Difference Between Sales And Marketing? Six Tips To Improve Your YouTube Viewership How to Improve Your Email Open Rate View All Company Reviews Design Pickle vs Flocksy Penji vs Flocksy Kimp vs Flocksy Hatchwise: A Logo Design Contest Site Review Hero Design vs Flocksy View All Video Editing How To Hire A YouTube Editor Grow Your Social Media Video Following With These 6 Easy Tips Best Video Editing Tips For Beginners A Guide To Becoming A Freelance Video Editor 4 Things No One Tells You About Video Marketing View All Search Search Close this search box. Home / Resources / Design Home / Resources / 10 Ways for Designers to Keep their Creative Juices Flowing 10 Ways for Designers to Keep their Creative Juices Flowing Chynna Cordevilla Designers should make a habit of collecting, organizing, and making lists of their own ideas, strengths, and points of improvement, as well as their favorite designs. These can be used as viable sources for inspiration and reference during creative blocks. Designers should immerse themselves in the world around them– the art, the activities, the people, the knowledge. They will find that the world is bigger than their bubble, and learning more about it can help inspire and spur creativity. Designers should know when to take a step back from their design work in order to give them a fresher and clearer perspective. Any designer can tell you about how inevitable creative blocks tend to be. You can create idea after idea in the span of a week, and then create absolutely nothing you would deem “creative” in the next. These kinds of lapses happen even to the best designers, with their effects ranging from a ruined work schedule to a design hiatus altogether– the latter of which cannot be an option for most. The occasional creativity limbo can be problematic for designers, especially for those with very tight deadlines. Fortunately, there are a lot of mental tools and habits designers like you can introduce into your creative routines to get your minds flowing with those much-needed design juices again. Curate designs you love. Storing designs you strongly admire is a habit that can help you in the long run. There are a lot of places you can look for beautiful designs; the internet is definitely full of them, but you can go as far as photographing local posters, city scapes, and billboards you want to emulate. The real trick is, when you find yourself stuck in a rut, simply scroll through your virtual gallery of design inspirations. You’ll find yourself slowly filling up with the needed motivation to kick start your creativity. Take note that a key part of curation is organization. Organize these designs by designer, by method, or by color– whichever will help you the most when the time comes. Apps such as Pinterest have features that can help you with organization. It also helps to deconstruct each design as you go through them. Ask yourself questions like, “What makes this design attractive to me?” or “What elements were used to create balance in this design?”. You never know what new insight you might uncover while going through your curated content. Log the things you need to improve on. The blank canvas is one of the designer’s biggest enemies; the vastness of possibilities that can go into a design can block you from actually wringing out a good idea. It is one of the notable ironies in design, but it presents a real problem to many designers. Keeping a list of things you want to improve in your work helps limit that broadness, constantly presenting new challenges to overcome, hence giving your brain specific key points to focus on. Each piece of work you produce should be a new challenge, after all. Anything less than that keeps your creativity at risk of stagnation. Go for a deep dive into your previous work. Although keeping track of the things you need to improve on is important, observing all the positive contributions you made in your previous designs lies on the opposite side of the same coin. Going through your previous designs not only gives you insight on your strong points as a designer, but it also jogs your memory on useful design processes that you might have already forgotten. Either way, taking a leap back to memory lane can help give you that boost you need to power through your creative block. Keep track of even the smallest ideas. Wherever you go, whatever you do, your mind is constantly wandering. It is during these wandering times when gems tend to come up. Big or small, something about them will captivate you… even days, months, or years down the line. Skimming through ideas you’ve made during your idle time will definitely help inspire you and get your creativity up and running. The most important part of this tip is to always write that idea down. Grab yourself the nearest pen and paper– or even better, your favorite note-taking app– and write (or draw) that idea down in the most descriptive way you possibly can. If you don’t do this, chances are, you won’t remember what made it a notable idea in the first place, and your brain will scrap it altogether. Most of the time, the idea comes in a very convoluted form, giving you something that looks like remnants of a “light bulb moment”. It is still important that you keep track of these kinds of ideas, as these can be refined later on. Dabble in artistic media. The designs and ideas you’ve collected and very carefully organized may not be enough for your journey back into the creative state of mind. Surrounding yourself with similar styles and ideas might even prove saturating, at times. In this particular case, try taking a step outside of your own bubble by dabbling into new artistic media. You can watch films highly acclaimed for their cinematography, listen to various moods of music, or even visit art museums. These activities will not only inspire you to create art, but will also help you get fresher yet rawer ideas you’ve yet to translate into your design medium. Try something new. Taking the previous tip a step further, trying something new will definitely get you out of your comfort zone and help you learn things faster. Not fond of typography? Maybe you should give it a try. Do you find gradients tricky? Perhaps now is the time to use them. It doesn’t even have to be a design-related change. You can try the new restaurant downtown, or maybe take a walk instead of hailing a cab. So many new thoughts and ideas can come from just the slightest change in your routine. You will definitely learn a thing or two. Keeping your mind open to learning creates opportunities for creativity to spike. Socialize. Two heads are better than one, especially in the case of creative blocks. Curating other people’s designs is one thing, but actually talking to fellow designers and absorbing their tips, feedback, and criticism is a vastly different experience altogether. Join designer communities, attend designer conferences, or simply talk to a designer friend. There is nothing quite like the back-and-forth of speaking your mind and listening to another. If you aren’t fond of face-to-face interactions, you might find more value with online communities and forums. Discord and DeviantArt can get you started with like-minded individuals. The people you interact with aren’t even required to have a background in design. Garnering feedback from various groups of people allows you to get a look at who finds what beautiful– findings which you can definitely apply to your work. Finally, you don’t even have to talk about design. Talk about your day. Talk about current events. Talk about the shows you’ve been watching or the new activities you’ve been doing. One way or another, you’re going to find a new perspective of looking at them through the conversations you make with other people, and that can lead you all the way back to your inspired state. Read design literature. Immerse yourself in literature about design. Subscribe to design blogs, watch design videos. There is always something new to keep those creative gears of yours well-oiled and as good as new. Practice repetition. Even your most repetitive tasks can help you see things in a new light. Practice the mechanical aspect of certain processes you do. If you do this in repetition, as with penmanship, you might find yourself employing a different style and a more efficient process along the way. Take a step back. Sometimes your eyes just need a break from the usual. Taking a huge step back can allow you to look at your predicament with fresher eyes when you step back later on. Take a short walk, or focus on a video game for a couple of minutes, or maybe even watch an episode of that series you’ve always wanted to watch. Give yourself that long and well-deserved sleep. The next day, you will find your creative cells rejuvenated and ready to spew out ideas, as usual. If you feel your creative block is leaning over to the deep end, consider taking a week off with strictly no design work allowed. Traveling is recommended. Conclusion Any good designer can make good designs, but a great designer can conquer even the nastiest of creative blocks and make it work for them. After all, creativity lies not in the patience to wait around for it, but in the approach to get it back. Incorporate these tips into your design habit and you’ll not only crush roadblocks but you’ll find that your design momentum and overall design process will improve significantly. POPULAR ARTICLES: The Top 7 Graphic Design Monthly Subscription Services Table Of Contents Introduction What Is An Unlimited Graphic Design Service? What Is Included In An Unlimited Monthly Subscription? What… The Rise of Unlimited Video Editing There’s no denying that in our current landscape, with the prominence of social media and attention spans getting shorter… 10 Graphic Design Companies Around the World Graphic design is more than just creating eye-catching visuals. It shapes how people see and interact with brands. Around the… ________ 5/5 ________ 5/5 ________ 5/5 ________ 5/5 Flocksy has been the most affordable provider of unlimited creative services since 2016. © 2025 Flocksy LLC Privacy Policy Terms of Service Privacy Policy Terms of Service Categories Graphic Design Copywriting Motion Graphics Video Editing Web Development Graphic Design Copywriting Motion Graphics Video Editing Web Development Custom Illustration Virtiual Assistants Figma Design Canva Design Custom Illustration Virtiual Assistants Figma Design Canva Design Learn More About Us Contact Us Schedule Demo Careers About Us Contact Us Schedule Demo Careers Resources FAQ Freebies Resources Blog Case Studies FAQ Freebies Resources Blog Case Studies Connect With Us Facebook-f Linkedin-in Instagram Twitter Youtube ________ 5/5 ________ 5/5 ________ 5/5 ________ 5/5 Flocksy has been the most affordable provider of unlimited creative services since 2016. © 2025 Flocksy LLC Privacy Policy Terms of Service Privacy Policy Terms of Service Categories Graphic Design Copywriting Motion Graphics Video Editing Web Development Graphic Design Copywriting Motion Graphics Video Editing Web Development Custom Illustration Virtiual Assistants Figma Design Canva Design Custom Illustration Virtiual Assistants Figma Design Canva Design Learn More About Us Contact Us Schedule Demo Careers About Us Contact Us Schedule Demo Careers Resources FAQ Freebies Resources Blog Case Studies FAQ Freebies Resources Blog Case Studies Connect With Us Facebook-f Linkedin-in Instagram Twitter Youtube Manage Cookie Consent We use cookies to ensure you get the best experience. If you continue to use this site, we will assume that you are happy with it. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Ok Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://geediting.com/if-your-creative-well-is-dry-these-9-strategies-can-replenish-it/",
      "content": "Blog Details If your creative well is dry, these 9 strategies can replenish it There’s a stark difference between a creative block and a creative drought. A block is temporary, a road bump, while a drought feels like your creative well has run dry. But don’t fret – even the most imaginative minds can hit a rough patch. The good news is, there are strategies to replenish your creative well and get those artistic juices flowing again. Here, I’ll share 9 techniques that have helped me and could also help you refill your well of creativity. In this article titled “If your creative well is dry, these 9 strategies can replenish it”, we’ll dive into some practical methods to reawaken your creativity. So let’s get started! 1) Embrace boredom We live in an era where constant stimulation is at our fingertips. But this non-stop input can actually stifle creativity. Think about it. Those quiet moments when you’re doing nothing – that’s when the mind starts to wander and wonder. That’s when you have the space to think up new ideas. This is where boredom comes into play. Embracing boredom might seem counterintuitive, but it’s just creating space for creativity to flourish. It’s the idea behind those ‘aha’ moments that often come when you’re doing something mundane, like taking a shower or going for a run. So next time you’re in a creative drought, try letting your mind wander without the distraction of screens or tasks. You might be surprised at what bubbles up. Remember, it’s not about being idle for idleness’ sake. It’s about giving your brain the downtime it needs to make unexpected connections and come up with fresh ideas. Give it a try – you might just find that boredom is the missing ingredient to replenishing your creative well. 2) Seek out new experiences Speaking from personal experience, I know that stepping outside of my comfort zone has always sparked my creativity. Here’s one example: a few years ago, I found myself in a creativity drought. I felt stuck, uninspired. Then, on a whim, I decided to take a solo trip to a city I’d never been to before. I was nervous at first, but as soon as I arrived, everything felt fresh and exciting. The unfamiliar sights, the different culture, the new people I met – all these stimuli triggered a surge of fresh ideas and perspectives in me. This trip taught me the importance of seeking out new experiences. It showed me that creativity often comes from places we least expect. So if you’re feeling creatively dry, consider stepping out of your normal routine. Visit a new place, try a new hobby or meet some new people. It might just be the jolt your creative well needs to start flowing again. 3) Get moving It turns out, there’s a strong connection between physical movement and creative thinking. Research shows that regular exercise can boost our cognitive abilities and enhance creativity. It’s not just about getting your heart rate up either. Something as simple as taking a walk can do wonders for your creativity. In fact, a study conducted at Stanford University found that walking increases creative output by an average of 60 percent. So next time your creative well feels dry, try going for a walk or engaging in some form of physical activity. It could be just the thing to get your creative juices flowing again. 4) Create a mood board Visual aids are a fantastic way to spark creativity. One tool that I often turn to is a mood board. A mood board is a collage of images, text, and other pieces that represent your ideas and inspire you. It can be physical, like a bulletin board in your office, or digital, like a Pinterest board. Start by collecting images, quotes, colors, and anything else that resonates with your project or idea. Then, arrange these elements on your board. The process of creating a mood board can help you visualize your thoughts and concepts more clearly. And every time you glance at it, you’ll be reminded of those sparks of inspiration. Related Stories from Global English Editing So if your creative well is running dry, try creating a mood board. It might just help you see things from a new perspective and reignite your creative flame. 5) Change your environment Sometimes, a change of scenery can be a catalyst for creativity. If you’ve been working in the same spot and your creative well has run dry, it might be time for a change. Switching up your environment can disrupt your usual thought patterns and spur new ideas. This could mean rearranging your workspace, working from a coffee shop, or even spending some time in nature. Different environments stimulate different senses and can inspire fresh thoughts and ideas. So don’t underestimate the power of a new setting to replenish your creative well. Give it a go and see how your creativity blossoms. 6) Tap into your emotions Creativity isn’t just about thinking, it’s about feeling too. Emotions are a powerful source of inspiration. Whether it’s joy, sadness, anger, or love, our feelings can be a wellspring of creative ideas. They can guide us to create art that is not only unique but also deeply personal and poignant. So next time you’re feeling creatively dry, try tapping into your emotions. Reflect on what you’re feeling and why. Use those feelings as a starting point for your creative work. Remember, the most meaningful and impactful creations are often those that come from the heart. Let your emotions fuel your creativity, and you might be surprised at the depth and richness of the ideas that flow. 7) Engage in creative rituals I have a little ritual I follow when I sit down to write. I make a cup of tea, light a scented candle, and put on my favorite instrumental music. This ritual signals to my brain that it’s time to get creative. Rituals can be powerful tools for stimulating creativity. They can help us transition from our everyday tasks into a creative mindset. Your ritual could be anything that works for you. Maybe it’s sketching in a notebook for a few minutes every morning, or meditating before you start your work. The key is to find something that puts you in the right frame of mind to create. So if your creative well is running dry, try developing a ritual that signals your brain it’s time to create. 8) Practice mindfulness Mindfulness is the practice of focusing on the present moment without judgment. It’s about being aware of your thoughts, feelings, and surroundings right now. And how does this relate to creativity? Well, mindfulness can help clear the mental clutter that often blocks our creative flow. By focusing on the present, we can quiet the mind and open up space for new ideas to emerge. You can practice mindfulness in many ways. It could be as simple as taking a few deep breaths and paying attention to your senses, or you could try a guided mindfulness meditation. So if your creative well is dry, consider giving mindfulness a try. It might help clear away the mental blockages and let your creativity flow freely again. 9) Give yourself permission to create The most important thing you can do to replenish your creative well is to give yourself the permission to create. Too often, we get caught up in the fear of making something that’s not good enough. But the truth is, creativity isn’t about perfection. It’s about expression, exploration, and the joy of making something from nothing. So let go of those fears and doubts. Embrace the process, rather than fixating on the outcome. Give yourself the permission to create freely, without judgment or expectation. This simple act can open up a wellspring of creativity within you. It can ignite your imagination and inspire you to create like never before. So go ahead, pick up that pen, that paintbrush, that instrument, and create. You have permission. Final thoughts: Creativity is a journey The adventure of creativity is an intricate dance between the mind, the heart, and the world around us. It’s not a finite resource that can be depleted, but rather, a wellspring that can be replenished and nurtured. These nine strategies, from embracing boredom to giving yourself permission to create, are guideposts on your creative journey. They’re not definitive solutions, but pathways to explore when your creative well feels dry. Remember, creativity is inherently a process of exploration and discovery. It thrives not on pressure and expectations, but on curiosity, openness, and the freedom to express. So if you ever find your creative well running dry, take a moment to reflect. Consider these strategies not as quick fixes, but as invitations to rediscover your unique creative rhythm. After all, creativity isn’t about reaching a destination. It’s about enjoying the journey and embracing the unexpected detours along the way. Related Stories from Global English Editing Post navigation Academics & Students Authors & Publishers Businesses & Professionals Quick Links Global English Editing, 2700 Neilson Way, Santa Monica, CA 90405 Site Map | Privacy Policy | Terms and Conditions Follow Us",
      "title": "Blog Details If your creative well is dry, these 9 strategies can replenish it There’s a stark difference between a creative block and a creative drought. A block is temporary, a road bump, while a drought feels like your creative well has run dry. But don’t fret – even the most imaginative minds can hit a rough patch. The good news is, there are strategies to replenish your creative well and get those artistic juices flowing again. Here, I’ll share 9 techniques that have helped me and could also help you refill your well of creativity. In this article titled “If your creative well is dry, these 9 strategies can replenish it”, we’ll dive into some practical methods to reawaken your creativity. So let’s get started! 1) Embrace boredom We live in an era where constant stimulation is at our fingertips. But this non-stop input can actually stifle creativity. Think about it. Those quiet moments when you’re doing nothing – that’s when the mind starts to wander and wonder. That’s when you have the space to think up new ideas. This is where boredom comes into play. Embracing boredom might seem counterintuitive, but it’s just creating space for creativity to flourish. It’s the idea behind those ‘aha’ moments that often come when you’re doing something mundane, like taking a shower or going for a run. So next time you’re in a creative drought, try letting your mind wander without the distraction of screens or tasks. You might be surprised at what bubbles up. Remember, it’s not about being idle for idleness’ sake. It’s about giving your brain the downtime it needs to make unexpected connections and come up with fresh ideas. Give it a try – you might just find that boredom is the missing ingredient to replenishing your creative well. 2) Seek out new experiences Speaking from personal experience, I know that stepping outside of my comfort zone has always sparked my creativity. Here’s one example: a few years ago, I found myself in a creativity drought. I felt stuck, uninspired. Then, on a whim, I decided to take a solo trip to a city I’d never been to before. I was nervous at first, but as soon as I arrived, everything felt fresh and exciting. The unfamiliar sights, the different culture, the new people I met – all these stimuli triggered a surge of fresh ideas and perspectives in me. This trip taught me the importance of seeking out new experiences. It showed me that creativity often comes from places we least expect. So if you’re feeling creatively dry, consider stepping out of your normal routine. Visit a new place, try a new hobby or meet some new people. It might just be the jolt your creative well needs to start flowing again. 3) Get moving It turns out, there’s a strong connection between physical movement and creative thinking. Research shows that regular exercise can boost our cognitive abilities and enhance creativity. It’s not just about getting your heart rate up either. Something as simple as taking a walk can do wonders for your creativity. In fact, a study conducted at Stanford University found that walking increases creative output by an average of 60 percent. So next time your creative well feels dry, try going for a walk or engaging in some form of physical activity. It could be just the thing to get your creative juices flowing again. 4) Create a mood board Visual aids are a fantastic way to spark creativity. One tool that I often turn to is a mood board. A mood board is a collage of images, text, and other pieces that represent your ideas and inspire you. It can be physical, like a bulletin board in your office, or digital, like a Pinterest board. Start by collecting images, quotes, colors, and anything else that resonates with your project or idea. Then, arrange these elements on your board. The process of creating a mood board can help you visualize your thoughts and concepts more clearly. And every time you glance at it, you’ll be reminded of those sparks of inspiration. Related Stories from Global English Editing So if your creative well is running dry, try creating a mood board. It might just help you see things from a new perspective and reignite your creative flame. 5) Change your environment Sometimes, a change of scenery can be a catalyst for creativity. If you’ve been working in the same spot and your creative well has run dry, it might be time for a change. Switching up your environment can disrupt your usual thought patterns and spur new ideas. This could mean rearranging your workspace, working from a coffee shop, or even spending some time in nature. Different environments stimulate different senses and can inspire fresh thoughts and ideas. So don’t underestimate the power of a new setting to replenish your creative well. Give it a go and see how your creativity blossoms. 6) Tap into your emotions Creativity isn’t just about thinking, it’s about feeling too. Emotions are a powerful source of inspiration. Whether it’s joy, sadness, anger, or love, our feelings can be a wellspring of creative ideas. They can guide us to create art that is not only unique but also deeply personal and poignant. So next time you’re feeling creatively dry, try tapping into your emotions. Reflect on what you’re feeling and why. Use those feelings as a starting point for your creative work. Remember, the most meaningful and impactful creations are often those that come from the heart. Let your emotions fuel your creativity, and you might be surprised at the depth and richness of the ideas that flow. 7) Engage in creative rituals I have a little ritual I follow when I sit down to write. I make a cup of tea, light a scented candle, and put on my favorite instrumental music. This ritual signals to my brain that it’s time to get creative. Rituals can be powerful tools for stimulating creativity. They can help us transition from our everyday tasks into a creative mindset. Your ritual could be anything that works for you. Maybe it’s sketching in a notebook for a few minutes every morning, or meditating before you start your work. The key is to find something that puts you in the right frame of mind to create. So if your creative well is running dry, try developing a ritual that signals your brain it’s time to create. 8) Practice mindfulness Mindfulness is the practice of focusing on the present moment without judgment. It’s about being aware of your thoughts, feelings, and surroundings right now. And how does this relate to creativity? Well, mindfulness can help clear the mental clutter that often blocks our creative flow. By focusing on the present, we can quiet the mind and open up space for new ideas to emerge. You can practice mindfulness in many ways. It could be as simple as taking a few deep breaths and paying attention to your senses, or you could try a guided mindfulness meditation. So if your creative well is dry, consider giving mindfulness a try. It might help clear away the mental blockages and let your creativity flow freely again. 9) Give yourself permission to create The most important thing you can do to replenish your creative well is to give yourself the permission to create. Too often, we get caught up in the fear of making something that’s not good enough. But the truth is, creativity isn’t about perfection. It’s about expression, exploration, and the joy of making something from nothing. So let go of those fears and doubts. Embrace the process, rather than fixating on the outcome. Give yourself the permission to create freely, without judgment or expectation. This simple act can open up a wellspring of creativity within you. It can ignite your imagination and inspire you to create like never before. So go ahead, pick up that pen, that paintbrush, that instrument, and create. You have permission. Final thoughts: Creativity is a journey The adventure of creativity is an intricate dance between the mind, the heart, and the world around us. It’s not a finite resource that can be depleted, but rather, a wellspring that can be replenished and nurtured. These nine strategies, from embracing boredom to giving yourself permission to create, are guideposts on your creative journey. They’re not definitive solutions, but pathways to explore when your creative well feels dry. Remember, creativity is inherently a process of exploration and discovery. It thrives not on pressure and expectations, but on curiosity, openness, and the freedom to express. So if you ever find your creative well running dry, take a moment to reflect. Consider these strategies not as quick fixes, but as invitations to rediscover your unique creative rhythm. After all, creativity isn’t about reaching a destination. It’s about enjoying the journey and embracing the unexpected detours along the way. Related Stories from Global English Editing Post navigation Academics & Students Authors & Publishers Businesses & Professionals Quick Links Global English Editing, 2700 Neilson Way, Santa Monica, CA 90405 Site Map | Privacy Policy | Terms and Conditions Follow Us"
    },
    {
      "url": "https://medium.com/@missafayres/what-to-do-when-the-creative-juices-run-dry-8e97b346d9a7",
      "content": "Published Time: 2014-05-15T22:55:14.547Z What To Do When the Creative Juices Run Dry | by Andrea Ayres | Medium Open in app Sign up Sign in Write Sign up Sign in What To Do When the Creative Juices Run Dry Andrea Ayres ·Follow 6 min read · May 15, 2014 -- Listen Share Okay, all I need are some new ideas. Yep. Here we go… get ready… 4 hours later. I’m out of ideas. What do I do now? Where does creativity come from anyway? Do you remember the 1990s when everyone was wondering if they were right brained or left brained? The popular theory was that right-brained people were more creative and artistic and left-brained people were more logical and analytical. Yah, that’s not really how creativity works. Creativity doesn’t happen in any one place but rather in what researchers call “hubs.” These hubs have far more connectivity to other areas of the brain which encourages the quick transfer of information over the vast distances of the brains networks. adapted from: http://scottbarrykaufman.com/wp-content/uploads/2013/08/Bressler_Large-Scale_Brain_10.pdf When you are first creating, you want to draw those broad imaginative strokes—that’s activating the Default Mode Network. When, however, you need to actually implement and fine tune these ideas, you use Central-Executive Network. It’s not just any one network all the time. There was this study that examined the minds of freestyle rappers to see how creative thoughts spring up in real time. Improvisation resulted from increased activation of their Default Mode Network and decreased activation in the more cognitive portion of the brain. The networks were in constant communication with one another via the Salience Network. Creativity feels more difficult to us, which is why some of us just chalk it up to not having the right brain for it. But really, it’s just about letting go. The other part of the creative pie Your brain is assailed with a bunch of input every single day. If you were to try and process every bit of information that your brain receives, it would be very difficult to get anything done. The brain uses a variety of filters to screen out this information and one of them has been found to pertain directly to creativity. It’s called latent inhibition (LI). LI is an automatic brain process that allows you to discount stimuli until a later time. It’s how you ignore seemingly insignificant input (so you can focus) until your brain’s attentional resources free up. Research indicates that creative individuals, and those who are more open to new experiences, often have low latent inhibition. These people can’t screen out a lot of the stimulus that bombards them each day, but the result of this is that they are able to make connections regarding what they see and experience early on. This allows for more original thought to occur, especially when it is coupled with a high IQ. To understand creativity in the brain you have to look at the entire brain, it doesn’t just happen in one place. When you think you can think no more Sometimes, my brain feels like this: When this happens, I just kind of stare at my computer screen expecting genius to strike me only to be immensely disappointed when it doesn’t. So you want to free up your brain? Want to get those creative juices flowing? Want me to stop with the metaphors…great…great… Daydream People spend anywhere between 15-50% of their awake-time daydreaming and that’s a good thing, it’s a vital thing. http://alivecampus.com/is-daydreaming-good-for-you/ Aww yisss—permission to let my mind wander from science itself. “When people came up with new ideas researchers recorded alpha waves over the prefrontal cortex. These eight-to-12-hertz waves are typically a sign of relaxed wakefulness and diffuse attention.”—Evangelia G. Chrysiko A more relaxed mood— which is associated with alpha waves—is a better way to think of creative solutions. It’s important to note, however, that a little prefrontal cortex goes a long way. Too much involvement from the PFC hinders creative thinking. Remember the Default Mode Network? Well, scientists believe it is what is responsible for giving you the ability to daydream. Daydreams allow you to move rapidly between past, present, and future. This can help you see patterns or make connections with seemingly unrelated ideas or concepts. “Albert Einstein imagined himself running alongside a light wave, a fantasy that ultimately led to his theory of special relativity.”—Josie Glausiusz It’s not enough to just have daydreams, that’s only part of the work. You need to actually pay attention to them. You know how you always tell yourself to remember that really good idea you had only to not remember it at all later? Believe me, you won’t. Getting into the habit of writing down a few words about your daydreams can help you gain more creative insights into your self and the world around you. Flexible is as flexible does To be creative, to think creatively, you’ve got to be flexible. You have to give your brain a reason to forge new connections and use existing ones in a novel way. Think your brain is flexible? Well, there’s a test for that: answers here: http://www.newscientist.com/data/images/archive/2869/28691902.jpg If you were to look up advice on creativity, you’d see some similar themes which all center on being more flexible: Be an expert, but don’t specialize in just one thing (you need broad perspective) Challenge yourself (Always Be Developing) Don’t get too comfortable, change places, change your state of mind Play! (Take chances, make mistakes, get messy) Don’t give up What does being flexible really mean? Being open, being less afraid. That’s much easier said than done. Your brain spends a good portion of time avoiding and mediating risks to minimize their impact on our lives, but we know it can be done. Musicians see decreased activation of their prefrontal cortex when they are in the process of creating. The prefrontal cortex is your brains CEO. It helps regulate your decisions, your emotions, it just does a whole helluva lot. The PFC is what gets in the way of you bring creative. It’s NOT as flexible as your Default Mode Network, it’s not meant to be. That’s why when you really want to be creative you shouldn’t focus on problems, you shouldn’t focus on anything. You have to actively choose to work against what your brain is hardwired to do. Creativity is a constant challenge and make no mistake we all struggle with it. There’s no singular way to find your next creative inspiration. That’s because there are innumerable ways in which a new idea can spring up. The creative process is as much about the failures, the nonstarters, the near misses, as it is about what eventually ends up as a success. The real work comes from learning how to love that process, to be flexible with it, and not give up. For more articles like this as soon as they’re published, enter your email here This post originally appeared on the Crew blog Sign up to discover human stories that deepen your understanding of the world. Free Distraction-free reading. No ads. Organize your knowledge with lists and highlights. Tell your story. Find your audience. Sign up for free Membership Read member-only stories Support writers you read most Earn money for your writing Listen to audio narrations Read offline with the Medium app Try for $5/month -- -- Follow Written by Andrea Ayres ----------------------- 1.1K Followers ·845 Following Comics. Video games. Culture. Follow No responses yet Write a response What are your thoughts? Cancel Respond Also publish to my profile Help Status About Careers Press Blog Privacy Terms Text to speech Teams",
      "title": "Published Time: 2014-05-15T22:55:14.547Z What To Do When the Creative Juices Run Dry | by Andrea Ayres | Medium Open in app Sign up Sign in Write Sign up Sign in What To Do When the Creative Juices Run Dry Andrea Ayres ·Follow 6 min read · May 15, 2014 -- Listen Share Okay, all I need are some new ideas. Yep. Here we go… get ready… 4 hours later. I’m out of ideas. What do I do now? Where does creativity come from anyway? Do you remember the 1990s when everyone was wondering if they were right brained or left brained? The popular theory was that right-brained people were more creative and artistic and left-brained people were more logical and analytical. Yah, that’s not really how creativity works. Creativity doesn’t happen in any one place but rather in what researchers call “hubs.” These hubs have far more connectivity to other areas of the brain which encourages the quick transfer of information over the vast distances of the brains networks. adapted from: http://scottbarrykaufman.com/wp-content/uploads/2013/08/Bressler_Large-Scale_Brain_10.pdf When you are first creating, you want to draw those broad imaginative strokes—that’s activating the Default Mode Network. When, however, you need to actually implement and fine tune these ideas, you use Central-Executive Network. It’s not just any one network all the time. There was this study that examined the minds of freestyle rappers to see how creative thoughts spring up in real time. Improvisation resulted from increased activation of their Default Mode Network and decreased activation in the more cognitive portion of the brain. The networks were in constant communication with one another via the Salience Network. Creativity feels more difficult to us, which is why some of us just chalk it up to not having the right brain for it. But really, it’s just about letting go. The other part of the creative pie Your brain is assailed with a bunch of input every single day. If you were to try and process every bit of information that your brain receives, it would be very difficult to get anything done. The brain uses a variety of filters to screen out this information and one of them has been found to pertain directly to creativity. It’s called latent inhibition (LI). LI is an automatic brain process that allows you to discount stimuli until a later time. It’s how you ignore seemingly insignificant input (so you can focus) until your brain’s attentional resources free up. Research indicates that creative individuals, and those who are more open to new experiences, often have low latent inhibition. These people can’t screen out a lot of the stimulus that bombards them each day, but the result of this is that they are able to make connections regarding what they see and experience early on. This allows for more original thought to occur, especially when it is coupled with a high IQ. To understand creativity in the brain you have to look at the entire brain, it doesn’t just happen in one place. When you think you can think no more Sometimes, my brain feels like this: When this happens, I just kind of stare at my computer screen expecting genius to strike me only to be immensely disappointed when it doesn’t. So you want to free up your brain? Want to get those creative juices flowing? Want me to stop with the metaphors…great…great… Daydream People spend anywhere between 15-50% of their awake-time daydreaming and that’s a good thing, it’s a vital thing. http://alivecampus.com/is-daydreaming-good-for-you/ Aww yisss—permission to let my mind wander from science itself. “When people came up with new ideas researchers recorded alpha waves over the prefrontal cortex. These eight-to-12-hertz waves are typically a sign of relaxed wakefulness and diffuse attention.”—Evangelia G. Chrysiko A more relaxed mood— which is associated with alpha waves—is a better way to think of creative solutions. It’s important to note, however, that a little prefrontal cortex goes a long way. Too much involvement from the PFC hinders creative thinking. Remember the Default Mode Network? Well, scientists believe it is what is responsible for giving you the ability to daydream. Daydreams allow you to move rapidly between past, present, and future. This can help you see patterns or make connections with seemingly unrelated ideas or concepts. “Albert Einstein imagined himself running alongside a light wave, a fantasy that ultimately led to his theory of special relativity.”—Josie Glausiusz It’s not enough to just have daydreams, that’s only part of the work. You need to actually pay attention to them. You know how you always tell yourself to remember that really good idea you had only to not remember it at all later? Believe me, you won’t. Getting into the habit of writing down a few words about your daydreams can help you gain more creative insights into your self and the world around you. Flexible is as flexible does To be creative, to think creatively, you’ve got to be flexible. You have to give your brain a reason to forge new connections and use existing ones in a novel way. Think your brain is flexible? Well, there’s a test for that: answers here: http://www.newscientist.com/data/images/archive/2869/28691902.jpg If you were to look up advice on creativity, you’d see some similar themes which all center on being more flexible: Be an expert, but don’t specialize in just one thing (you need broad perspective) Challenge yourself (Always Be Developing) Don’t get too comfortable, change places, change your state of mind Play! (Take chances, make mistakes, get messy) Don’t give up What does being flexible really mean? Being open, being less afraid. That’s much easier said than done. Your brain spends a good portion of time avoiding and mediating risks to minimize their impact on our lives, but we know it can be done. Musicians see decreased activation of their prefrontal cortex when they are in the process of creating. The prefrontal cortex is your brains CEO. It helps regulate your decisions, your emotions, it just does a whole helluva lot. The PFC is what gets in the way of you bring creative. It’s NOT as flexible as your Default Mode Network, it’s not meant to be. That’s why when you really want to be creative you shouldn’t focus on problems, you shouldn’t focus on anything. You have to actively choose to work against what your brain is hardwired to do. Creativity is a constant challenge and make no mistake we all struggle with it. There’s no singular way to find your next creative inspiration. That’s because there are innumerable ways in which a new idea can spring up. The creative process is as much about the failures, the nonstarters, the near misses, as it is about what eventually ends up as a success. The real work comes from learning how to love that process, to be flexible with it, and not give up. For more articles like this as soon as they’re published, enter your email here This post originally appeared on the Crew blog Sign up to discover human stories that deepen your understanding of the world. Free Distraction-free reading. No ads. Organize your knowledge with lists and highlights. Tell your story. Find your audience. Sign up for free Membership Read member-only stories Support writers you read most Earn money for your writing Listen to audio narrations Read offline with the Medium app Try for $5/month -- -- Follow Written by Andrea Ayres ----------------------- 1.1K Followers ·845 Following Comics. Video games. Culture. Follow No responses yet Write a response What are your thoughts? Cancel Respond Also publish to my profile Help Status About Careers Press Blog Privacy Terms Text to speech Teams"
    },
    {
      "url": "https://www.theadminzone.com/threads/what-do-you-do-to-get-your-creative-juices-flowing.130140/page-2",
      "content": "Low On Inspiration? 15 Tips To Get Your Creative Juices Flowing Subscribe To Newsletters Low On Inspiration? 15 Tips To Get Your Creative Juices Flowing ByExpert Panel® for Forbes Business Council COUNCIL POST | Membership (fee-based) Save Article Small Business Low On Inspiration? 15 Tips To Get Your Creative Juices Flowing ByExpert Panel®, Forbes Councils Member. for Forbes Business Council COUNCIL POST Expertise from Forbes Councils members, operated under license. Opinions expressed are those of the author. | Membership (fee-based) Mar 17, 2023, 08:15am EDT Save Article Entrepreneurship can be a rewarding and exciting journey, but it can also be challenging and overwhelming at times. When entrepreneurs are feeling uninspired, tapping into their creativity and generating new ideas doesn’t come easily. However, there are several proven strategies that can help rekindle the entrepreneurial spirit and get those creative juices flowing again. Based on their own experiences, a panel of Forbes Business Council members offer their best tips for reigniting inspiration. By following these tips, entrepreneurs can break through creative blocks and achieve greater success in their ventures. Members pictured from left to right. Photos courtesy of the individual members. 1. Step Away I like to spend some time with myself and go for long walks. A walk in nature helps me reflect, analyze and plan how to approach a certain issue. I often come back after with better ideas and an approach for resolving any cobwebs. Another method I have adopted is to unplug and spend time with my son and family. Sometimes you have to step away to step right back! - Shailja Dixit, Curio Digital Therapeutics 2. Use Your Hands Do something with your hands—folding laundry, woodworking or even origami—to get those creative juices flowing. When we move around, we change the neurochemistry of our brains, reducing anxiety and increasing cognition. Even Bill Gates and Jeff Bezos follow this advice—they both love to wash dishes! I personally come up with the best ideas while chopping vegetables and cooking. - Akila McConnell, Unexpected Virtual Tours Forbes Business Council is the foremost growth and networking organization for business owners and leaders. Do I qualify? 3. Pause And Reflect The running of a business, whether it's on a startup or enterprise scale, is hands-on, fast-paced and requires the ability to switch one’s mindset to handle multiple complex issues throughout the day. This is, of course, hugely exciting and dynamic. What I find is that this mental rigor is sustainable for certain periods, but without any moment of pause or reflection, it can lead to the opposite effect. - Joseph Toma, Jugo 4. Look Outside Your Industry The best inspiration comes from thinking outside the lines. That means looking outside the confines of your own industry. Look to Hollywood, look to sports, look to nature, look to whatever market is at the complete opposite end of the spectrum of your own field—but also look to the margins. Some of the biggest breakthroughs happen simply by tinkering with the small things right around the edges. - Angelique Rewers, BoldHaus 5. Go For A Walk Going for a walk and letting ideas settle in my mind works well. The results are not always particularly good, so the next stage is to have discussions with other people. Sometimes I'm lucky and we land a good one. Apart from these \"homegrown\" ideas, I'm surprised by how many ideas customers bring to the table. The best tip is, therefore, to talk to your customers and go for a walk. - Cai Kjaer, SWOOP Analytics 6. Get A Change Of Scenery Entrepreneurs aren't immune to the boredom that comes with routine. As such, a good change of scenery—such as a weekend getaway to a remote location with little to no access to technology and complete access to nature or a staycation where you can soak in a hot tub and catch up on reading—can be great ways to reignite the creative fires. After all, ideas can come from any place, anytime. - James Jones, Bump 7. Clear Your Mind Of Work Walk away from everything you are doing. The mind is like standing in a forest that prevents you from seeing clearly. Take a walk, talk about everything except work with your friends and family and clear your mind. You will find when you come back that you have a far better understanding of what goals you want to achieve—and more innovative ways in which to achieve them. - David Brannan, TMA Sports Management 8. Collaborate With Others Being an entrepreneur is challenging, and it is not uncommon to get stuck or in a rut. One powerful tool for energizing your efforts is collaboration. Engaging with others stimulates creativity! Seek opportunities to partner with others, meet with mentors or participate in an industry forum. Challenging yourself by exploring new ideas will lead to fresh inspiration and energy. - Christian Bloomgren, Infinant Health 9. Move On To Another Task Never be afraid to put down tools and take a step away from the desk. It really doesn't serve you to bounce against a problem again and again when you're lacking the inspiration to tackle it. Move onto something else that you can complete easily and feel a sense of accomplishment from. Go outside or to the gym to change your space and enable yourself to take a step back and let ideas come unaided. - Matt Andrew, Ekimetrics 10. Take A Child's Perspective As an entrepreneur, success is a double-edged sword. Watching your passion come to life is great, but it comes with a mountain of not-so-fun things to do. If you need to reconnect with your joy and get your creativity flowing, try interviewing a child about your business. Their answers will make you laugh, provide unexpected insights and show you where you've overcomplicated things. - Julie Williamson, Karrikins Group 11. Reflect On Your 'Why' I am a firm believer in keeping track of start and finish points. I often reflect and look at my first-year finance, sales and forecast numbers. I will next look at where I expected to be at year \"X.\" Then, I constantly look at the end goal. I also consistently reflect with my team on our \"why.\" Why did you start? Why is this important? Why is it imperative you see it through? - Jay Cohen, Prolific Logistics LLC 12. Embrace Failure Entrepreneurship requires creativity, but when you’re uninspired, it's easy to fall into a dull routine. A great way to regain your creativity is to embrace failure; “fail small, fail fast” is a mantra you should embrace. By rapidly building on each other’s small failures, you can eventually end up with a big success. Turning small failures into big successes will inspire your organization. - Rob De La Espriella, BlueDragon IPS 13. Get Active My best tip for getting creative juices flowing is to do something active outside of the normal environment. Physical activity boosts cognitive function, leading to increased creativity and problem-solving abilities. Exploring new surroundings can provide fresh perspectives and spark new ideas. My best ideas come to me while on a run, while engulfing myself in my surroundings. - Amy Dix, Authority Speakers Agency 14. Do Something You Love The best way to get the creative juices flowing again is to take a break and do something you enjoy. Whether it’s playing a game of soccer, or taking up a new hobby like painting or writing, giving yourself a break from work can help you feel refreshed and ready to tackle the task. Physical activities can help clear your mind and boost your energy levels so you come back inspired and energized. - Tim Guercio, Knowmad Enterprises, The Christmas Team 15. Turn To Family I've never felt uninspired. If I did, all that I would have to do is look at my beautiful children and then get to work! Nowadays, my children are grown and tearing up the business world on their own! For anyone else, I recommend looking at your family (or, as a last resort, pictures of your family) to remember why you do what you do. If that does not inspire a person, I don't know what else will. - “Smitty” Robert J. Smith, Robert J. Smith Productions Check out my website. Editorial StandardsForbes Accolades LOADING VIDEO PLAYER... FORBES’ FEATURED Video © 2025 Forbes Media LLC. All Rights Reserved. AdChoices Privacy Statement Do Not Sell or Share My Personal Information Limit the Use of My Sensitive Personal Information Privacy Preferences Digital Terms of Sale Terms of Service Contact Us Send Us Feedback Report a Security Issue Jobs At Forbes Reprints & Permissions Forbes Press Room Advertise",
      "title": "Low On Inspiration? 15 Tips To Get Your Creative Juices Flowing Subscribe To Newsletters Low On Inspiration? 15 Tips To Get Your Creative Juices Flowing ByExpert Panel® for Forbes Business Council COUNCIL POST | Membership (fee-based) Save Article Small Business Low On Inspiration? 15 Tips To Get Your Creative Juices Flowing ByExpert Panel®, Forbes Councils Member. for Forbes Business Council COUNCIL POST Expertise from Forbes Councils members, operated under license. Opinions expressed are those of the author. | Membership (fee-based) Mar 17, 2023, 08:15am EDT Save Article Entrepreneurship can be a rewarding and exciting journey, but it can also be challenging and overwhelming at times. When entrepreneurs are feeling uninspired, tapping into their creativity and generating new ideas doesn’t come easily. However, there are several proven strategies that can help rekindle the entrepreneurial spirit and get those creative juices flowing again. Based on their own experiences, a panel of Forbes Business Council members offer their best tips for reigniting inspiration. By following these tips, entrepreneurs can break through creative blocks and achieve greater success in their ventures. Members pictured from left to right. Photos courtesy of the individual members. 1. Step Away I like to spend some time with myself and go for long walks. A walk in nature helps me reflect, analyze and plan how to approach a certain issue. I often come back after with better ideas and an approach for resolving any cobwebs. Another method I have adopted is to unplug and spend time with my son and family. Sometimes you have to step away to step right back! - Shailja Dixit, Curio Digital Therapeutics 2. Use Your Hands Do something with your hands—folding laundry, woodworking or even origami—to get those creative juices flowing. When we move around, we change the neurochemistry of our brains, reducing anxiety and increasing cognition. Even Bill Gates and Jeff Bezos follow this advice—they both love to wash dishes! I personally come up with the best ideas while chopping vegetables and cooking. - Akila McConnell, Unexpected Virtual Tours Forbes Business Council is the foremost growth and networking organization for business owners and leaders. Do I qualify? 3. Pause And Reflect The running of a business, whether it's on a startup or enterprise scale, is hands-on, fast-paced and requires the ability to switch one’s mindset to handle multiple complex issues throughout the day. This is, of course, hugely exciting and dynamic. What I find is that this mental rigor is sustainable for certain periods, but without any moment of pause or reflection, it can lead to the opposite effect. - Joseph Toma, Jugo 4. Look Outside Your Industry The best inspiration comes from thinking outside the lines. That means looking outside the confines of your own industry. Look to Hollywood, look to sports, look to nature, look to whatever market is at the complete opposite end of the spectrum of your own field—but also look to the margins. Some of the biggest breakthroughs happen simply by tinkering with the small things right around the edges. - Angelique Rewers, BoldHaus 5. Go For A Walk Going for a walk and letting ideas settle in my mind works well. The results are not always particularly good, so the next stage is to have discussions with other people. Sometimes I'm lucky and we land a good one. Apart from these \"homegrown\" ideas, I'm surprised by how many ideas customers bring to the table. The best tip is, therefore, to talk to your customers and go for a walk. - Cai Kjaer, SWOOP Analytics 6. Get A Change Of Scenery Entrepreneurs aren't immune to the boredom that comes with routine. As such, a good change of scenery—such as a weekend getaway to a remote location with little to no access to technology and complete access to nature or a staycation where you can soak in a hot tub and catch up on reading—can be great ways to reignite the creative fires. After all, ideas can come from any place, anytime. - James Jones, Bump 7. Clear Your Mind Of Work Walk away from everything you are doing. The mind is like standing in a forest that prevents you from seeing clearly. Take a walk, talk about everything except work with your friends and family and clear your mind. You will find when you come back that you have a far better understanding of what goals you want to achieve—and more innovative ways in which to achieve them. - David Brannan, TMA Sports Management 8. Collaborate With Others Being an entrepreneur is challenging, and it is not uncommon to get stuck or in a rut. One powerful tool for energizing your efforts is collaboration. Engaging with others stimulates creativity! Seek opportunities to partner with others, meet with mentors or participate in an industry forum. Challenging yourself by exploring new ideas will lead to fresh inspiration and energy. - Christian Bloomgren, Infinant Health 9. Move On To Another Task Never be afraid to put down tools and take a step away from the desk. It really doesn't serve you to bounce against a problem again and again when you're lacking the inspiration to tackle it. Move onto something else that you can complete easily and feel a sense of accomplishment from. Go outside or to the gym to change your space and enable yourself to take a step back and let ideas come unaided. - Matt Andrew, Ekimetrics 10. Take A Child's Perspective As an entrepreneur, success is a double-edged sword. Watching your passion come to life is great, but it comes with a mountain of not-so-fun things to do. If you need to reconnect with your joy and get your creativity flowing, try interviewing a child about your business. Their answers will make you laugh, provide unexpected insights and show you where you've overcomplicated things. - Julie Williamson, Karrikins Group 11. Reflect On Your 'Why' I am a firm believer in keeping track of start and finish points. I often reflect and look at my first-year finance, sales and forecast numbers. I will next look at where I expected to be at year \"X.\" Then, I constantly look at the end goal. I also consistently reflect with my team on our \"why.\" Why did you start? Why is this important? Why is it imperative you see it through? - Jay Cohen, Prolific Logistics LLC 12. Embrace Failure Entrepreneurship requires creativity, but when you’re uninspired, it's easy to fall into a dull routine. A great way to regain your creativity is to embrace failure; “fail small, fail fast” is a mantra you should embrace. By rapidly building on each other’s small failures, you can eventually end up with a big success. Turning small failures into big successes will inspire your organization. - Rob De La Espriella, BlueDragon IPS 13. Get Active My best tip for getting creative juices flowing is to do something active outside of the normal environment. Physical activity boosts cognitive function, leading to increased creativity and problem-solving abilities. Exploring new surroundings can provide fresh perspectives and spark new ideas. My best ideas come to me while on a run, while engulfing myself in my surroundings. - Amy Dix, Authority Speakers Agency 14. Do Something You Love The best way to get the creative juices flowing again is to take a break and do something you enjoy. Whether it’s playing a game of soccer, or taking up a new hobby like painting or writing, giving yourself a break from work can help you feel refreshed and ready to tackle the task. Physical activities can help clear your mind and boost your energy levels so you come back inspired and energized. - Tim Guercio, Knowmad Enterprises, The Christmas Team 15. Turn To Family I've never felt uninspired. If I did, all that I would have to do is look at my beautiful children and then get to work! Nowadays, my children are grown and tearing up the business world on their own! For anyone else, I recommend looking at your family (or, as a last resort, pictures of your family) to remember why you do what you do. If that does not inspire a person, I don't know what else will. - “Smitty” Robert J. Smith, Robert J. Smith Productions Check out my website. Editorial StandardsForbes Accolades LOADING VIDEO PLAYER... FORBES’ FEATURED Video © 2025 Forbes Media LLC. All Rights Reserved. AdChoices Privacy Statement Do Not Sell or Share My Personal Information Limit the Use of My Sensitive Personal Information Privacy Preferences Digital Terms of Sale Terms of Service Contact Us Send Us Feedback Report a Security Issue Jobs At Forbes Reprints & Permissions Forbes Press Room Advertise"
    },
    {
      "url": "https://klout9.co/ways-stay-inspired-keep-creative-juices-flowing/",
      "content": "Published Time: 2022-05-16T16:16:00+00:00 How to Get Your Creative Juices Flowing - Klout 9 Home Services Social Media Marketing Videography Website Development Search Marketing Design & Branding About Us Meet the Team Blog Contact Let's Chat Home Our Services Social Media Marketing Videography Website Development Search Marketing Design & Branding About Us Meet the Team Blog Contact Let’s Chat 5 Ways to Stay Inspired and Keep Your Creative Juices Flowing by Klout 9 | May 16, 2022 | Content Marketing For hobbyists and people whose livelihoods depend upon their ability to come up with new ideas alike, finding new sources of inspiration can be a challenge. Even the most creative people can run into occasional blocks in the way of their productivity. Whether you are a professional content creator or someone who just likes making captivating posts for social media and other digital platforms, the creative process can be fun and rewarding when you see your ideas come to fruition. It is our hope that the following tips can help break through periods of stagnation and keep you in the flow. Have novel experiences as often as possible When you do something you’ve never done before, you expose yourself to entirely new systems of thought. Take, for example, yoga. Someone attending their first yoga class will learn about alignment, mindfulness, and anatomy. They’ll put their bodies into challenging positions and learn the jargon of the yoga teacher’s trade. That one experience can translate into countless types of creative expression. Novel experiences make you a more well-rounded and interesting person and increase your sense of self-worth, which can give you a much-needed boost of confidence in times of creative slump. Doing things that you don’t usually do has the additional benefit of giving your memory something to anchor to, which lengthens your experience of time. Rather than letting your days run together into one continuous cycle, give yourself a rich and varied portfolio of memories to draw on for purposes of personal and creative growth. Get ideas out of your head and into the world Anyone who’s ever walked into a room and couldn’t remember why they’d been looking for knows how fickle the mind can be. Never trust your brain with your ideas. No matter how good the idea is, you’ll most likely forget at least some of the details, if not the entire image. It’s a good idea to keep a recording device at hand for those strokes of genius and minor epiphanies that happen throughout the day. Such a device can be analog, such as a notebook and pen, or digital, like adding a shortcut to a voice recording app on your phone’s home screen. The other half of this process is equally important: to regularly check your notes and following up with your ideas to transform them into creative realities. Recording your ideas also frees up your brain space for the next idea, since you don’t need to commit mental resources to remembering them. Shake up your routine Our perceptions, the information we give our brain through our senses, form the basis for how we think about the world. Do you eat a similar breakfast, drink the same coffee, listen to the same news podcast most mornings? If so, you may be limiting the sensory information your brain has to draw ideas from. Try to change it up once in awhile so you’re seeing, tasting, smelling, and hearing enough different things to give your mind a wider range of perspectives. Sleep on it The value of sleep cannot be overstated. Lack of sleep kills your focus, mental processing speed, and alertness as well as your creativity. A well-rested brain makes more novel connections between seemingly unrelated stimuli. That, in essence, is the definition of what makes a person creative. If you ever find yourself burning the midnight oil, racking your brain for the next plot point or video idea, do yourself a favor and just go to bed. It may seem counter-intuitive at first glance that you’ll be more productive if you go to bed earlier, but study after study confirms this to be true. Learn alternative perspectives It’s easy for people to become encapsulated in their own perspectives, and it takes conscious effort to become aware of and learn about different paradigms. It is, however, well worth the effort in terms of creative payoff. Read books written by people who were raised very differently from you. Watch documentaries about social issues in foreign countries. Most importantly, talk to people you don’t think you have much in common with about their experiences and opinions and keep an open mind. You’ll be surprised by what you can learn! If you have projects requiring a professional level of creativity, turn to Klout 9, a highly-rated social media marketing agency in Lafayette, LA. Find out in the video below why our satisfied clients have selected us as their partner for social media, design, videography, SEO, and other digital marketing needs. Contact us today for a free consultation! Our Services About Us Blog Contact Us Privacy Policy 2014 W. Pinhook Rd. Suite 300 Lafayette, La 70508 • (337) 735-4724 Copyright 2024 Klout 9 all rights reserved. Sitemap",
      "title": "Published Time: 2022-05-16T16:16:00+00:00 How to Get Your Creative Juices Flowing - Klout 9 Home Services Social Media Marketing Videography Website Development Search Marketing Design & Branding About Us Meet the Team Blog Contact Let's Chat Home Our Services Social Media Marketing Videography Website Development Search Marketing Design & Branding About Us Meet the Team Blog Contact Let’s Chat 5 Ways to Stay Inspired and Keep Your Creative Juices Flowing by Klout 9 | May 16, 2022 | Content Marketing For hobbyists and people whose livelihoods depend upon their ability to come up with new ideas alike, finding new sources of inspiration can be a challenge. Even the most creative people can run into occasional blocks in the way of their productivity. Whether you are a professional content creator or someone who just likes making captivating posts for social media and other digital platforms, the creative process can be fun and rewarding when you see your ideas come to fruition. It is our hope that the following tips can help break through periods of stagnation and keep you in the flow. Have novel experiences as often as possible When you do something you’ve never done before, you expose yourself to entirely new systems of thought. Take, for example, yoga. Someone attending their first yoga class will learn about alignment, mindfulness, and anatomy. They’ll put their bodies into challenging positions and learn the jargon of the yoga teacher’s trade. That one experience can translate into countless types of creative expression. Novel experiences make you a more well-rounded and interesting person and increase your sense of self-worth, which can give you a much-needed boost of confidence in times of creative slump. Doing things that you don’t usually do has the additional benefit of giving your memory something to anchor to, which lengthens your experience of time. Rather than letting your days run together into one continuous cycle, give yourself a rich and varied portfolio of memories to draw on for purposes of personal and creative growth. Get ideas out of your head and into the world Anyone who’s ever walked into a room and couldn’t remember why they’d been looking for knows how fickle the mind can be. Never trust your brain with your ideas. No matter how good the idea is, you’ll most likely forget at least some of the details, if not the entire image. It’s a good idea to keep a recording device at hand for those strokes of genius and minor epiphanies that happen throughout the day. Such a device can be analog, such as a notebook and pen, or digital, like adding a shortcut to a voice recording app on your phone’s home screen. The other half of this process is equally important: to regularly check your notes and following up with your ideas to transform them into creative realities. Recording your ideas also frees up your brain space for the next idea, since you don’t need to commit mental resources to remembering them. Shake up your routine Our perceptions, the information we give our brain through our senses, form the basis for how we think about the world. Do you eat a similar breakfast, drink the same coffee, listen to the same news podcast most mornings? If so, you may be limiting the sensory information your brain has to draw ideas from. Try to change it up once in awhile so you’re seeing, tasting, smelling, and hearing enough different things to give your mind a wider range of perspectives. Sleep on it The value of sleep cannot be overstated. Lack of sleep kills your focus, mental processing speed, and alertness as well as your creativity. A well-rested brain makes more novel connections between seemingly unrelated stimuli. That, in essence, is the definition of what makes a person creative. If you ever find yourself burning the midnight oil, racking your brain for the next plot point or video idea, do yourself a favor and just go to bed. It may seem counter-intuitive at first glance that you’ll be more productive if you go to bed earlier, but study after study confirms this to be true. Learn alternative perspectives It’s easy for people to become encapsulated in their own perspectives, and it takes conscious effort to become aware of and learn about different paradigms. It is, however, well worth the effort in terms of creative payoff. Read books written by people who were raised very differently from you. Watch documentaries about social issues in foreign countries. Most importantly, talk to people you don’t think you have much in common with about their experiences and opinions and keep an open mind. You’ll be surprised by what you can learn! If you have projects requiring a professional level of creativity, turn to Klout 9, a highly-rated social media marketing agency in Lafayette, LA. Find out in the video below why our satisfied clients have selected us as their partner for social media, design, videography, SEO, and other digital marketing needs. Contact us today for a free consultation! Our Services About Us Blog Contact Us Privacy Policy 2014 W. Pinhook Rd. Suite 300 Lafayette, La 70508 • (337) 735-4724 Copyright 2024 Klout 9 all rights reserved. Sitemap"
    },
    {
      "url": "https://ask.metafilter.com/269601/Running-on-creative-fumes",
      "content": "Running on creative fumes - creativelydry stuckinarut beingpresent | Ask MetaFilter New Site Ready for Beta Testing || ChatGPT policy updated || February Site Update || Non Profit transition FAQ Ask MetaFilter ============== querying the hive mind Log In Sign Up MetaFilter AskMeFi FanFare Projects Music Jobs IRL MetaTalk More Best Of Podcast Chat Labs Mall Search MetaFilter… Menu Home FAQ About Archives Tags Popular Random Running on creative fumes October 6, 2014 9:23 PM Subscribe ===================================================================================================================================================================================================== What do you do to rejuvenate your creative side? I'm a pretty creative person by nature, I work in the arts + draw almost every day. I love watching movies/tv series and reading through some books. But lately I've been feeling pretty dry, creatively. All too often I find myself dwelling on mundane things, like my list of to-dos…what to make for dinner…worries/plans for the future… These are all perfectly normal and necessary thoughts, but I feel like I'm mentally dragging a bit, like I'm less \"present\" because my mind is always drifting and worrying about other stuff. I feel like I'm in a bit of a rut. I miss noticing the small, neat things going on in the world around me and being inspired by them to come up with stories. It's harder to think of things to draw when I'm starting a new art piece. I can remember times when it felt like my brain was firing on all cylinders and my imagination was humming, but it's been a while. So what do you do when you're feeling creatively stuck? How do you get back to that mentally upbeat and focused state? Maybe what I'm asking is how to get back in touch with your inner kid, and view the world with a little more wonder. All suggestions welcome! posted by sprezzy to Grab Bag (12 answers total) 43 users marked this as a favorite Ever since I've read a segment in this interview with Joss Whedon, I've realized that he's right: \"The last piece of advice on that level is fill the tanks, fill the tanks, fill the tanks. Constantly watch things and things you don’t [normally watch]. Step outside your viewing zone, your reading zone. It’s all fodder but if you only take from one thing then it’ll show.\" Watch and read things that aren't what you normally consume, across a wide range - history books, nonfiction, documentaries, economics textbooks, science abstracts, coding tutorials, science fiction. Watch lectures, sit in on talks, etc. I find that it works great for me, often in unexpected ways; I'll have great ideas when talking/reading/thinking about something relatively unrelated. posted by suedehead at 9:56 PM on October 6, 2014 [1 favorite] Well, I'll tell you my little insight into creativity. Make of it what you want. Creativity isn't the production of ideas from nothing. It's the combination of other ideas in novel ways. A person who really prizes creativity will naturally shy away from repeating old ideas. So, it might be possible that you're having trouble being creative because you haven't had new things to combine. So, maybe try cultivating an interest in something new? For instance, everyone has posts in the Blue that they skip over, because they're not in an area they're interested in. Next time you do this, maybe pick one of them and follow the links and read the comments. It might not turn out to be interesting to you, but it might become your new favorite thing. And I've found that finding new favorite things is a marvelous spark for ingenuity. Even if a lack of things to combine isn't the source of your block, it can be a good way to find new enthuiasm, which might also be part of it. posted by JHarris at 9:57 PM on October 6, 2014 [3 favorites] I haven't read it myself, but a lot of people adore The Artist's Way for just this sort of thing. A concept I have found pretty useful is the idea of taking your \"inner artist\" on dates. Here's a decent blog post that explains it better than I can. posted by mollymayhem at 11:28 PM on October 6, 2014 I sympathize! I've found I feel more and more like this as I get older. Some things that work for me: 1. Regular exercise makes a huge difference to my creativity. If I go for a run on some days, and take long walks on my non-running days, my writing flows much more easily. Interestingly, I've noticed that if I listen to podcasts while I run, I don't get the same creativity boost -- it seems like too much conscious focus interferes with whatever unconscious process is going on. 2. I am trying to do some simple meditation, to practice controlling my focus. 3. I give myself an objective, time-limited goal. EG, write 250 words in the next hour. They don't have to be good words-- it's fine if I end up deleting them all. I just need to get them on paper. I find that can be freeing. By giving myself the goal of just writing crap, I somehow free myself to write interesting and good things. 4. Sometimes, none of those techniques help. After years of observing my own process, I have come to accept that there will be creative dry spells. My brain just needs a certain amount of downtime. Yours might be the same. posted by yankeefog at 3:08 AM on October 7, 2014 Three things, one of which is not like the others. 1. Consume a different type of media. Sometimes I fall into deep pits of dance videos. Sometimes I'm fascinated by quilling and marbling and other papercraft techniques. Sometimes I get really into typography, or throat singing, or window displays, or hair styling. Consume a new thing. Not just a new genre (though that's good too) but a different art medium entirely. Woodcraft? Lego design? Circus? Epic poetry? Cooking? 2. Create in a different type of media. Of course don't expect to be a master or anything, and don't break the bank, but try a different thing. This could be as small a shift as going from primarily black and white ink drawings to using color, all the way to trying out modern dance when you usually write short stories, or somewhere in between like learning how to knit. You can try creating in the same media that you're newly consuming but you don't have to (and often it's more interesting to combine the aspects of one into the other if they're different.) 3. The one that's not like the others: Take a break. Don't pressure yourself. Let your mind focus on the mundane for a while and reorganize, relax, reflect. Give yourself permission and space to not be creative unless you want to be, but do give yourself a deadline. A month, three months, maybe. Something that lines up with your life schedule. You can push through a dry spell but unless your job is on the line, give yourself time and see if maybe you start finding the wonderful in the mundane again once you've focused on the boring but pressing life stuff that seems to be taxing you. posted by Mizu at 3:45 AM on October 7, 2014 [3 favorites] I've read that there is, biologically, a connection between creativity and exposure to the unfamiliar (so, consistent with the comments above, seek out the unfamiliar!). Sorry I can't spend more time to track down the cite, but here are some practical suggestions from someone blogging on the topic at a blog called The Bane of Your Resistance: [Accidental Tourist] \"Opportunities for random encounters with the unfamiliar is one of the prime benefits of travel. We can expand our creativity by challenging ourselves to be tourists in our own towns: o eat a restaurant in a neighborhood you rarely visit o go to a play or concert in a school your kids don’t attend o tune into a radio station that you never listen to o explore a store you’d never shop in and ask questions o spend a half hour watching a channel selected by a random number generator o go to a tourist attraction in your area that you haven’t visited in years Where do you find random? Please comment — I really want to know because I know I need more random.\" posted by mmiddle at 6:28 AM on October 7, 2014 [1 favorite] I find that the more time I spend with creative friends the more creative I feel. So heading out for drinks with creative friends is my first step for getting the ideas flowing again. posted by advicepig at 6:58 AM on October 7, 2014 Imagine the complete opposite of what you want to be creative about. Writing a story about a chef? Write a story about a poisoner. posted by Cool Papa Bell at 7:15 AM on October 7, 2014 [2 favorites] Seconding Julia Cameron's \"The Artist's Way.\" She advocates: regularly going on excursions outside your normal orbit & keeping a daily journal. The book goes into great detail (with assignments and projects) on why/how this would work etc. posted by mrmarley at 10:01 AM on October 7, 2014 [1 favorite] I find inspiration/great art is about passion. There may be a reason why you are feeling less passionate about subjects that have inspired you in the past. I suspect that there are some issues and subjects that do inspire passion in you. If they are in new territory, go there. posted by dances_with_sneetches at 10:37 AM on October 7, 2014 I find that travel really gets my creative juices flowing. If you can afford it, travel as widely as you can and/or feel comfortable with. posted by McMillan's Other Wife at 11:27 AM on October 7, 2014 For drawing I've been in a rut, this month on Social Media is \"Inktober\" where people post ink doodles. You do one every day, and I find that even though I'm not really inspired to draw anything the act of doing something (and I must post something once a day, not to break the chain) has helped a little bit in getting back into practice. posted by hellojed at 5:19 PM on October 7, 2014 [1 favorite] « Older Help With Zombie Makeup, But Not Really Gross... | Should I end it with my great companion of a SO? Newer » This thread is closed to new comments. Related Questions What are the best activity books and coloring... April 27, 2015 books on creativity for the creative person March 18, 2011 Initiative to learn, but not to create June 7, 2010 We're just a million little gods making rainstorms... June 20, 2007 52 Fun Things to learn. December 11, 2006 Tags creativelydry stuckinarut beingpresent creativity Share Facebook About Ask MetaFilter Ask MetaFilter is a question and answer site that covers nearly any question on earth, where members help each other solve problems. Ask MetaFilter is where thousands of life's little questions are answered. Sites MetaFilter AskMeFi FanFare Projects Music Jobs IRL MetaTalk Best Of Podcast Links Home Guidelines Content Policy Privacy Policy FAQ About Archives Tags Popular Random BIPOC Board Steering Committee Wiki Search Chat Labs Members Sign Up Log In Search MetaFilter… Fund MetaFilter ---------------Join 8,308 readers in helping fund MetaFilter Contact Us © 1999–2025 MetaFilter LLC All posts copyright their original authors. Classic Theme.",
      "title": "Running on creative fumes - creativelydry stuckinarut beingpresent | Ask MetaFilter New Site Ready for Beta Testing || ChatGPT policy updated || February Site Update || Non Profit transition FAQ Ask MetaFilter ============== querying the hive mind Log In Sign Up MetaFilter AskMeFi FanFare Projects Music Jobs IRL MetaTalk More Best Of Podcast Chat Labs Mall Search MetaFilter… Menu Home FAQ About Archives Tags Popular Random Running on creative fumes October 6, 2014 9:23 PM Subscribe ===================================================================================================================================================================================================== What do you do to rejuvenate your creative side? I'm a pretty creative person by nature, I work in the arts + draw almost every day. I love watching movies/tv series and reading through some books. But lately I've been feeling pretty dry, creatively. All too often I find myself dwelling on mundane things, like my list of to-dos…what to make for dinner…worries/plans for the future… These are all perfectly normal and necessary thoughts, but I feel like I'm mentally dragging a bit, like I'm less \"present\" because my mind is always drifting and worrying about other stuff. I feel like I'm in a bit of a rut. I miss noticing the small, neat things going on in the world around me and being inspired by them to come up with stories. It's harder to think of things to draw when I'm starting a new art piece. I can remember times when it felt like my brain was firing on all cylinders and my imagination was humming, but it's been a while. So what do you do when you're feeling creatively stuck? How do you get back to that mentally upbeat and focused state? Maybe what I'm asking is how to get back in touch with your inner kid, and view the world with a little more wonder. All suggestions welcome! posted by sprezzy to Grab Bag (12 answers total) 43 users marked this as a favorite Ever since I've read a segment in this interview with Joss Whedon, I've realized that he's right: \"The last piece of advice on that level is fill the tanks, fill the tanks, fill the tanks. Constantly watch things and things you don’t [normally watch]. Step outside your viewing zone, your reading zone. It’s all fodder but if you only take from one thing then it’ll show.\" Watch and read things that aren't what you normally consume, across a wide range - history books, nonfiction, documentaries, economics textbooks, science abstracts, coding tutorials, science fiction. Watch lectures, sit in on talks, etc. I find that it works great for me, often in unexpected ways; I'll have great ideas when talking/reading/thinking about something relatively unrelated. posted by suedehead at 9:56 PM on October 6, 2014 [1 favorite] Well, I'll tell you my little insight into creativity. Make of it what you want. Creativity isn't the production of ideas from nothing. It's the combination of other ideas in novel ways. A person who really prizes creativity will naturally shy away from repeating old ideas. So, it might be possible that you're having trouble being creative because you haven't had new things to combine. So, maybe try cultivating an interest in something new? For instance, everyone has posts in the Blue that they skip over, because they're not in an area they're interested in. Next time you do this, maybe pick one of them and follow the links and read the comments. It might not turn out to be interesting to you, but it might become your new favorite thing. And I've found that finding new favorite things is a marvelous spark for ingenuity. Even if a lack of things to combine isn't the source of your block, it can be a good way to find new enthuiasm, which might also be part of it. posted by JHarris at 9:57 PM on October 6, 2014 [3 favorites] I haven't read it myself, but a lot of people adore The Artist's Way for just this sort of thing. A concept I have found pretty useful is the idea of taking your \"inner artist\" on dates. Here's a decent blog post that explains it better than I can. posted by mollymayhem at 11:28 PM on October 6, 2014 I sympathize! I've found I feel more and more like this as I get older. Some things that work for me: 1. Regular exercise makes a huge difference to my creativity. If I go for a run on some days, and take long walks on my non-running days, my writing flows much more easily. Interestingly, I've noticed that if I listen to podcasts while I run, I don't get the same creativity boost -- it seems like too much conscious focus interferes with whatever unconscious process is going on. 2. I am trying to do some simple meditation, to practice controlling my focus. 3. I give myself an objective, time-limited goal. EG, write 250 words in the next hour. They don't have to be good words-- it's fine if I end up deleting them all. I just need to get them on paper. I find that can be freeing. By giving myself the goal of just writing crap, I somehow free myself to write interesting and good things. 4. Sometimes, none of those techniques help. After years of observing my own process, I have come to accept that there will be creative dry spells. My brain just needs a certain amount of downtime. Yours might be the same. posted by yankeefog at 3:08 AM on October 7, 2014 Three things, one of which is not like the others. 1. Consume a different type of media. Sometimes I fall into deep pits of dance videos. Sometimes I'm fascinated by quilling and marbling and other papercraft techniques. Sometimes I get really into typography, or throat singing, or window displays, or hair styling. Consume a new thing. Not just a new genre (though that's good too) but a different art medium entirely. Woodcraft? Lego design? Circus? Epic poetry? Cooking? 2. Create in a different type of media. Of course don't expect to be a master or anything, and don't break the bank, but try a different thing. This could be as small a shift as going from primarily black and white ink drawings to using color, all the way to trying out modern dance when you usually write short stories, or somewhere in between like learning how to knit. You can try creating in the same media that you're newly consuming but you don't have to (and often it's more interesting to combine the aspects of one into the other if they're different.) 3. The one that's not like the others: Take a break. Don't pressure yourself. Let your mind focus on the mundane for a while and reorganize, relax, reflect. Give yourself permission and space to not be creative unless you want to be, but do give yourself a deadline. A month, three months, maybe. Something that lines up with your life schedule. You can push through a dry spell but unless your job is on the line, give yourself time and see if maybe you start finding the wonderful in the mundane again once you've focused on the boring but pressing life stuff that seems to be taxing you. posted by Mizu at 3:45 AM on October 7, 2014 [3 favorites] I've read that there is, biologically, a connection between creativity and exposure to the unfamiliar (so, consistent with the comments above, seek out the unfamiliar!). Sorry I can't spend more time to track down the cite, but here are some practical suggestions from someone blogging on the topic at a blog called The Bane of Your Resistance: [Accidental Tourist] \"Opportunities for random encounters with the unfamiliar is one of the prime benefits of travel. We can expand our creativity by challenging ourselves to be tourists in our own towns: o eat a restaurant in a neighborhood you rarely visit o go to a play or concert in a school your kids don’t attend o tune into a radio station that you never listen to o explore a store you’d never shop in and ask questions o spend a half hour watching a channel selected by a random number generator o go to a tourist attraction in your area that you haven’t visited in years Where do you find random? Please comment — I really want to know because I know I need more random.\" posted by mmiddle at 6:28 AM on October 7, 2014 [1 favorite] I find that the more time I spend with creative friends the more creative I feel. So heading out for drinks with creative friends is my first step for getting the ideas flowing again. posted by advicepig at 6:58 AM on October 7, 2014 Imagine the complete opposite of what you want to be creative about. Writing a story about a chef? Write a story about a poisoner. posted by Cool Papa Bell at 7:15 AM on October 7, 2014 [2 favorites] Seconding Julia Cameron's \"The Artist's Way.\" She advocates: regularly going on excursions outside your normal orbit & keeping a daily journal. The book goes into great detail (with assignments and projects) on why/how this would work etc. posted by mrmarley at 10:01 AM on October 7, 2014 [1 favorite] I find inspiration/great art is about passion. There may be a reason why you are feeling less passionate about subjects that have inspired you in the past. I suspect that there are some issues and subjects that do inspire passion in you. If they are in new territory, go there. posted by dances_with_sneetches at 10:37 AM on October 7, 2014 I find that travel really gets my creative juices flowing. If you can afford it, travel as widely as you can and/or feel comfortable with. posted by McMillan's Other Wife at 11:27 AM on October 7, 2014 For drawing I've been in a rut, this month on Social Media is \"Inktober\" where people post ink doodles. You do one every day, and I find that even though I'm not really inspired to draw anything the act of doing something (and I must post something once a day, not to break the chain) has helped a little bit in getting back into practice. posted by hellojed at 5:19 PM on October 7, 2014 [1 favorite] « Older Help With Zombie Makeup, But Not Really Gross... | Should I end it with my great companion of a SO? Newer » This thread is closed to new comments. Related Questions What are the best activity books and coloring... April 27, 2015 books on creativity for the creative person March 18, 2011 Initiative to learn, but not to create June 7, 2010 We're just a million little gods making rainstorms... June 20, 2007 52 Fun Things to learn. December 11, 2006 Tags creativelydry stuckinarut beingpresent creativity Share Facebook About Ask MetaFilter Ask MetaFilter is a question and answer site that covers nearly any question on earth, where members help each other solve problems. Ask MetaFilter is where thousands of life's little questions are answered. Sites MetaFilter AskMeFi FanFare Projects Music Jobs IRL MetaTalk Best Of Podcast Links Home Guidelines Content Policy Privacy Policy FAQ About Archives Tags Popular Random BIPOC Board Steering Committee Wiki Search Chat Labs Members Sign Up Log In Search MetaFilter… Fund MetaFilter ---------------Join 8,308 readers in helping fund MetaFilter Contact Us © 1999–2025 MetaFilter LLC All posts copyright their original authors. Classic Theme."
    }
  ],
  "researchSummary": "6 Strategies For Agencies To Thrive In The 2025 Tech-Driven Landscape Subscribe To Newsletters 6 Strategies For Agencies To Thrive In The 2025 Tech-Driven Landscape ByAmy Packard Berry for Forbes Agency Council COUNCIL POST | Membership (fee-based) Save Article Leadership 6 Strategies For Agencies To Thrive In The 2025 Tech-Driven Landscape ByAmy Packard Berry, Forbes Councils Member. for Forbes Agency Council COUNCIL POST Expertise from Forbes Councils members, operated under license. Opinions expressed are those of the author. | Membership (fee-based) Nov 05, 2024, 07:30am EST Save Article Amy Packard Berry, Executive Vice President MarCom, Sparkpr. getty As we approach 2025, agency leaders and CMOs face a landscape transformed by technological leaps and evolving client and audience expectations. This isn't just change; it's a revolution in how agencies deliver value. Below are six strategies shaping the marketing landscape and how to leverage them. Invest in developing an AI-forward culture. Generative AI has unlocked new possibilities, and its next phase is as a strategic partner. Here are a few ways to start shifting your teams to be more AI-focused: • Create a C-suite position for AI strategy and ethics. • See where AI can have the biggest impact. Maybe that's data analysis, content creation or media buying. For example, our agency is rapidly deploying an AI-powered PR platform where we can streamline newsjacking and trend identification, optimize targeted media outreach and enhance our content creation. • AI should augment, not replace, human creativity. Our commitment to AI excellence includes weekly AI training syncs that keep our team at the forefront of emerging capabilities and a dedicated Slack channel as a hub for sharing discoveries, best practices and success stories. Overhaul your data strategy. In 2025, mass marketing will be a relic. Clients will demand campaigns that speak to individual consumer preferences with unprecedented precision. Real-time",
  "coreTopic": "The main topic revolves around strategies for marketing agencies to adapt and thrive in a rapidly changing, tech-driven landscape by 2025. It focuses on the integration of advanced technologies, particularly AI, into agency operations, as well as the need for a refined data strategy to meet evolving client and audience expectations. The content discusses how agencies can leverage these technological advancements to enhance their services and remain competitive in the marketing industry.",
  "brandInfo": "\n      Website: https://foundertoolkit.org/\n      Brand: foundertoolkit\n      Products: No product images\n      Description: Backed by learnings and experience of solopreneurs who built tech startups doing 1M+ ARR\n\n      Documents: No documents\n      Logo: No logo\n      Posts/Videos: No posts/videos\n      Taglines: None\n      Colours: No colours\n      Country: global\n    ",
  "youtubeVideo": null,
  "internalLinks": [
    "/blog/tips-for-growth",
    "/resources/ecommerce-guide"
  ],
  "references": [
    "https://foundertoolkit.org/",
    "https://www.forbes.com/councils/forbesagencycouncil/2024/10/21/17-expert-tips-to-get-creativity-flowing-when-inspiration-runs-dry/",
    "https://www.linkedin.com/pulse/13-ways-get-your-creative-juices-flowing-when-youre-feeling-karp",
    "https://flocksy.com/resources/10-ways-for-designers-to-keep-their-creative-juices-flowing/",
    "https://geediting.com/if-your-creative-well-is-dry-these-9-strategies-can-replenish-it/",
    "https://medium.com/@missafayres/what-to-do-when-the-creative-juices-run-dry-8e97b346d9a7",
    "https://www.theadminzone.com/threads/what-do-you-do-to-get-your-creative-juices-flowing.130140/page-2",
    "https://klout9.co/ways-stay-inspired-keep-creative-juices-flowing/",
    "https://ask.metafilter.com/269601/Running-on-creative-fumes"
  ],
  "existingPosts": "",
  "targetKeywords": [],
  "timestamp": "2025-03-04",
  "nudge": "i9j81"
}