{
  "initialUrl": "https://playpickups.app/",
  "initialResearchSummary": "‎Play Pickups on the App Store Apple Store Mac iPad iPhone Watch Vision AirPods TV & Home Entertainment Accessories Support 0+ App Store Preview Play Pickups 4+ Play Sports with New Friends‪!‬ Kush Desai Free iPhone Screenshots Description Play Pickups - Connect, Socialise & Play Sports with New Friends! Say goodbye to boring meet-ups and hello to thrilling sports connections! Play Pickups: Your Ultimate Social Sports Networking App Play Pickups is the go-to app for sports lovers looking to make meaningful connections through sports. We’re dedicated to helping you meet new people, discover local games, and get out there to play – all for free! Take a break from typical social settings and make new friends on the field, court, or pitch. Whether you’ve just moved to a new city, started university, or simply don’t have friends who play your favourite sport, Play Pickups is here to bridge that gap. Get ready to discover, connect, and play with like-minded sports enthusiasts who share your passion for sports. With over 20 different sports to choose from, Play Pickups takes socialising to the turfs and courts for a healthier, more exciting way to meet new people! Key Features: - Instantly Connect with Nearby Players: Find people around you who share your love for sports and want to play right now! With our location-based technology, you can easily meet players with similar skill levels who are ready to hit the courts or fields. - Discover Local Pick-Up Games & Events: Explore and join local pick-up games, tournaments, and events happening nearby. It’s easy to RSVP, check event details, and join in the fun with just a few taps. - Create or Join Sports Groups: Build your community of sports buddies by joining or creating groups based on your favourite sport, skill level, or location. Stay connected and organised with notifications for upcoming games and events. - Personalised Match Suggestions: Get customised suggestions on players, events, and groups that align with your interests and skill level. Never miss a chance to play and meet new people! - Integrated Messaging & Scheduling: Chat with other players, set up games, and manage your schedule – all within the app. You’ll never need to switch apps to make plans again! - Play Over 20 Sports: From popular sports like Football (Soccer), Tennis, and Cricket to unique options like Pickleball, Padel, and Flag Football, there’s something for everyone on Play Pickups. Plus, we even cater to indoor games like Chess and Poker for all-around fun! Who Should Use Play Pickups? - New Residents: Just moved for work? Don’t know where to start meeting people? Play Pickups connects you with locals who love your favourite sports, making it easy to break the ice and build new friendships. - University/College Students: Connect with fellow students who love the same sports, or explore new sports with new friends. Your campus experience just got more exciting! - Social Sports Enthusiasts: Looking for a healthier way to socialise? Join the community that’s taking fun beyond bars and cafes and onto the field. Playing sports together is a great way to make lasting connections! Why Choose Play Pickups? Play Pickups is completely free to join and free to use. We believe in bringing people together through sports, making it easy to find your community, get active, and have fun. Unlike other social apps, we prioritise connections based on shared interests, skill levels, and location, so you can experience a whole new way of socialising. Download Play Pickups today and start connecting with people who share your love for sports! --- Technical Details: - Category: Sports, Social Networking - Age Rating: Suitable for all ages - Price: Free - Languages: English (more languages coming soon) Join the Play Pickups community now and discover the healthier, more exciting way to socialise! App Privacy The developer, Kush Desai, indicated that the app’s privacy practices may include handling of data as described below. For more information, see the developer’s privacy policy. Data Linked to You The following data may be collected and linked to your identity: Contact Info User Content Identifiers Data Not Linked to You The following data may be collected but it is not linked to your identity: Usage Data Diagnostics Privacy practices may vary, for example, based on the features you use or your age. Learn More Information Seller Kush Desai Size 8.6 MB Category Sports Compatibility iPhone Requires iOS 13.0 or later. iPod touch Requires iOS 13.0 or later. Languages English Age Rating 4+ Copyright © Kush Desai Price Free Developer Website App Support Privacy Policy Developer Website App Support Privacy Policy You Might Also Like Pi-Play:Play Padel, Pickleball Sports Hockey Community Sports FIFA Player App Sports Scores App for Pro Basketball Sports Scores and Odds Sports Betting Sports TNNS: Tennis Live Scores Sports Copyright © 2025 Apple Inc. All rights reserved. Internet Service Terms App Store & Privacy Cookie Warning Support More ways to shop: Find an Apple Store or other retailer near you. Or call 1-800-MY-APPLE. Choose your country or region Copyright © 2024 Apple Inc. All rights reserved. Privacy Policy Terms of Use Sales and Refunds Legal Site Map",
  "researchResults": [
    {
      "url": "https://www.pqbnews.com/community/whats-on-a-list-of-pqb-community-events-week-of-march-3-2025-7849420",
      "content": "Published Time: 2025-03-03T05:30:00Z WHAT’S ON: A list of PQB community events, week of March 3, 2025 - Parksville Qualicum Beach News Skip to content × Play Newsletter Signup Are you a FREE member? Login to your free account to access special features, including newsletters.Sign In Support Local News Subscribe today & join a community of passionate readers who believe in our journalists and meaningful storytelling.Subscribe Now Create a Free Account Contact Us News Local News Newsletters Subscribe BC National World News Entertainment Sports Business Trending Now Opinion Submit News Tips Nanaimo News Bulletin Cowichan Valley Citizen Ladysmith Chronicle Chemainus Valley Courier Tofino-Ucluelet Westerly News Vancouver Island Free Daily Neighbours Nanaimo News Bulletin Cowichan Valley Citizen Lake Cowichan Gazette Chemainus Valley Courier Ladysmith Chronicle Tofino-Ucluelet Westerly News Vancouver Island Free Daily Newsletters E-Editions Public Notices Obituaries Obituaries Celebrations of Life Funeral Care Services In Memory Place an Obituary Community Our Community Event Calendar Lost & Found Pets Do Some Good Good News Life Local Travel More Good News Our Community Public Notices Video Photo Galleries Travel West Coast Traveller Cannabis Today's Home Podcasts Food Life Puzzles Contact Us Contests Puzzles Contests Shop Impress Stories Savvy Shopper Real Estate Impress TV The Business Directory Add Your Business Flyers E-Editions Classifieds All Classifieds Autos Driver’s Seat Garage Talk Jobs Local Work Obituaries Celebrations of Life Funeral Care Services In Memory Place an Obituary Weather Contact Us About Us Contact Information Our Team Black Press Media Search Type Site Search Home Community WHAT’S ON: A list of PQB community events, week of March 3, 2025 Send your event listings to editor@pqbnews.com Philip Wolf Mar 2, 2025 9:30 PM Share by Email Share on Facebook Share on X Share on LinkedIn Print Share via Text Message (PQB News file) Listen to this article 00:25:19 MARCH 4 Parksville and District Rock and Gem Club: General meeting, 7 p.m. at Qualicum Beach Civic Centre, 747 Jones St., Qualicum Beach. Speaker: Michael Outhwaite on rockhounding in Morocco. Info: http://pdrockandgem.org/ or pdrockandgem24@shaw.ca. MARCH 5 Oceanside Photographic Society: Proud to announce Jason Duncan as our guest speaker during our general meeting. Topic will be 'Seascapes’. Jason is a local award-winning landscape and seascape photographer. His evocative imagery has been featured in prestigious publications, exhibitions and online platforms. Find out more at bluebackproductions.com; 7-9:15 p.m. in the West Hall of the QB Civic Centre. $10 entrance fee. Coffee and cookies are available by donation during the intermission. Info: oceansidephotographers.ca. MARCH 6 Concord Masonic Lodge No. 79: Involved in various charitable activities in the community and on Vancouver Island including providing bursaries to local high school students in need of funding to attend post-secondary education. Our Lodge meets on the first Thursday of each month for our regular meetings to join in fellowship and practice Freemasonry in Oceanside. Meeting at Concord Masonic Temple 136 Memorial Ave. Doors open at 6 p.m. for dinner and Brotherhood, Lodge tyles at 7:30 p.m. Guests & Sojourning Brethren welcome. Men interested in the world’s oldest fraternity, please contact Concord Lodge through our website. www.concordlodge79.com. MARCH 8 Canadian Federation of University Women Parksville Qualicum: International Women's Day celebration with guest speaker, Alexandra Morton, known for her 30-year study of killer whales in the Broughton Archipelago, 2 p.m. to 4 p.m., Knox United Church, 345 Pym St. Everyone invited. Admission by donation. Info: president@cfuwpq.ca or http://cfuwpq.ca. MARCH 11 Qualicum Beach Garden Club: 'FUSION Gardening with Sean James'; 7:30 p.m. (doors at 7); Zoom Presentation on the big screen from Toronto. 747 Jones Ave.(Civic Centre). $5 - Guests/$15-yearly membership. E-transfer to: Qbgardenclub.membership@gmail.com. Info: QualicumBeachGardenClub.ca. MARCH 12 Mount Arrowsmith Rhododendron Society (MARS): General Meeting. 7:30 p.m., Qualicum Beach Civic Centre, 747 Jones St. Speaker: Bob Duncan will speak on growing fruit trees on Vancouver Island. Info: www.marsrhodos.ca. MARCH 15 Wild Salmon Jamboree: Fundraiser dance held on unceded Qualicum First Nation territory at the Lighthouse Community Center in Qualicum Bay. Purchase tickets here: https://www.zeffy.com/ticketing/wild-salmon-jamboree. The Silent Auction portion of the dance will feature stellar works of art by famous Kwakwa̱ka̱'wakw artists who follow in the footsteps of our ancestors by being in good relationship with our relatives the wild salmon. Proceeds of the dance and the Silent Auction will go directly to a 'Na̱mg̱is First Nation account exclusively for their battle to save wild salmon. Info: Chief Victor Isaac: victor.isaac@namgis.bc.ca; Laura Cranmer at lauracranmer@gmail.com; Homiskanis (Don Svanvik): donaldsvanvik@gmail.com. ONGOING Rotary Club of Parksville: New members welcome. Club meets at the Parksville Community Centre, 223 Mills St., every second and fourth Wednesday from 5:30 p.m. to 7 p.m. Weekly Bottle Drop, every Saturday from 10 a.m. to 2 p.m. at Speedy Glass in Parksville. All recyclable bottles, cans and milk cartons accepted, with funds raised going back into the community. Info: www.parksvillerotary.ca. Royal Canadian Legion Qualicum Beach Branch 76: Open 1 p.m. to 7 p.m., seven days a week; Ladies Pool, Tuesday, 1 p.m. and Drop-in pool 1 p.m.; Darts - League Tuesdays - 6:30 p.m., Casual Fridays, 6 p.m. Meat Draws - Friday & Saturday from 4-6 p.m. in the lounge. Mexican Train - Thursdays 1 p.m. Monthly Birthday Celebration: second Wednesday of the month, 4 p.m. Bring appies, cake served; Duplicate Bridge - Monday and Friday, 12:30 p.m. to 4 p.m. in the hall. Wings & Singo: March 3 and March 17 Irish Stew; Food, 5-7 p.m., Music 5:30-7:30 p.m. Art Night: March 5; Tickets: $45; buy wine get a ticket a win a free entry; St. Patrick's Day - Irish Dinner & Dance - March 15 at p.m. Tickets: $25. Royal Canadian Legion Bowser – Branch 211: Winter hours: Wednesdays through Saturdays, lounge opens at 3 p.m. Wednesdays: Ladies Pool and Cribbage - 4 p.m. Thursdays: Men's Pool and Darts - 6 p.m. Meat Draws - Fridays at 5 p.m. and Saturdays at 4:30 p.m. Snooker - Sundays at 2 p.m. Live Music Jams, second an fourth Fridays each month. Info: 250-757-9222; www.rcl211.org; rcl211@shaw.ca. Members, guests and prospective members always welcome. Royal Canadian Legion Mt. Arrowsmith, Branch 49 Parksville: A community-based service organization offering social and recreation activities plus weekly lunch and dinner specials. Guests welcomed to drop in and see what we’re about. Tuesday: Canasta –1 p.m., Ladies Pool –7 p.m., Darts - 7 p.m. Wednesday: 9-ball mixed singles Pool –1 p.m., Cribbage –1:15 p.m., Drop-In Dance Nights 6:30-9 p.m. Thursday: Kitchen opens 11 a.m. to 1 p.m., 8-ball mixed singles Pool–11 a.m., Euchre 1 p.m., Dominoes/Mexican Train –1:30 p.m. Friday: 10 Card Crib – 1 p.m.; Friday dinners 4:30-6:30 p.m. Saturday: 8-ball mixed doubles Pool-11 a.m., Meat Draw 3-5 p.m. Book a private function, or community event. Catering available. Office: 250-248-5633 between 8:30 a.m.-2:30 p.m. Monday to Friday. Qualicum Beach Farmers Market: A vibrant hub of local commerce and community connection. Join us every Saturday, 8:30 a.m. to noon, on Veterans Way, throughout the year, for a diverse assortment of vendors. The market also features live music, children’s activities, and food trucks, creating a lively atmosphere that’s enjoyable for all ages. Qualicum Run Club: New outdoor fitness club for slow pace women - friends, fitness, coffee! Ongoing year-round, running every month in all weather. Includes athletic conditioning, structured beginner fitness program and fun active community for women who ‘hate running!’ We meet Mondays, Wednesdays and Fridays from 9-10 a.m., adding new times as we grow. Membership is $150/month. Licensed, experienced, and insured. Welcoming women with pace 8:30 min/km and slower (13-20 min/mile), we run 2-3 miles in the hour on mostly urban routes. Register at qualicumrunclub.ca. Oceanside Women’s Business Network: Did you know there’s a women’s dinner and networking group here in Oceanside? If you’re a woman in business looking to grow your community and network, we’d love to have you join us! The OWBN meets once a month, on the third Tuesday of the month, 5:30 p.m. to 8 p.m. Reach out to info@owbn.ca for more details. Info: www.owbn.ca. Oceanside Orcas MS Support Group - MS Canada: Is MS new to you or someone you know? Or have you been coping for years and want a space to meet like minded folks to share experiences? Then this might be the group for you. We meet on the third Friday of every month, in person, in Parksville. Please contact MS Canada staff to learn more and join. Phone: 1-844-859-6789 Email: msnavigators@mscanada.ca. Website: https://mscanada.ca/find-support/ms-support-groups/vancouver-island-oceanside-ms-support-group. Arrowsmith Needle Arts Guild: This group of embroiderers meets twice monthly in Parksville. Stitchers at all levels are welcome to come and explore all types of stitches, new ideas and make new friends. Meetings details from Lynda at 250-927-4015 and/or Moyra at 250-248-7108. Parksville Community Centre: Men’s Coffee and Conversation drop-in every Tuesday 10 a.m. to noon by donation. Women’s Coffee and Conversation drop-in every Friday 10 a.m. to noon by donation. Community Wagon: Welcoming newcomers every Wednesday from 10 a.m. to noon. Come by and get a complimentary gift bag. Oceanside Caregivers: Meet the last Thursday of each month (Feb. 28) at 1 p.m. at The Gardens Long Term Care, 650 Berwick Rd., North, in Qualicum Beach. We bring support by way of understanding, caring and resources, in a confidential setting. Info: 250-752-2104 or caroldowe@gmail.com. Parksville/Qualicum Fish & Game: The Dorman Shotgun Range is a fully licensed, well-equipped shooting range located on Dorman Road in Qualicum Beach. Shooters young and old at all levels of expertise are welcome. Practice shooting for Trap and Skeet are scheduled Sundays at 10:00 a.m. and every even-numbered Wednesday at 11 a.m. PGOSA: Has sports, games, dancing and socials for Oceanside residents 55 or older. Get more info on Parksville Golden Oldies Sports Association website, PGOSA.org, or join at Oceanside Place Arena Wednesday mornings from 9:30 a.m. to 11 a.m. Get active, make friends and have fun! Parksville Lawn Bowling Club: Offering activities to beat the winter blahs from October through March, 2025. Crib and bridge, both at 1 p.m. Cost is $3 per person per visit. Public is welcome. We offer a friendly atmosphere and accessible facilities. 149 E. Stanford. Info: parksvillelawnbowlingclub.com. Save-on-Foods/ Parksville Lions Free Family Skate: Welcome back skaters to Oceanside Place Arena for free family skating on Sundays. Sessions from noon to 1:30 p.m. include ice rental, free loaner skates, loaner helmets and learn-to-skate aids. Through March 16. Morning Yoga Flow: Join ACRA's new instructor Tracy for this entry-level yoga flow class every Friday morning from 10 a.m. to 11 a.m. at the Meadowood Community Centre, 1830 Galvin Pl., Qualicum Beach. Classes through March 21. Admission by donation. Drop-ins welcome. Info: www.arrowsmithrecreation.ca/morning-yoga-flow. Oceanside Stroke Recovery Society: Providing therapy and support to stroke survivors and their caregivers. Meets Fridays at St. Columba Church Hall, 921 Wembley Rd., Parksville at 11 a.m. Info: 250-586-6766. CFUW PQ: 40th annual book sale donation drop box is located on the side of Save-On-Foods, facing Canadian Tire. We appreciate donations of gently used books and puzzles. For a large donation, please email booksale@cfuwpq.ca. Most of the sale’s proceeds are used for scholarships and other projects supporting women in District 69. Our next sale is Sept. 23-28, 2025, at Arrowsmith Hall in Coombs. Qualicum Beach Museum: Now open Saturdays from 1-4 p.m. 'Learning Saturdays' are great for families with children, and include a child-focused activity with a different theme each month. Info: 250-752-5533. Parksville PROBUS Club: We are a group of retirees enjoying friendship and fun activities for singles, couples and especially newcomers in Parksville. We are a very friendly bunch and have awesome guest speakers plus a broad range of interesting activities and social events. We meet at 9:15 a.m. on the third Monday of most months in the Parksville Community Centre, 223 Mills St. Visitors are welcome. $5 entrance fee covers coffee and light refreshments. Info: probusmembershipchair@gmail.com or call Lila 250-816-2708. MARCH 17: Speaker Renate Sutherland; \"How my Life has Gone to the Dogs\". Sutherland has spent 5 years volunteering to board and support the training of OSI-PTSD service dogs, where she has had the pleasure of working with 8 dogs so far and is looking forward to many more dogs to board, help train and love! Qualicum Beach PROBUS Group: We are an active social group of retired and semi-retired seniors which meets on the first Tuesday each month at 9 a.m. at St. Stephen’s Church (150 Village Way, Qualicum Beach). We have a variety of interesting and diverse speakers and several special interest groups. We welcome guests interested in exploring, joining us and meeting new friends. Check out our activities at www.qbprobus.com. NWB PROBUS Club Nanoose Bay: First Friday of each month. Please join us at 9:15 a.m. at St. Mary’s Church Hall 2600 Powder Point Rd. Meet new friends over coffee and goodies and enjoy interesting speakers. $5. Visitors/new members welcome. Info: nwbprobus.org. Lighthouse Community Hall: 240 Lions Way, Qualicum Bay. Second Sunday of each month a local charity hosts our Open Market (8 a.m. to noon) and Pancake Breakfast (8 a.m. to 11:30 a.m.). For information on table rentals contact Barb: vendors@lighthousehall.ca. Pancake breakfast contact the office: admin@lighthousehall.ca or 778-424-9900. Qualicum Beach and Area Newcomers: Meet the second Tuesday of every month, 10 a.m., at St. Stephen’s Church Hall, 150 Village Way, Qualicum Beach. All residents welcome. Info: qbnewcomers.org. Oceanside Music: Mondays: Oceanside Adult Beginners Band. If you’ve never played an instrument or want to learn another, this is the perfect opportunity to learn. Under the direction of Ed Dumas, lessons take place on Mondays at 2:30 p.m. at the Berwick Seniors Community Living in Parksville, or 7 p.m. at the St. Anne/St. Edmund church in Parksville. Tuesdays: Oceanside Concert Choir. Everyone welcome. No auditions required. Rehearsals are every Tuesday from 7-9 p.m. at the Knox United Church, Parksville. Oceanside Concert Band. Suitable for musicians with some experience. No auditions required. Rehearsals are every Tuesday from 7-9 p.m. at the St. Anne/St. Edmund church, Parksville. Wednesdays: Oceanside Consort A Cappella Singers. Rehearsals are every Wednesday from 7-9 at the Knox United Church, Parksville. For all: visit oceanside-music.ca, email consort@oceanside-music.ca, or call 250-594-4755 for more information. Seated Tai Chi: Tuesdays 10:30-11:30 a.m., Nanoose Place (Committee Room), Nanoose Bay. Helpful for everybody, and especially students with health and mobility issues. While seated in class, students learn movements which help to increase circulation, as well as to improve joint mobility, and to stretch the tendons and ligaments. Info: 778-744-0413; midislandtaichi.org. By donation. Coronation Street Social Club of Oceanside: Meets September thru June on the second Thursday each month at Qualicum Beach Legion (downstairs) 2 p.m. to 4 p.m.. If you are looking for a fun, social group come and join us for lively talk, shared stories and meet new friends. Don’t need to be a fan of the show, all that’s required is a sense of humour. Tea, coffee and refreshments will be served. Info: 240-594-1965. Coombs Rodeo Grounds: Pancake Breakfast and Flea Market, the first Sunday of each month. For table rentals, call Val at 250-752-9735. More info: 250-927-2747. Coombs Country Opera: third Friday of each month. Open mic music for everyone, not just country. Musicians and kids free, adults $5. Coffee and cookies. Smart Recovery: Meetings are Saturdays at 10 a.m. and Wednesdays at 6:30 p.m.. New Women's Only meeting on Tuesdays at 6:30 p.m., starting on Jan. 7, 2025. All meetings at 245 Hirst Ave. W. Info: 250-586-3727. Oceanside Wood Carvers: Meet every Thursday morning 9 a.m. at Qualicum Beach Elementary School (699 Claymore Rd.). Enter from the west end side door to woodworking room on left. Info: Bob McInnes at 250-586-8689 or r.j.mcinnes@shaw.ca. Parksville Tops 985 Weight Loss Support Group: Meetings: Wednesday at 6:15 p.m. Weigh-in: 5-6 p.m., Parksville Seniors Drop in Centre 144 Middleton Ave., Parksville. Parking and enter from the alley entrance. Info: Liz, 250-954-1809. TOPS (Take Off Pounds Sensibly): Qualicum 4754 is a weight-loss non-profit support group. We meet every Tuesday morning from 10 a.m. to 11 a.m. at 184A, Second Ave W, Qualicum. Meeting includes a weigh-in and program. Info: Janice 250-738-6220. Oceanside Chess Club: Meet on Saturdays from 11 a.m. to 3 p.m. at St. Marks Church, 138 Hoylake Rd W., in the basement. No cost to attend; small donations appreciated. All welcome. Arbutus Toastmasters : Provides a safe, friendly environment to learn and practise the art of public speaking. Gain confidence and find your voice. We meet in person every Monday night (except stats) 7-9 p.m. at our NEW LOCATION: Inclusion Parksville building 249 Hirst Rd. West, Parksville. For more info please call 250-248-1926 or arbutus.toastmastersclubs.org. Qualicum Beach Seniors’ Activities Centre: 703 Memorial Ave., Qualicum Beach. SUNDAYS: Contract Bridge, 1 p.m. MONDAYS: Knitting in Lounge/crocheting for Manna, 9:30-11 a.m. Yoga, 9:30-10:30 a.m., Chair Yoga, 11 a.m.-noon, Qualicum Beach Ukulele Band, 12:30-2:30 p.m., Beginner Ukulele in Lounge, 3-4 p.m., Line Dance I, 3-4 p.m., Line Dance II, 4-5 p.m., Ballroom dance practice, 5-6 p.m., TUESDAYS: Fun Bridge, 9 a.m. -noon., Group of 8 in lounge Full 9-10 am, Whist 12:30 to 3 p.m., Songbirds, 3-4:30 p.m. WEDNESDAYS: Hatha Yoga, 10-11:15 a.m., Fun With Chaz Guitar in lounge, 12:30 -1:45 p.m., Intermediate Spanish Conversation, 11:30 a.m. -12:30 p.m., Chair Yoga, 1-2 p.m., Book Club in the Lounge, 2:15 - 3:15 p.m.., Drawing & Painting, 2:30 - 4 p.m., TOPS, 3:45-5 p.m., Acappella Choir, 7-9:30 p.m. THURSDAYS: Beginner Bridge Lessons, 9:30-11:30 a.m., Darts - 10 a.m-12:15 p.m., Technology Tutor in Lounge, 1:30 -3:30 p.m., Drop-in Bridge, 12:30-3 p.m. Line Dancing, 4-5 p.m., Ballroom Dance, 5-6 p.m., Dance Practice, 6-7 p.m., FRIDAYS: Ukulele Friday, 10 a.m. - noon., Introduction to American Mahjong, Lounge, 10 a.m.-noon., Mahjong in the Lounge, 1-3 p.m., Art, 1-3 p.m. SATURDAYS: Hatha Yoga With Richard, 9:45 to 11 a.m., Qi Gong 11:15 a.m. to 12:15 p.m. Victoria’s Quilts: Making quilts for cancer patients. Meeting every third Tuesday of the month September to June 9:30 a.m. 3ish at Nanoose Place Community Centre 2925 Northwest Bay Rd. New sewers welcome all supplies provided. Info: koolpj43@shaw.ca. Qualicum Beach FamilySearch Centre: Interested in adding to your family tree or finding out more about your grandparents? When you visit the Family Search Centre our volunteers are there to help you. Access to nine major family history websites including Ancestry. The centre is located at 591 Arbutus Rd., Qualicum Beach within the Church of Jesus Christ of Latter Day Saints. It is open every Wednesday from 10 a.m. to 2 p.m. Drop-ins welcome or make an appointment with Liz at 250-586-3575. Qualicum History Tours: Historical walking tours with an experienced local guide leave every Tuesday from the Qualicum Beach Museum. $20 per person. Info: 604-754-4465. Overeaters Anonymous: Have you tried to control your eating, your weight, and nothing has worked? Join Overeaters Anonymous, we are recovering compulsive overeaters, under-eaters, food addicts, anorexics, bulimics, binge eaters and over exercisers. We meet at Knox United Church at 7:30 p.m. Tuesdays in Parksville. Info: oaviig.org. Smart Recovery Meetings: Wednesdays at 6:30 p.m. and Saturdays at 10 a.m. at SOS at 245 Hirst Ave. Questions call John at 250-586-3727. Oceanside A Cappella: Welcomes women singers of all ages. Rehearsals every Wednesday from 7 p.m. to 9 p.m. at the Senior Activity Centre in Qualicum Beach. Director Rosemary Lindsey. Info: oceansideacappella@gmail.com. Too Hot for Covers: Song Circle every Wednesday, Parksville Memorial Plaza, 3 p.m. to 6 p.m. Info: 250-927-2559. See a typo/mistake? Have a story/tip? About the Author: Philip Wolf I’ve been involved with journalism on Vancouver Island for more than 30 years, beginning as a teenage holiday fill-in at the old Cowichan News Leader. Read more This has been shared 0 times 0 Shares Share by Email Share on Facebook Share on X Share on LinkedIn Print Share via Text Message Related WHAT’S ON: A list of PQB community events, week of Feb. 24, 2025 Feb 23, 2025 9:30 PM Facebook Comments (0)Dialogue and debate are integral to a free society and we welcome and encourage you to share your views on the issues of the day. We ask that you be respectful of others and their points of view, refrain from personal attacks and stay on topic. To learn about our commenting policies and how our community-based moderation works, please read our Community Guidelines. Featured Local Savings Today in B.C. ‘Absolutely unreal’: Wounded Warrior runners end 800-km journey in Victoria Hidden history: Volunteer on a mission to restore forgotten Island cemetery Vancouver Island seniors finding canine love connections through Elder Dogs B.C. Transit looks to secure parts for buses built by failed Vancouver-area company Adaptive hockey helping more Vancouver Islanders enjoy Canada’s passion More from Today in B.C. > Parksville Qualicum Beach News About Us Contact Us Advertising Support Centre Terms of Service Privacy Policy Join our Team News Local News Newsletters Subscribe BC National World News Entertainment Sports Business Trending Now Opinion Submit News Tips Neighbours Nanaimo News Bulletin Cowichan Valley Citizen Lake Cowichan Gazette Chemainus Valley Courier Ladysmith Chronicle Tofino-Ucluelet Westerly News Vancouver Island Free Daily Newsletters E-Editions Public Notices Obituaries Obituaries Celebrations of Life Funeral Care Services In Memory Place an Obituary Community Our Community Event Calendar Lost & Found Pets Do Some Good Good News Life Local Travel More Good News Our Community Public Notices Video Photo Galleries Travel West Coast Traveller Cannabis Today's Home Podcasts Food Life Contact Us Contests Puzzles Contests Shop Impress Stories Savvy Shopper Real Estate Impress TV The Business Directory Add Your Business Flyers E-Editions Classifieds All Classifieds Autos Driver’s Seat Garage Talk Jobs Local Work Obituaries Celebrations of Life Funeral Care Services In Memory Place an Obituary Weather © 2025 Parksville Qualicum Beach News and Black Press Media Publications Contact",
      "title": "Published Time: 2025-03-03T05:30:00Z WHAT’S ON: A list of PQB community events, week of March 3, 2025 - Parksville Qualicum Beach News Skip to content × Play Newsletter Signup Are you a FREE member? Login to your free account to access special features, including newsletters.Sign In Support Local News Subscribe today & join a community of passionate readers who believe in our journalists and meaningful storytelling.Subscribe Now Create a Free Account Contact Us News Local News Newsletters Subscribe BC National World News Entertainment Sports Business Trending Now Opinion Submit News Tips Nanaimo News Bulletin Cowichan Valley Citizen Ladysmith Chronicle Chemainus Valley Courier Tofino-Ucluelet Westerly News Vancouver Island Free Daily Neighbours Nanaimo News Bulletin Cowichan Valley Citizen Lake Cowichan Gazette Chemainus Valley Courier Ladysmith Chronicle Tofino-Ucluelet Westerly News Vancouver Island Free Daily Newsletters E-Editions Public Notices Obituaries Obituaries Celebrations of Life Funeral Care Services In Memory Place an Obituary Community Our Community Event Calendar Lost & Found Pets Do Some Good Good News Life Local Travel More Good News Our Community Public Notices Video Photo Galleries Travel West Coast Traveller Cannabis Today's Home Podcasts Food Life Puzzles Contact Us Contests Puzzles Contests Shop Impress Stories Savvy Shopper Real Estate Impress TV The Business Directory Add Your Business Flyers E-Editions Classifieds All Classifieds Autos Driver’s Seat Garage Talk Jobs Local Work Obituaries Celebrations of Life Funeral Care Services In Memory Place an Obituary Weather Contact Us About Us Contact Information Our Team Black Press Media Search Type Site Search Home Community WHAT’S ON: A list of PQB community events, week of March 3, 2025 Send your event listings to editor@pqbnews.com Philip Wolf Mar 2, 2025 9:30 PM Share by Email Share on Facebook Share on X Share on LinkedIn Print Share via Text Message (PQB News file) Listen to this article 00:25:19 MARCH 4 Parksville and District Rock and Gem Club: General meeting, 7 p.m. at Qualicum Beach Civic Centre, 747 Jones St., Qualicum Beach. Speaker: Michael Outhwaite on rockhounding in Morocco. Info: http://pdrockandgem.org/ or pdrockandgem24@shaw.ca. MARCH 5 Oceanside Photographic Society: Proud to announce Jason Duncan as our guest speaker during our general meeting. Topic will be 'Seascapes’. Jason is a local award-winning landscape and seascape photographer. His evocative imagery has been featured in prestigious publications, exhibitions and online platforms. Find out more at bluebackproductions.com; 7-9:15 p.m. in the West Hall of the QB Civic Centre. $10 entrance fee. Coffee and cookies are available by donation during the intermission. Info: oceansidephotographers.ca. MARCH 6 Concord Masonic Lodge No. 79: Involved in various charitable activities in the community and on Vancouver Island including providing bursaries to local high school students in need of funding to attend post-secondary education. Our Lodge meets on the first Thursday of each month for our regular meetings to join in fellowship and practice Freemasonry in Oceanside. Meeting at Concord Masonic Temple 136 Memorial Ave. Doors open at 6 p.m. for dinner and Brotherhood, Lodge tyles at 7:30 p.m. Guests & Sojourning Brethren welcome. Men interested in the world’s oldest fraternity, please contact Concord Lodge through our website. www.concordlodge79.com. MARCH 8 Canadian Federation of University Women Parksville Qualicum: International Women's Day celebration with guest speaker, Alexandra Morton, known for her 30-year study of killer whales in the Broughton Archipelago, 2 p.m. to 4 p.m., Knox United Church, 345 Pym St. Everyone invited. Admission by donation. Info: president@cfuwpq.ca or http://cfuwpq.ca. MARCH 11 Qualicum Beach Garden Club: 'FUSION Gardening with Sean James'; 7:30 p.m. (doors at 7); Zoom Presentation on the big screen from Toronto. 747 Jones Ave.(Civic Centre). $5 - Guests/$15-yearly membership. E-transfer to: Qbgardenclub.membership@gmail.com. Info: QualicumBeachGardenClub.ca. MARCH 12 Mount Arrowsmith Rhododendron Society (MARS): General Meeting. 7:30 p.m., Qualicum Beach Civic Centre, 747 Jones St. Speaker: Bob Duncan will speak on growing fruit trees on Vancouver Island. Info: www.marsrhodos.ca. MARCH 15 Wild Salmon Jamboree: Fundraiser dance held on unceded Qualicum First Nation territory at the Lighthouse Community Center in Qualicum Bay. Purchase tickets here: https://www.zeffy.com/ticketing/wild-salmon-jamboree. The Silent Auction portion of the dance will feature stellar works of art by famous Kwakwa̱ka̱'wakw artists who follow in the footsteps of our ancestors by being in good relationship with our relatives the wild salmon. Proceeds of the dance and the Silent Auction will go directly to a 'Na̱mg̱is First Nation account exclusively for their battle to save wild salmon. Info: Chief Victor Isaac: victor.isaac@namgis.bc.ca; Laura Cranmer at lauracranmer@gmail.com; Homiskanis (Don Svanvik): donaldsvanvik@gmail.com. ONGOING Rotary Club of Parksville: New members welcome. Club meets at the Parksville Community Centre, 223 Mills St., every second and fourth Wednesday from 5:30 p.m. to 7 p.m. Weekly Bottle Drop, every Saturday from 10 a.m. to 2 p.m. at Speedy Glass in Parksville. All recyclable bottles, cans and milk cartons accepted, with funds raised going back into the community. Info: www.parksvillerotary.ca. Royal Canadian Legion Qualicum Beach Branch 76: Open 1 p.m. to 7 p.m., seven days a week; Ladies Pool, Tuesday, 1 p.m. and Drop-in pool 1 p.m.; Darts - League Tuesdays - 6:30 p.m., Casual Fridays, 6 p.m. Meat Draws - Friday & Saturday from 4-6 p.m. in the lounge. Mexican Train - Thursdays 1 p.m. Monthly Birthday Celebration: second Wednesday of the month, 4 p.m. Bring appies, cake served; Duplicate Bridge - Monday and Friday, 12:30 p.m. to 4 p.m. in the hall. Wings & Singo: March 3 and March 17 Irish Stew; Food, 5-7 p.m., Music 5:30-7:30 p.m. Art Night: March 5; Tickets: $45; buy wine get a ticket a win a free entry; St. Patrick's Day - Irish Dinner & Dance - March 15 at p.m. Tickets: $25. Royal Canadian Legion Bowser – Branch 211: Winter hours: Wednesdays through Saturdays, lounge opens at 3 p.m. Wednesdays: Ladies Pool and Cribbage - 4 p.m. Thursdays: Men's Pool and Darts - 6 p.m. Meat Draws - Fridays at 5 p.m. and Saturdays at 4:30 p.m. Snooker - Sundays at 2 p.m. Live Music Jams, second an fourth Fridays each month. Info: 250-757-9222; www.rcl211.org; rcl211@shaw.ca. Members, guests and prospective members always welcome. Royal Canadian Legion Mt. Arrowsmith, Branch 49 Parksville: A community-based service organization offering social and recreation activities plus weekly lunch and dinner specials. Guests welcomed to drop in and see what we’re about. Tuesday: Canasta –1 p.m., Ladies Pool –7 p.m., Darts - 7 p.m. Wednesday: 9-ball mixed singles Pool –1 p.m., Cribbage –1:15 p.m., Drop-In Dance Nights 6:30-9 p.m. Thursday: Kitchen opens 11 a.m. to 1 p.m., 8-ball mixed singles Pool–11 a.m., Euchre 1 p.m., Dominoes/Mexican Train –1:30 p.m. Friday: 10 Card Crib – 1 p.m.; Friday dinners 4:30-6:30 p.m. Saturday: 8-ball mixed doubles Pool-11 a.m., Meat Draw 3-5 p.m. Book a private function, or community event. Catering available. Office: 250-248-5633 between 8:30 a.m.-2:30 p.m. Monday to Friday. Qualicum Beach Farmers Market: A vibrant hub of local commerce and community connection. Join us every Saturday, 8:30 a.m. to noon, on Veterans Way, throughout the year, for a diverse assortment of vendors. The market also features live music, children’s activities, and food trucks, creating a lively atmosphere that’s enjoyable for all ages. Qualicum Run Club: New outdoor fitness club for slow pace women - friends, fitness, coffee! Ongoing year-round, running every month in all weather. Includes athletic conditioning, structured beginner fitness program and fun active community for women who ‘hate running!’ We meet Mondays, Wednesdays and Fridays from 9-10 a.m., adding new times as we grow. Membership is $150/month. Licensed, experienced, and insured. Welcoming women with pace 8:30 min/km and slower (13-20 min/mile), we run 2-3 miles in the hour on mostly urban routes. Register at qualicumrunclub.ca. Oceanside Women’s Business Network: Did you know there’s a women’s dinner and networking group here in Oceanside? If you’re a woman in business looking to grow your community and network, we’d love to have you join us! The OWBN meets once a month, on the third Tuesday of the month, 5:30 p.m. to 8 p.m. Reach out to info@owbn.ca for more details. Info: www.owbn.ca. Oceanside Orcas MS Support Group - MS Canada: Is MS new to you or someone you know? Or have you been coping for years and want a space to meet like minded folks to share experiences? Then this might be the group for you. We meet on the third Friday of every month, in person, in Parksville. Please contact MS Canada staff to learn more and join. Phone: 1-844-859-6789 Email: msnavigators@mscanada.ca. Website: https://mscanada.ca/find-support/ms-support-groups/vancouver-island-oceanside-ms-support-group. Arrowsmith Needle Arts Guild: This group of embroiderers meets twice monthly in Parksville. Stitchers at all levels are welcome to come and explore all types of stitches, new ideas and make new friends. Meetings details from Lynda at 250-927-4015 and/or Moyra at 250-248-7108. Parksville Community Centre: Men’s Coffee and Conversation drop-in every Tuesday 10 a.m. to noon by donation. Women’s Coffee and Conversation drop-in every Friday 10 a.m. to noon by donation. Community Wagon: Welcoming newcomers every Wednesday from 10 a.m. to noon. Come by and get a complimentary gift bag. Oceanside Caregivers: Meet the last Thursday of each month (Feb. 28) at 1 p.m. at The Gardens Long Term Care, 650 Berwick Rd., North, in Qualicum Beach. We bring support by way of understanding, caring and resources, in a confidential setting. Info: 250-752-2104 or caroldowe@gmail.com. Parksville/Qualicum Fish & Game: The Dorman Shotgun Range is a fully licensed, well-equipped shooting range located on Dorman Road in Qualicum Beach. Shooters young and old at all levels of expertise are welcome. Practice shooting for Trap and Skeet are scheduled Sundays at 10:00 a.m. and every even-numbered Wednesday at 11 a.m. PGOSA: Has sports, games, dancing and socials for Oceanside residents 55 or older. Get more info on Parksville Golden Oldies Sports Association website, PGOSA.org, or join at Oceanside Place Arena Wednesday mornings from 9:30 a.m. to 11 a.m. Get active, make friends and have fun! Parksville Lawn Bowling Club: Offering activities to beat the winter blahs from October through March, 2025. Crib and bridge, both at 1 p.m. Cost is $3 per person per visit. Public is welcome. We offer a friendly atmosphere and accessible facilities. 149 E. Stanford. Info: parksvillelawnbowlingclub.com. Save-on-Foods/ Parksville Lions Free Family Skate: Welcome back skaters to Oceanside Place Arena for free family skating on Sundays. Sessions from noon to 1:30 p.m. include ice rental, free loaner skates, loaner helmets and learn-to-skate aids. Through March 16. Morning Yoga Flow: Join ACRA's new instructor Tracy for this entry-level yoga flow class every Friday morning from 10 a.m. to 11 a.m. at the Meadowood Community Centre, 1830 Galvin Pl., Qualicum Beach. Classes through March 21. Admission by donation. Drop-ins welcome. Info: www.arrowsmithrecreation.ca/morning-yoga-flow. Oceanside Stroke Recovery Society: Providing therapy and support to stroke survivors and their caregivers. Meets Fridays at St. Columba Church Hall, 921 Wembley Rd., Parksville at 11 a.m. Info: 250-586-6766. CFUW PQ: 40th annual book sale donation drop box is located on the side of Save-On-Foods, facing Canadian Tire. We appreciate donations of gently used books and puzzles. For a large donation, please email booksale@cfuwpq.ca. Most of the sale’s proceeds are used for scholarships and other projects supporting women in District 69. Our next sale is Sept. 23-28, 2025, at Arrowsmith Hall in Coombs. Qualicum Beach Museum: Now open Saturdays from 1-4 p.m. 'Learning Saturdays' are great for families with children, and include a child-focused activity with a different theme each month. Info: 250-752-5533. Parksville PROBUS Club: We are a group of retirees enjoying friendship and fun activities for singles, couples and especially newcomers in Parksville. We are a very friendly bunch and have awesome guest speakers plus a broad range of interesting activities and social events. We meet at 9:15 a.m. on the third Monday of most months in the Parksville Community Centre, 223 Mills St. Visitors are welcome. $5 entrance fee covers coffee and light refreshments. Info: probusmembershipchair@gmail.com or call Lila 250-816-2708. MARCH 17: Speaker Renate Sutherland; \"How my Life has Gone to the Dogs\". Sutherland has spent 5 years volunteering to board and support the training of OSI-PTSD service dogs, where she has had the pleasure of working with 8 dogs so far and is looking forward to many more dogs to board, help train and love! Qualicum Beach PROBUS Group: We are an active social group of retired and semi-retired seniors which meets on the first Tuesday each month at 9 a.m. at St. Stephen’s Church (150 Village Way, Qualicum Beach). We have a variety of interesting and diverse speakers and several special interest groups. We welcome guests interested in exploring, joining us and meeting new friends. Check out our activities at www.qbprobus.com. NWB PROBUS Club Nanoose Bay: First Friday of each month. Please join us at 9:15 a.m. at St. Mary’s Church Hall 2600 Powder Point Rd. Meet new friends over coffee and goodies and enjoy interesting speakers. $5. Visitors/new members welcome. Info: nwbprobus.org. Lighthouse Community Hall: 240 Lions Way, Qualicum Bay. Second Sunday of each month a local charity hosts our Open Market (8 a.m. to noon) and Pancake Breakfast (8 a.m. to 11:30 a.m.). For information on table rentals contact Barb: vendors@lighthousehall.ca. Pancake breakfast contact the office: admin@lighthousehall.ca or 778-424-9900. Qualicum Beach and Area Newcomers: Meet the second Tuesday of every month, 10 a.m., at St. Stephen’s Church Hall, 150 Village Way, Qualicum Beach. All residents welcome. Info: qbnewcomers.org. Oceanside Music: Mondays: Oceanside Adult Beginners Band. If you’ve never played an instrument or want to learn another, this is the perfect opportunity to learn. Under the direction of Ed Dumas, lessons take place on Mondays at 2:30 p.m. at the Berwick Seniors Community Living in Parksville, or 7 p.m. at the St. Anne/St. Edmund church in Parksville. Tuesdays: Oceanside Concert Choir. Everyone welcome. No auditions required. Rehearsals are every Tuesday from 7-9 p.m. at the Knox United Church, Parksville. Oceanside Concert Band. Suitable for musicians with some experience. No auditions required. Rehearsals are every Tuesday from 7-9 p.m. at the St. Anne/St. Edmund church, Parksville. Wednesdays: Oceanside Consort A Cappella Singers. Rehearsals are every Wednesday from 7-9 at the Knox United Church, Parksville. For all: visit oceanside-music.ca, email consort@oceanside-music.ca, or call 250-594-4755 for more information. Seated Tai Chi: Tuesdays 10:30-11:30 a.m., Nanoose Place (Committee Room), Nanoose Bay. Helpful for everybody, and especially students with health and mobility issues. While seated in class, students learn movements which help to increase circulation, as well as to improve joint mobility, and to stretch the tendons and ligaments. Info: 778-744-0413; midislandtaichi.org. By donation. Coronation Street Social Club of Oceanside: Meets September thru June on the second Thursday each month at Qualicum Beach Legion (downstairs) 2 p.m. to 4 p.m.. If you are looking for a fun, social group come and join us for lively talk, shared stories and meet new friends. Don’t need to be a fan of the show, all that’s required is a sense of humour. Tea, coffee and refreshments will be served. Info: 240-594-1965. Coombs Rodeo Grounds: Pancake Breakfast and Flea Market, the first Sunday of each month. For table rentals, call Val at 250-752-9735. More info: 250-927-2747. Coombs Country Opera: third Friday of each month. Open mic music for everyone, not just country. Musicians and kids free, adults $5. Coffee and cookies. Smart Recovery: Meetings are Saturdays at 10 a.m. and Wednesdays at 6:30 p.m.. New Women's Only meeting on Tuesdays at 6:30 p.m., starting on Jan. 7, 2025. All meetings at 245 Hirst Ave. W. Info: 250-586-3727. Oceanside Wood Carvers: Meet every Thursday morning 9 a.m. at Qualicum Beach Elementary School (699 Claymore Rd.). Enter from the west end side door to woodworking room on left. Info: Bob McInnes at 250-586-8689 or r.j.mcinnes@shaw.ca. Parksville Tops 985 Weight Loss Support Group: Meetings: Wednesday at 6:15 p.m. Weigh-in: 5-6 p.m., Parksville Seniors Drop in Centre 144 Middleton Ave., Parksville. Parking and enter from the alley entrance. Info: Liz, 250-954-1809. TOPS (Take Off Pounds Sensibly): Qualicum 4754 is a weight-loss non-profit support group. We meet every Tuesday morning from 10 a.m. to 11 a.m. at 184A, Second Ave W, Qualicum. Meeting includes a weigh-in and program. Info: Janice 250-738-6220. Oceanside Chess Club: Meet on Saturdays from 11 a.m. to 3 p.m. at St. Marks Church, 138 Hoylake Rd W., in the basement. No cost to attend; small donations appreciated. All welcome. Arbutus Toastmasters : Provides a safe, friendly environment to learn and practise the art of public speaking. Gain confidence and find your voice. We meet in person every Monday night (except stats) 7-9 p.m. at our NEW LOCATION: Inclusion Parksville building 249 Hirst Rd. West, Parksville. For more info please call 250-248-1926 or arbutus.toastmastersclubs.org. Qualicum Beach Seniors’ Activities Centre: 703 Memorial Ave., Qualicum Beach. SUNDAYS: Contract Bridge, 1 p.m. MONDAYS: Knitting in Lounge/crocheting for Manna, 9:30-11 a.m. Yoga, 9:30-10:30 a.m., Chair Yoga, 11 a.m.-noon, Qualicum Beach Ukulele Band, 12:30-2:30 p.m., Beginner Ukulele in Lounge, 3-4 p.m., Line Dance I, 3-4 p.m., Line Dance II, 4-5 p.m., Ballroom dance practice, 5-6 p.m., TUESDAYS: Fun Bridge, 9 a.m. -noon., Group of 8 in lounge Full 9-10 am, Whist 12:30 to 3 p.m., Songbirds, 3-4:30 p.m. WEDNESDAYS: Hatha Yoga, 10-11:15 a.m., Fun With Chaz Guitar in lounge, 12:30 -1:45 p.m., Intermediate Spanish Conversation, 11:30 a.m. -12:30 p.m., Chair Yoga, 1-2 p.m., Book Club in the Lounge, 2:15 - 3:15 p.m.., Drawing & Painting, 2:30 - 4 p.m., TOPS, 3:45-5 p.m., Acappella Choir, 7-9:30 p.m. THURSDAYS: Beginner Bridge Lessons, 9:30-11:30 a.m., Darts - 10 a.m-12:15 p.m., Technology Tutor in Lounge, 1:30 -3:30 p.m., Drop-in Bridge, 12:30-3 p.m. Line Dancing, 4-5 p.m., Ballroom Dance, 5-6 p.m., Dance Practice, 6-7 p.m., FRIDAYS: Ukulele Friday, 10 a.m. - noon., Introduction to American Mahjong, Lounge, 10 a.m.-noon., Mahjong in the Lounge, 1-3 p.m., Art, 1-3 p.m. SATURDAYS: Hatha Yoga With Richard, 9:45 to 11 a.m., Qi Gong 11:15 a.m. to 12:15 p.m. Victoria’s Quilts: Making quilts for cancer patients. Meeting every third Tuesday of the month September to June 9:30 a.m. 3ish at Nanoose Place Community Centre 2925 Northwest Bay Rd. New sewers welcome all supplies provided. Info: koolpj43@shaw.ca. Qualicum Beach FamilySearch Centre: Interested in adding to your family tree or finding out more about your grandparents? When you visit the Family Search Centre our volunteers are there to help you. Access to nine major family history websites including Ancestry. The centre is located at 591 Arbutus Rd., Qualicum Beach within the Church of Jesus Christ of Latter Day Saints. It is open every Wednesday from 10 a.m. to 2 p.m. Drop-ins welcome or make an appointment with Liz at 250-586-3575. Qualicum History Tours: Historical walking tours with an experienced local guide leave every Tuesday from the Qualicum Beach Museum. $20 per person. Info: 604-754-4465. Overeaters Anonymous: Have you tried to control your eating, your weight, and nothing has worked? Join Overeaters Anonymous, we are recovering compulsive overeaters, under-eaters, food addicts, anorexics, bulimics, binge eaters and over exercisers. We meet at Knox United Church at 7:30 p.m. Tuesdays in Parksville. Info: oaviig.org. Smart Recovery Meetings: Wednesdays at 6:30 p.m. and Saturdays at 10 a.m. at SOS at 245 Hirst Ave. Questions call John at 250-586-3727. Oceanside A Cappella: Welcomes women singers of all ages. Rehearsals every Wednesday from 7 p.m. to 9 p.m. at the Senior Activity Centre in Qualicum Beach. Director Rosemary Lindsey. Info: oceansideacappella@gmail.com. Too Hot for Covers: Song Circle every Wednesday, Parksville Memorial Plaza, 3 p.m. to 6 p.m. Info: 250-927-2559. See a typo/mistake? Have a story/tip? About the Author: Philip Wolf I’ve been involved with journalism on Vancouver Island for more than 30 years, beginning as a teenage holiday fill-in at the old Cowichan News Leader. Read more This has been shared 0 times 0 Shares Share by Email Share on Facebook Share on X Share on LinkedIn Print Share via Text Message Related WHAT’S ON: A list of PQB community events, week of Feb. 24, 2025 Feb 23, 2025 9:30 PM Facebook Comments (0)Dialogue and debate are integral to a free society and we welcome and encourage you to share your views on the issues of the day. We ask that you be respectful of others and their points of view, refrain from personal attacks and stay on topic. To learn about our commenting policies and how our community-based moderation works, please read our Community Guidelines. Featured Local Savings Today in B.C. ‘Absolutely unreal’: Wounded Warrior runners end 800-km journey in Victoria Hidden history: Volunteer on a mission to restore forgotten Island cemetery Vancouver Island seniors finding canine love connections through Elder Dogs B.C. Transit looks to secure parts for buses built by failed Vancouver-area company Adaptive hockey helping more Vancouver Islanders enjoy Canada’s passion More from Today in B.C. > Parksville Qualicum Beach News About Us Contact Us Advertising Support Centre Terms of Service Privacy Policy Join our Team News Local News Newsletters Subscribe BC National World News Entertainment Sports Business Trending Now Opinion Submit News Tips Neighbours Nanaimo News Bulletin Cowichan Valley Citizen Lake Cowichan Gazette Chemainus Valley Courier Ladysmith Chronicle Tofino-Ucluelet Westerly News Vancouver Island Free Daily Newsletters E-Editions Public Notices Obituaries Obituaries Celebrations of Life Funeral Care Services In Memory Place an Obituary Community Our Community Event Calendar Lost & Found Pets Do Some Good Good News Life Local Travel More Good News Our Community Public Notices Video Photo Galleries Travel West Coast Traveller Cannabis Today's Home Podcasts Food Life Contact Us Contests Puzzles Contests Shop Impress Stories Savvy Shopper Real Estate Impress TV The Business Directory Add Your Business Flyers E-Editions Classifieds All Classifieds Autos Driver’s Seat Garage Talk Jobs Local Work Obituaries Celebrations of Life Funeral Care Services In Memory Place an Obituary Weather © 2025 Parksville Qualicum Beach News and Black Press Media Publications Contact"
    },
    {
      "url": "https://www.palmcoast.gov/events",
      "content": "Events | Palm Coast Connect Sign In Community About Palm Coast Activities Agendas Arts District Be Local Buy Local Business & Growth Citizens Academy Community Calendar Contact Information Emergency Management Garage Sales Garbage Collection Host an Event in Palm Coast Housing Programs Local Business Search Maps Open Houses Palm Coast Historical Society Palm Coaster Newsletter Public Safety Recreation & Events Social Popular Links Click these popular links to see the most frequently visited pages Capital Projects Garage Sales Golf Permitting Job Openings Planning Projects Discover PC Explore the beautiful vistas that make Palm Coast an incredible place to call home Discover Palm Coast Connect Departments Animal Control Building Business Tax Receipt City Clerk City Manager Code Enforcement Communications & Marketing Community Development Customer Service Engineering Finance Fire Human Resources IT Parks & Recreation Planning & Zoning Procurement Public Works Stormwater Utility Popular Links Click these popular links to see the most frequently visited pages Capital Projects Garage Sales Golf Permitting Job Openings Planning Projects Activities and Events Team PC Get to know the team that keeps our beautiful city running! Team Palm Coast Government City Logo Use Request Agendas & Minutes Budget and Financial Reports City Attorneys City Charter City Codes and Ordinances City Council City Employment Emergency Preparedness Environmental Stewardship Finance Transparency Dashboard Get Involved Keep PC Clean Lien Request Palm Coast Progress Weekly Newsletter Popular Links Click these popular links to see the most frequently visited pages Capital Projects Garage Sales Golf Permitting Job Openings Planning Projects Financial Transparency Dashboard Learn PC Everything you need to know about living and working in Palm Coast! Learn Palm Coast Jobs Parks Belle Terre Park Bird of Paradise Nature Reserve Central Park in Town Center Community Center & Park Heroes Memorial Park Indian Trails Sports Complex James F. Holland Memorial Park Lehigh Trailhead Linear Park Long Creek Nature Preserve Palm Coast Aquatics Center Palm Harbor Golf Club Ralph Carter Park Seminole Woods Neighborhood Park Southern Recreation Center The Stage At Town Center Waterfront Park Popular Links Click these popular links to see the most frequently visited pages Capital Projects Garage Sales Golf Permitting Job Openings Planning Projects Play PC Palm Coast has parks, trails, and activities that are fun for every age! Play Palm Coast Sign In How can we serve you? Enhanced Search We are excited to announce that we've significantly upgraded our search bar to help you navigate our website more easily and efficiently. With our Enhanced Search, finding exactly what you need has never been simpler. Experience faster results, more accurate suggestions, and a smoother overall browsing experience. Connect New Utility Service Building Pay Bill Contacts Feedback Quick Contact Numbers Customer Service (386) 986-2360 Animal Control (386) 986-2520 Building Services (386) 986-3780 Code Enforcement (386) 986-3764 Communications & Marketing (386) 986-2564 Finance Department (386) 986-2360 Human Resources (386) 986-3718 Fire Department (386) 986-2300 Purchasing & Contracts (386) 986-3730 Parks & Recreation (386) 986-2323 Flagler County Community Info (386) 313-4111 Flagler County Sheriff (386) 437-4116 Close Give Feedback Loading... Saving Feedback Thank you for taking the time to provide valuable feedback. What do you think of the new website? Do you have any thoughts you'd like to share? May we follow up with you on your feedback? Yes No Email address Cancel Send Close The City Experience Stay current with City of Palm Coast Events Menu Navigation Menu ##### Upcoming Events View the future events that are happening!##### Past Events See all the past events that have happened. Some of them are recoccuring! ##### Calendar View Now! See the upcoming things in our city Click to View the Calendar##### Connect Connect Today Connect Now and see your customized dashboard Connect your property to see more info##### Events Let's Go! Events happening in the community Operated by Parks and Rec.##### Help Center Learn Now Have questions? Browse our existing help articles Frequently Asked Questions##### News What's Happening Learn what's happening in Palm Coast Stay informed about what's happening Discover Trips March, 03 2025 08:30 AM - March, 03 2025 05:00 PM Join us for a recreational road trip and discover Florida while making new friends! Trivia Night March, 06 2025 06:30 PM - March, 06 2025 08:30 PM Have you got all the answers? It's time to prove it! Redefined Food Co. in partnership with the Southern Recreation Center is hosting Trivia Night once a month! Bring your friends and family for a fun challenge paired with tasty treats! PI(E) Day March, 09 2025 11:00 AM - March, 09 2025 03:00 PM Join the City of Palm Coast to commemorate this mathematical holiday! This free event will have a pie eating contest, pie throwing, a live DJ, yard games, and more! Proceeds will benefit the Flagler County Education Foundation. Luck of the Pickle: Pickleball Tournament March, 14 2025 04:00 PM - March, 16 2025 08:00 PM Test your skills against the best in Palm Coast at the Luck of the Pickle Pickleball Tournament! Food Truck Tuesday March, 18 2025 05:00 PM - March, 18 2025 08:00 PM This event makes it much awaited return starting March 18 from 5-8pm. Spring Break Camp March, 17 2025 07:30 AM - March, 21 2025 06:00 PM Enroll your child into a fun-filled week for Spring break! NCCAA Youth Sports Clinic March, 29 2025 09:30 AM - March, 29 2025 11:30 AM Sign your young athlete up for a free Sports Clinic! 2025 MedNexus Innovation Challenge April, 03 2025 05:00 PM - April, 03 2025 07:00 PM The University of North Florida, along with the City of Palm Coast and Flagler County Schools host the 2025 AdventHealth Innovation Challenge, a team-based competition showcasing regional high school students pitching their solutions to Florida’s evolving healthcare needs. Keep Palm Coast Clean: It's a Litter-ALL Effort April, 05 2025 08:00 AM - April, 05 2025 12:00 PM \"Keep Palm Coast Clean: It's a Litter All Effort!\" You can make a difference and be part of the collective effort to keep our city litter-free. Luck of the Draw Pickleball Tournament April, 05 2025 03:00 PM - April, 05 2025 09:00 PM Test your skills against the best in Palm Coast at our pickleball tournament! City of Palm Coast 160 Lake Avenue Palm Coast, FL 32164 386.986.2360 Monday-Friday 8am-5pm Accessibility Contacts Employees Webmail ESS Palm Coast U Emergency Preparedness Emergency Management Flagler County Emergency Management Flood Preparedness ALERT Palm Coast Privacy Policy Report Fraud",
      "title": "Events | Palm Coast Connect Sign In Community About Palm Coast Activities Agendas Arts District Be Local Buy Local Business & Growth Citizens Academy Community Calendar Contact Information Emergency Management Garage Sales Garbage Collection Host an Event in Palm Coast Housing Programs Local Business Search Maps Open Houses Palm Coast Historical Society Palm Coaster Newsletter Public Safety Recreation & Events Social Popular Links Click these popular links to see the most frequently visited pages Capital Projects Garage Sales Golf Permitting Job Openings Planning Projects Discover PC Explore the beautiful vistas that make Palm Coast an incredible place to call home Discover Palm Coast Connect Departments Animal Control Building Business Tax Receipt City Clerk City Manager Code Enforcement Communications & Marketing Community Development Customer Service Engineering Finance Fire Human Resources IT Parks & Recreation Planning & Zoning Procurement Public Works Stormwater Utility Popular Links Click these popular links to see the most frequently visited pages Capital Projects Garage Sales Golf Permitting Job Openings Planning Projects Activities and Events Team PC Get to know the team that keeps our beautiful city running! Team Palm Coast Government City Logo Use Request Agendas & Minutes Budget and Financial Reports City Attorneys City Charter City Codes and Ordinances City Council City Employment Emergency Preparedness Environmental Stewardship Finance Transparency Dashboard Get Involved Keep PC Clean Lien Request Palm Coast Progress Weekly Newsletter Popular Links Click these popular links to see the most frequently visited pages Capital Projects Garage Sales Golf Permitting Job Openings Planning Projects Financial Transparency Dashboard Learn PC Everything you need to know about living and working in Palm Coast! Learn Palm Coast Jobs Parks Belle Terre Park Bird of Paradise Nature Reserve Central Park in Town Center Community Center & Park Heroes Memorial Park Indian Trails Sports Complex James F. Holland Memorial Park Lehigh Trailhead Linear Park Long Creek Nature Preserve Palm Coast Aquatics Center Palm Harbor Golf Club Ralph Carter Park Seminole Woods Neighborhood Park Southern Recreation Center The Stage At Town Center Waterfront Park Popular Links Click these popular links to see the most frequently visited pages Capital Projects Garage Sales Golf Permitting Job Openings Planning Projects Play PC Palm Coast has parks, trails, and activities that are fun for every age! Play Palm Coast Sign In How can we serve you? Enhanced Search We are excited to announce that we've significantly upgraded our search bar to help you navigate our website more easily and efficiently. With our Enhanced Search, finding exactly what you need has never been simpler. Experience faster results, more accurate suggestions, and a smoother overall browsing experience. Connect New Utility Service Building Pay Bill Contacts Feedback Quick Contact Numbers Customer Service (386) 986-2360 Animal Control (386) 986-2520 Building Services (386) 986-3780 Code Enforcement (386) 986-3764 Communications & Marketing (386) 986-2564 Finance Department (386) 986-2360 Human Resources (386) 986-3718 Fire Department (386) 986-2300 Purchasing & Contracts (386) 986-3730 Parks & Recreation (386) 986-2323 Flagler County Community Info (386) 313-4111 Flagler County Sheriff (386) 437-4116 Close Give Feedback Loading... Saving Feedback Thank you for taking the time to provide valuable feedback. What do you think of the new website? Do you have any thoughts you'd like to share? May we follow up with you on your feedback? Yes No Email address Cancel Send Close The City Experience Stay current with City of Palm Coast Events Menu Navigation Menu ##### Upcoming Events View the future events that are happening!##### Past Events See all the past events that have happened. Some of them are recoccuring! ##### Calendar View Now! See the upcoming things in our city Click to View the Calendar##### Connect Connect Today Connect Now and see your customized dashboard Connect your property to see more info##### Events Let's Go! Events happening in the community Operated by Parks and Rec.##### Help Center Learn Now Have questions? Browse our existing help articles Frequently Asked Questions##### News What's Happening Learn what's happening in Palm Coast Stay informed about what's happening Discover Trips March, 03 2025 08:30 AM - March, 03 2025 05:00 PM Join us for a recreational road trip and discover Florida while making new friends! Trivia Night March, 06 2025 06:30 PM - March, 06 2025 08:30 PM Have you got all the answers? It's time to prove it! Redefined Food Co. in partnership with the Southern Recreation Center is hosting Trivia Night once a month! Bring your friends and family for a fun challenge paired with tasty treats! PI(E) Day March, 09 2025 11:00 AM - March, 09 2025 03:00 PM Join the City of Palm Coast to commemorate this mathematical holiday! This free event will have a pie eating contest, pie throwing, a live DJ, yard games, and more! Proceeds will benefit the Flagler County Education Foundation. Luck of the Pickle: Pickleball Tournament March, 14 2025 04:00 PM - March, 16 2025 08:00 PM Test your skills against the best in Palm Coast at the Luck of the Pickle Pickleball Tournament! Food Truck Tuesday March, 18 2025 05:00 PM - March, 18 2025 08:00 PM This event makes it much awaited return starting March 18 from 5-8pm. Spring Break Camp March, 17 2025 07:30 AM - March, 21 2025 06:00 PM Enroll your child into a fun-filled week for Spring break! NCCAA Youth Sports Clinic March, 29 2025 09:30 AM - March, 29 2025 11:30 AM Sign your young athlete up for a free Sports Clinic! 2025 MedNexus Innovation Challenge April, 03 2025 05:00 PM - April, 03 2025 07:00 PM The University of North Florida, along with the City of Palm Coast and Flagler County Schools host the 2025 AdventHealth Innovation Challenge, a team-based competition showcasing regional high school students pitching their solutions to Florida’s evolving healthcare needs. Keep Palm Coast Clean: It's a Litter-ALL Effort April, 05 2025 08:00 AM - April, 05 2025 12:00 PM \"Keep Palm Coast Clean: It's a Litter All Effort!\" You can make a difference and be part of the collective effort to keep our city litter-free. Luck of the Draw Pickleball Tournament April, 05 2025 03:00 PM - April, 05 2025 09:00 PM Test your skills against the best in Palm Coast at our pickleball tournament! City of Palm Coast 160 Lake Avenue Palm Coast, FL 32164 386.986.2360 Monday-Friday 8am-5pm Accessibility Contacts Employees Webmail ESS Palm Coast U Emergency Preparedness Emergency Management Flagler County Emergency Management Flood Preparedness ALERT Palm Coast Privacy Policy Report Fraud"
    },
    {
      "url": "https://clubwaka.com/locations/hartford/",
      "content": "Hartford - CLUBWAKA Skip to content Locations Events How It Works Sports Kickball Volleyball Jobs Blog Rules Corporate Wellness Faqs Jobs Press Testimonials Contact Events How It Works Sports Kickball Volleyball Jobs Blog Rules Corporate Wellness Faqs Jobs Press Testimonials Contact Locations Menu Events How It Works Sports Kickball Volleyball Jobs Blog Rules Corporate Wellness Faqs Jobs Press Testimonials Contact Menu Events How It Works Sports Kickball Volleyball Jobs Blog Rules Corporate Wellness Faqs Jobs Press Testimonials Contact Locations Choose your state: Arizona California Connecticut Florida Louisiana Massachusetts Minnesota Nevada New Mexico New York North Carolina Rhode Island Texas Virginia Back to states Location Name Choose your city or check out the whole state. Albany Albuquerque Boston Bristol Dallas Ft. Lauderdale Hampton Roads Hartford Hudson Valley Jacksonville Las Vegas Los Angeles Miami Minneapolis Mount Southington New Haven New Orleans Orange County Orlando Phoenix Providence Raleigh Richmond Sahuarita San Francisco – East Bay San Francisco – South Bay Santa Barbara South Windsor Tucson West Palm Beach Worcester Events How It Works Sports Kickball Volleyball Jobs Blog Rules Corporate Wellness Faqs Jobs Press Testimonials Contact Hartford CLUBWAKA ● Connecticut ● Hartford Play In Hartford Fun co-ed sports, parties, & friends Fun, Friendly Co-ed Leagues 21+ | Social After-Parties & Events | Great Times & New Friends Don't miss out on another season - join the club today before the next price hike! Play In Hartford How It Works it's easy to get started 1 Pick a league & join the club Join as a free agent, a small group, or a whole team. We'll make sure everyone's placed. 2 Share with your friends Tell everyone you know. The more the merrier! 3 Show up ready for fun! Emails and schedules will guide you, just be on time for the game and then join the after party. Register For A league Play In Hartford Check out the leagues in the Hartford area My leagues & Schedule Click here to sign in to your account Sign in Local Rules Learn More Clubwaka events Upcoming Events CLUBWAKA's more than fun sports leagues. We also run parties and all kinds of events from local bar crawls up to tournaments, and even up to destination events/vacations. Check out what's going on here. Sorry, we couldn't find any posts. Please try a different search. ClubWaka Jobs Blog Press Join The club Events How It Works Corporate Wellness Testimonials Get Help Rules FAQs Contact Policies Connect CLUBWAKA +1 (855) 258-2925 info@clubwaka.com PO Box 4668 #46219 New York, NY 10163-4668 © 2025 WAKA Group, LLC / CLUBWAKA. All rights reserved. | Privacy & Terms Scroll To Top",
      "title": "Hartford - CLUBWAKA Skip to content Locations Events How It Works Sports Kickball Volleyball Jobs Blog Rules Corporate Wellness Faqs Jobs Press Testimonials Contact Events How It Works Sports Kickball Volleyball Jobs Blog Rules Corporate Wellness Faqs Jobs Press Testimonials Contact Locations Menu Events How It Works Sports Kickball Volleyball Jobs Blog Rules Corporate Wellness Faqs Jobs Press Testimonials Contact Menu Events How It Works Sports Kickball Volleyball Jobs Blog Rules Corporate Wellness Faqs Jobs Press Testimonials Contact Locations Choose your state: Arizona California Connecticut Florida Louisiana Massachusetts Minnesota Nevada New Mexico New York North Carolina Rhode Island Texas Virginia Back to states Location Name Choose your city or check out the whole state. Albany Albuquerque Boston Bristol Dallas Ft. Lauderdale Hampton Roads Hartford Hudson Valley Jacksonville Las Vegas Los Angeles Miami Minneapolis Mount Southington New Haven New Orleans Orange County Orlando Phoenix Providence Raleigh Richmond Sahuarita San Francisco – East Bay San Francisco – South Bay Santa Barbara South Windsor Tucson West Palm Beach Worcester Events How It Works Sports Kickball Volleyball Jobs Blog Rules Corporate Wellness Faqs Jobs Press Testimonials Contact Hartford CLUBWAKA ● Connecticut ● Hartford Play In Hartford Fun co-ed sports, parties, & friends Fun, Friendly Co-ed Leagues 21+ | Social After-Parties & Events | Great Times & New Friends Don't miss out on another season - join the club today before the next price hike! Play In Hartford How It Works it's easy to get started 1 Pick a league & join the club Join as a free agent, a small group, or a whole team. We'll make sure everyone's placed. 2 Share with your friends Tell everyone you know. The more the merrier! 3 Show up ready for fun! Emails and schedules will guide you, just be on time for the game and then join the after party. Register For A league Play In Hartford Check out the leagues in the Hartford area My leagues & Schedule Click here to sign in to your account Sign in Local Rules Learn More Clubwaka events Upcoming Events CLUBWAKA's more than fun sports leagues. We also run parties and all kinds of events from local bar crawls up to tournaments, and even up to destination events/vacations. Check out what's going on here. Sorry, we couldn't find any posts. Please try a different search. ClubWaka Jobs Blog Press Join The club Events How It Works Corporate Wellness Testimonials Get Help Rules FAQs Contact Policies Connect CLUBWAKA +1 (855) 258-2925 info@clubwaka.com PO Box 4668 #46219 New York, NY 10163-4668 © 2025 WAKA Group, LLC / CLUBWAKA. All rights reserved. | Privacy & Terms Scroll To Top"
    },
    {
      "url": "https://oceancommunityymca.org/wp-content/uploads/2025/02/Spring-2025-Program-Guide-9.pdf",
      "content": "OCY Information PG 2 Membership & Benefits PG 3 Mobile App & Reservations PG 4 Personal Training PG 5 Evidence Based Programs PG 6 Adult Wellness PG 7 Youth Sports & Wellness PG 8 Gymnastics PG 9 Adult Sports & Leagues PG 10 March Madness Tournament PG 11 Swim Programs PG 12-15 Youth & Family Programs PG 16 Camp Registration PG 17 Adult Enrichment PG 18 Birthday Parties PG 19 ARCADIA BRANCH 1190 Main Street Wyoming, RI 02898 P: 401-539-2306 F: 401-539-8667 NAIK FAMILY BRANCH & CAMP COVE 1 Harry Austin Drive Mystic, CT 06355 P: 860-536-3575 F: 860-536-2049 WESTERLY-PAWCATUCK BRANCH 95 High Street Westerly, RI 02891 P: 401-596-2894 F: 401-596-8675 CAMP WATCHAUG 160 Prosser Trail Charlestown, RI 02813 P: 401-364-6535 Information TABLE OF CONTENTS LOCATIONS REGISTRATION DATES Spring I 2025 March 3 - April 20 Member Registration February 17 Participant Registration February 24 Spring II 2025 April 28 - June 15 Member Registration February 17 Participant Registration February 24 2 FINANCIAL ASSISTANCE AVAILABLE! Membership & Benefits Membership Rates Effective March 1, 2025 Monthly Rates $29 per month $30 per month $36 per month $65 per month $90 per month $101 per month $57 per month $93 per month Membership Types Youth (0-12) Teen (13-17) Young Adult (18-22) Adult (23-64) One Adult Family* Two Adult Family* Senior (65+) Senior Couple (Both 65+) MEMBERSHIP INCLUDES: Group exercise classes State-of-the-art Wellness centers Strength training and free weight areas Access to 3 pools for lap swim, family swim, & more Free supervised Childcare and Teen Centers Priority program registration and member rates Nationwide reciprocity As a member of the Ocean Community YMCA, you have access to our 4 branches, each of which offers quality facilities and programs. VOLUNTEER OPPORTUNITIES When you volunteer at the Y, you take an active role in bringing about meaningful, enduring change right in your own neighborhood. To volunteer, inquire at the Welcome Centers of any of our branches. CHILD PROTECTION SCREENING The safety of the children who use our facility has always been our top priority of the OCYMCA. Technology has now evolved that provides on-going screenings for registered sex offenders in all 50 states. YMCA staff uses a system to screen all members & visitors to identify unwanted visitors from entering our YMCA. If a potential threat is identified, the Raptor System will send an instant alert to designated management staff. If necessary, law enforcement will be notified. We appreciate your continued support in protecting all the children who come to our Y. FINANCIAL ASSISTANCE At the Y, our cause is to strengthen our community, and we are committed to transforming lives every day. Our YCares Financial Assistance Program provides support to youth, adults, and families that ensures everyone has the opportunity to learn, grow and thrive. Scan the QR code for more information or to apply! JOINERS FEE This is a one-time fee charged for Young Adult, Adult, One Adult Family and Two Adult Family, Senior and Senior Couple Memberships. Individuals who do not renew within 90 days are classified as new members. Young Adults: $25 Adults, One Adult Families and Seniors: $65 Two Adult Families and Senior Couples: $80 PAYMENT PLANS: MONTHLY DRAFT This is an opportunity to pay membership dues on a monthly basis through a checking/savings account or by credit card. We accept Visa, MC, Amex, and Discover. Depending on your home branch, you will be drafted monthly on the 1st or 15th. 3 *Family Memberships include dependent children who are under the age 23. All individuals reside at the same address with adults sharing expenses. Proof of identification and/or residence required. Download Our Mobile App! Scan the QR code with your smartphone or search for DAXKO in the App Store (iPhones) or Google Play Store (Androids). 1. Download the DAXKO Health and Fitness App and open it 2. It will read: Find your Health and Wellness Center. Type in Ocean Community YMCA and hit return on the keyboard. You’ll see Ocean Community YMCA appear. Hit it and it will open the app. 3. You’ll receive a pop up that asks you to allow notifications. You should allow them because you will get valuable information about emergency closures, class changes, and weather updates. 4. On the Main Screen it will say LETS GO! Click it to enter the brief tutorial. 5. Once in the main app, look at the top of your screen to select your branch. It will default to Arcadia Branch. Tap the name to open the drop down and you can choose your branch of choice. 6. Once in your branch’s page, you can find Announcements on the Home Page, Schedules, Programs, and a place to upload your membership information and enter your scan card. 7. See any Welcome Center Staff for questions. 8. Reservations Reservations are only needed at the Westerly-Pawcatuck Branch and Naik Family Branch! Racquetball- 3 days in Advance Spin Reservations - 24 hours in Advance Pickleball - 24 Hours in Advance Racquetball & Spin: Go to oceancommunityymca.org, and under the PROGRAMS tab please click INDOOR CYCLE. From there, scroll down to view the INDOOR CYCLE schedules to view both Indoor Cycle and Racquetball reservations. On the new page use the drop-down arrows to select the Branch and narrow your selections to find your class. When you’ve made your selection hit Sign Up to book. *First Time Users: Be sure to hit Create a Login, then enter your Name, Email, and then a password. Once you create this login you will have to login the system. After you do this your information will save. NOTE: If you’ve registered online for programs (Daxko) this is a different part of the system (GroupExPro). Pickleball: Go to bit.ly/OCYPickleballDen, and either create account or log in. From there, click on SIGN-UPS. Select a date range and either the Westerly YMCA or Mystic-Naik option. Then hit the SEARCH button. All available open play times will populate. Select which time you would like to play and hit the green SIGN ME UP button in order to reserve your spot. 4 Sessions 60 Minutes 30 Minutes 1 $75 $38 2 $150 $75 3 $225 $113 4 $300 $150 5 $375 $188 6 $450 $225 7 $525 $263 8 $600 $300 Personal Training The YMCA’s Personal Training Program is tailor made for your goals. Developing, documenting, and implementing one-on-one, partner, or group workout programs that match the needs and goals of clients. Educating clients and enforcing safe and proper use of equipment. Instructing clients on basic exercise physiology and inform them of proper lifting and exercise techniques. 8 Benefits of Personal Training Motivation - Personal Trainers keep you motivated and focused on your goals. Accountability - They help you stay accountable and help you discover your strengths. Support - Having an expert in your corner through all of your sessions is key. Intensity - They provide you with the proper intensity for your workouts. Efficiency - Workouts fully tailored to your needs, your time, and your goals. Safety - Personal Trainers are certified with knowledge of body mechanics to maintain safety. Advice - Their skill and expertise will give you the proper guidance. Fitness Knowledge - You’ll discover a wealth of fitness knowledge that will extend far beyond your training sessions. SCAN TO LEARN MORE AND TO SUBMIT AN INTEREST FORM 5 BPSM is designed to help adults with hypertension lower and manage their blood pressure. The 4-month program focuses on regular home self-monitoring, one-on-one consultations with a trained Healthy Heart Ambassador, support and group-based nutrition education for better blood pressure management. First 10 participants registered will receive a free blood pressure monitor. Registration open now. Evidence Based Programs Part of the Y’s commitment to strengthening community through healthy living, LIVESTRONG at the YMCA offers adults affected by cancer a safe, supportive environment to participate in physical and social activities focused on strengthening the whole person. This FREE 12-week small group program is designed for adult cancer survivors and uses traditional exercise methods to ease you back into fitness. Pre-registration is required. Next class will run at the Westerly-Pawcatuck Branch on Tuesday & Thursdays from April 2-June 19. National DPP is a FREE CDC-recognized lifestyle change program, a research-based program focusing on healthy eating and physical activity which showed that people with prediabetes who take part in a structured lifestyle change program can cut their risk of developing type 2 diabetes by 58% (71% for people over 60 years old). Please call for more information. Class will be held at the Westerly-Pawcatuck Branch on Tuesdays from 4pm-5pm starting March 4th. A MATTER OF BALANCE is an award-winning FREE 8-week program open to Y members and the community. Matter of Balance is a cognitive restructuring class designed to view falls as manageable and make changes to reduce fall risks at home. This class is ideal for anyone concerned about falls, anyone who has fallen in the past, and anyone who has restricted activities because of falling concerns. Pre-registration is required. Next class will run April 2-June 11 at the Westerly-Pawcatuck Branch on Wednesdays from 12:30pm-2:30pm. The Naik Family Branch class will be on Thursdays from 11am-1:30pm from April 3-June 12. Powerful Tools for Caregivers gives you the skills to take care of yourself while caring for someone else. By taking care of your own health and well-being, you become a better caregiver. FREE Six class sessions held once a week are led by experienced class leaders. Class participants are given The Caregiver Help book to accompany the class and provide additional caregiver resources. Next class is April 4-May 9 at the Westerly-Pawcatuck Branch. Tai Ji Quan: Moving for Better Balance® is an evidence-based FREE falls prevention program that transforms martial arts movements into a tailored movement therapy aimed at improving postural stability, awareness and mindful control of body positioning in space, functional walking, movement symmetry and coordination, range of motion around the ankle and hip joints, and lower-extremity muscle strength. Classes will be held at the Westerly-Pawcatuck Branch on Mondays & Wednesdays 11:15am-12:15pm starting March 3. Enhanced Tai Ji Quan will be Tuesdays from 11:15am-12:15pm from April 8-June 24. 6 *Interest Roster Available - Contact Janine Parkins, Health & Wellness Director, at jparkins@oceancommunityymca.org for more information. Blood Pressure Self-Monitoring NEW PROGRAM ALERT! TO VIEW CLASS OFFERINGS & TO REGISTER! Adult Wellness Small Group Training Age: 18+ Duration: 45m Work with a personal trainer on the wellness floor to maximize your workout potential. Working out under the direction of a trainer gives you immediate feedback on your form and technique tips as well as helping you reach your fitness goals with the comradery of like-minded workout partners. Offered at the Westerly-Pawcatuck Branch. Members: $96 Participants: $134 Women on Weights Age: 18+yrs Duration: 45m WOW is a small group training class introducing weight training techniques in the wellness center. This class will educate participants in the areas of free weight use, invoke confidence while training; all while having a great workout. Currently offered at the Naik Family Branch & Arcadia Branch. Members: $96 Participants: $134 Sound Bath Age: ALL Duration: 60m Find Your Zen at the Y. De-stress and unwind with the soothing vibrations of singing bowls, gongs, and chimes. Our new sound bath sessions will leave you feeling centered, calm, and ready to take on the day. Benefits include; stress reduction, improved sleep quality, boosted relaxation and focus. Open to all levels! Classes are held once a month at the Westerly-Pawcatuck Branch. Members: $20 Participants: $25 7 Guided Meditation & Reiki Age: 18+ Duration: 45m Come experience a relaxation class designed to help you reconnect with your body and find your calm. We will use guided meditation, visualization and breathing techniques to relax our minds and bodies. Reiki, which is a form of energy healing, will be given to those who would like, accompanied by crystal placement on the body. Workshops are held once a month at the Westerly-Pawcatuck Branch. Members: $20 Participants: $25 Immersion Yoga Workshops Age: 18+ Duration: 2hrs Come explore grounding foundational poses to cultivate a sense of stability and rootedness. Feel the pose, physically, mentally and spiritually through the earth element experiencing the effects as the breath, body & mind come together in union. Workshops are held at all three branches. Members: $20 Participants: $25 Group Exercise Classes All group exercise classes are included with your membership! To view our schedules, please visit the Welcome Desk or scan here. *NEW* Becoming Strong-HER Age: 18+ Duration: 45m Personal Trainer works with each participant to advance her strength goals using techniques and equipment used for Strong-Man/Strong-Woman and bodybuilding competitions. Offered at the Naik Family Branch. Members: $96 Participants: $134 Y Walking Group Age: 18+ Duration: 45min Come join the Westerly-Pawcatuck Walking Club for some light exercise, a way to meet new people, and enjoy some fresh air around Wilcox Park! When done regularly, walking at a brisk pace may lower the risk of high blood pressure, strengthen bones and muscles, burn more calories, & lift your mood. The social connections made in walking clubs can also offer you a sense of wellbeing and positive mental health. Check the group exercise class schedule for details! Members: FREE Participants: Day Pass Adult Progressive Weight Training Age: 18+ Duration: 45m Personal Trainer works with each participant to advance their own strength goals based on each individual's starting point in a controlled program. The group meets 1 x per week to establish their strength workout for the following week. Currently offered at the Naik Family Branch. Members: $96 Participants: $134 SCAN ME PickleFIT Age: 18+ Duration: 45m PickleFIT is a high-energy group training class that works on agility, balance, coordination, and strength. It delivers the ultimate full body, calorie-burning workout using upbeat music under the guidance of a certified personal trainer at the Westerly-Pawcatuck or Naik Family Branches. Members: $96 Participants: $134 Functional Fitness 101 Age: 18+ Duration: 45min This 4 week class is designed to familiarize participants with the equipment, techniques, and principles of the functional fitness studio at the Arcadia Branch. The class provides an overview of what functional training is and how it improves everyday movement patterns, hands-on demonstrations of key equipment, instruction on foundational exercises, and guided workouts. Participants will learn how to adapt workouts to individual fitness levels and goals. Members: $96 Participants: $134 Committed to Wellness Fitness Challenge COMING MARCH 2025! Youth Pickleball Age: 10-13yrs Duration: 45m Youth Pickleball will cover all the basics you need to know to get started, from the rules of play to essential techniques like serving, dinking, and volleying. Offered at both the Naik Family & Westerly-Pawcatuck Branch. Members: $90 Participants: $126 Youth Sports & Wellness Sports Galore Age: 5-10yrs Duration: 45m This program will introduce new sports each week, like soccer, basketball, tee-ball, pickleball, volleyball, ga-ga, and more! We will focus on skills and teambuilding while enjoying heart-healthy fun. Offered at the Westerly-Pawcatuck & Naik Family Branches. Members: $90 Participants: $126 Youth/Teen Strength & Conditioning Age: 10-13yrs Duration: 45m Learn fundamental strength skills. Participants will practice how to perform basic weight training movements allowing them to build proper techniques. Class is run in a circuit format in the Wellness Center at the Westerly-Pawcatuck and Naik Family Branches. Members: $96 Participants: $134 Rookie Sports Age: 3-4yrs Duration: 30m This program is designed for kids who are new to sports and teaches basic skill development in soccer, basketball, and tee-ball. Players are introduced to sports through drills, gym games and team play. Offered at the Westerly-Pawcatuck Branch Members: $75 Participants: $110 8 Basketball Skills & Drills Age: 5-10yrs Duration: 45m This program is focused on teamwork, sportsmanship, and learning the basics of basketball. Players will learn skills including dribbling, shooting, passing, and court positions. Offered at the Naik Family Branch. Members: $90 Participants: $126 *NEW* Infant Massage Age: 0-12mo Duration: 45m Soothing touch and connection to your infant. Come learn different hand positions and massage sequences to sooth your little one at the Westerly-Pawcatuck Branch. Members: $96 Participants: $134 Lifting Club Age: 14-17yrs Duration: 60m Drop by the Westerly-Pawcatuck Wellness Center and learn with our trainers and resident highland games competitor practicing event specific lifts. Members: FREE Participants: Day Pass *NEW* Peak Performance: Off-Season Training & Conditioning Age: 13-17yrs Duration: 60m Designed to help athletes of all ages stay strong, agile, and ready for their sport during the off-season. This class focuses on building foundational fitness through exercises that improve endurance, strength, speed, and flexibility. With a mix of cardio, strength training, agility drills, and mobility work, participants can address any weaknesses and prevent injuries while staying in top physical shape. Currently offered at the Arcadia Branch in the NEW Functional Fitness Room. Members: $115 Participants: $161 TONI’S KIDS Toni’s Kids is an integration initiative designed to provide support for children with diverse emotional, developmental, and intellectual disabilities. This program allows participants to engage with typically developing peers in Y programs and activities at Camp Watchaug as well as our Westerly-Pawcatuck Branch. To see if your child qualifies for Toni’s Kids, please contact Dori McGovern, Senior Program Director, at (401)364-6535 or dmcgovern@oceancommunityymca.org *NEW* Youth Ballet Age: 4-7yrs Duration: 30m A class for the young dancer that infuses ballet basics with a creative dance approach. Dancers are introduced to the barre and center work. Curriculum involves proper body alignment, foot articulation, flexibility, musicality, and primary ballet technique. Now being offered at the Westerly-Pawcatuck Branch. Members: $75 Participants: $110 *NEW* Youth Jazz Age: 4-7yrs Duration: 30m A class for the young dancer to learn the fundamental terminology, coordination, rhythm, and form with a creative dance approach. Curriculum involves proper body alignment, foot articulation, flexibility, musicality, and basic technique. Now being offered at the Westerly-Pawcatuck Branch. Members: $75 Participants: $110 SCAN ME TO VIEW CLASS OFFERINGS & TO REGISTER! Youth Archery Age: 8-12yrs Duration: 45m Join us for an introduction to archery, led by a USA-certified archery instructor! This hands-on class covers fundamental techniques, safety guidelines, and proper equipment use to help you build confidence and precision in the sport. All ability levels are welcome. Class takes place outdoors next to the playground at the Naik Family Branch. Members: $90 Participants: $126 Gymnastics Gymnastics - Parent & Me Age: 18mo-3yrs Duration: 30m This class was developed so even our tiniest gymnasts would have the opportunity to run, jump, swing, and roll with the added support of a trusted adult. The overall goal of this class is for your little one to become familiar in our room so when the day comes for you to wait outside, they feel safe and confident. Members: $80 Participants: $115 9 Gymnastics - Rising Stars Age: 4-5yrs Duration: 45m Gymnastics Rising Stars are 4 & 5yr olds who have advanced from Tiny Tots. They will be introduced to greater focus on body shaping and muscle control. Rising Stars will further their muscle strength and progressing existing skills. Members: $96 Participants: $134 Gymnastics - Baby & Me Age: 6mo-17mo Duration: 30m This class will provide a gymnastics experience for the teeniest of gymnasts. This will include a parent guided play-based session introducing children to fundamental movement skills. This will give the teeny crawlers the opportunity to discover their body awareness in this safe & supportive environment. Members: $80 Participants: $115 Gymnastics - Tiny Tots Age: 3-5yrs Duration: 30m This class is for the child who is ready to participate without the support of an adult. The class introduces the primary skills of gymnastics including tumbling, jumping and other motor skills. Members: $80 Participants: $115 Gymnastics - Parent & Tot Age: 3-5yrs Duration: 30m The class introduces the primary skills of gymnastics including tumbling, jumping and other motor skill with the added support of an adult. Members: $80 Participants: $115 Gymnastics - Basic Age: 6-16yrs Duration: 45m Join this beginner gymnastics class to learn a variety of basic moves. Students should know how to do a forward roll and bunny hop prior to class. Students should also be able to follow directions. Members: $96 Participants: $134 Gymnastics - Boys Intermediate Age: 6-16yrs Duration: 45m This class builds upon the skills learned in the Boys Basic class, introducing more advanced techniques across all six men’s gymnastics events: Rings, Parallel Bars, Mushroom, High Bar, Floor, and Vault. Participants will also begin learning the foundational requirements for the boys’ competitive team, preparing them for the next level of gymnastics. Members: $96 Participants: $134 Gymnastics - Advanced Age: 6-16yrs Duration: 60m Advancing from intermediate gymnastics, gymnasts will continue to enhance skills. Coaches recommendation required. Members: $115 Participants: $161 Gymnastics - Pre-Team Age: 6-16yrs Duration: 60m Pre-Team is for the gymnast that shows a serious interest in the sport of gymnastics but is not ready to be on the competition team. Gymnasts will be evaluated by the coaching staff and will be asked to participate in a practice before joining. Must be members of the Y. Members: $115 Gymnastics - Boys & Girls Competition Team Age: 6-16yrs Duration: 3-6hrs/week The OCY Gymnastics Team is for gymnasts who are ready to take gymnastics to the next level. Gymnasts will compete at local and regional meets. Gymnasts must be evaluated by the coaching staff and tryout before joining. YMCA League & USAG options available. Must be members of the Y to join. Practice times and pricing determined by level. Members: Prices Vary Team Open Gym Age: 6-16yrs Duration: 1.5hrs This class is for those team members who would like to have more time to work on their routines before the competition season starts. Coaches will be available to ensure the safety of the gymnasts and give them some drills to do those skills that they are working so hard to master. Members: $10/class SCAN ME TO VIEW CLASS OFFERINGS & TO REGISTER! Gymnastics - Boys Basic Age: 6-16yrs Duration: 45m Designed specifically for boys, this class introduces foundational gymnastics skills across all six men’s events: Rings, Parallel Bars, Mushroom, High Bar, Floor, and Vault. Open to boys as young as four years old, this structured program focuses on building strength, coordination, and confidence in a fun and supportive environment. Members: $96 Participants: $134 Gymnastics - Intermediate Age: 6-16yrs Duration: 45m Advancing from basic gymnastics, we introduce more lessons on flexibility, strength, and balance. This program also incorporates and strengthens team spirit and growth of skills. Gymnasts should be recommended by the Gymnastics coaches for this class. Members: $96 Participants: $134 Pickleball 101 Age: 18+ Duration: 75m Our Pickleball 101 clinics cover all the basics you need to know to get started, from the rules of play to essential techniques like serving, dinking, and volleying. Come hone your beginner skills, at our Pickleball Clinics at the Westerly-Pawcatuck or Naik Family Branches! Members: $15 Participants: $30 Scan here to view schedules and tournament information, register for skills & drills, receive association updates, and MORE! Adult Sports & Leagues Pickleball 102 Age: 18+ Duration: 75m Pickleball 102 is our next step after 101 Pickleball. Under the guidance of an instructor, participants will begin to work on skills and in-game strategies. Come hone your beginner skills at the Westerly-Pawcatuck or Naik Family Branches! Members: $15 Participants: $30 Racquetball League Age: 18+ Similar to tennis, handball, and squash, the goal of Racquetball is to hit the ball before it takes a second bounce. Learn more about this fast-paced game and join the league! Matches are held on Mondays, Tuesdays, and Wednesdays for A league and B league, respectively. Level is based on past performance. For questions on placement and league please contact Dori McGovern at dmcgovern@oceancommunityymca.org. Members: FREE Participants: $50 10 *Must be an OCY Member to join PickleballDen* Men’s Pickleball League Age: 18+ Join the Men's Intermediate/Advanced Pickleball League to compete in fast-paced matches with skilled players. This league is perfect for those with solid pickleball experience looking to sharpen their skills and enjoy friendly competition. The league will run from March 3-April 14 at the Westerly-Pawcatuck Branch. Must be a member in PickleballDen to register. Members: $85 *NEW* Adaptive Pickleball Clinics Age: 12+ Duration: 45m The Adaptive Pickleball Clinic is designed for individuals with intellectual disabilities or who are neurodivergent, providing a supportive and inclusive environment to learn and enjoy the game. Participants will develop skills, build confidence, and have fun in a welcoming community at the Naik Family Branch. Members: FREE Participants: FREE Pickleball Skills & Drills Age: 18+ Duration: 2hrs Our Skills & Drills clinics are focused on specific skills, such as serving, volleying, or dinking, to help intermediate players refine their techniques. Register in Pickleball Den. Offered at the Westerly-Pawcatuck & Naik Family Branches. Members: $15 Participants: $30 Women’s Pickleball League Age: 18+ Join the Women's Intermediate/Advanced Pickleball League to compete in fast-paced matches with skilled players. This league is perfect for those with solid pickleball experience looking to sharpen their skills and enjoy friendly competition. The league will run from March 7-April 18 at the Naik Family Branch. Must be a member in PickleballDen to register. Members: $85 SCAN ME TO VIEW CLASS OFFERINGS & TO REGISTER! March Madness Pickleball Tournament Age: 18+ The YMCA's March Madness Pickleball Tournament will be held on Sunday, March 2, from 8 AM to 5 PM at the Westerly-Pawcatuck Branch's indoor courts. Open to the community, participants can register on Pickleball Den by February 23. Play format is up the river, down the river. Members: $30 Pickleball Point Play Age: 18+ Duration: 3hrs Pickleball Point Play is a fast moving, coach led clinic that gets your heart rate up and moving around the court. The overall purpose is to score points and be King/Queen of the court after 15 minutes. The games are fast paced with players rotating throughout the game on missed points. come check it out and you will quickly become an enthusiast! Signups will be done through PickleballDen and will be by levels (Beginner/Low Intermediate & High Intermediate/Advanced). Will be played at the Naik Family Branch. Members: $15 DOLPHINS SWIM TEAM HAMMERHEADS SWIM TEAM Swim Team Programs The Westerly-Pawcatuck Dolphins Swim Team is a USA Certified team whose coaches promote team spirit, competition, sportsmanship, tradition, YMCA Values, and fun. Swimmers will develop individual skills and stroke technique, improve times, and make new friends. Visit www.ymcadolphins.org for more registration info! A YMCA Membership is required to join the team. If you choose to join USA Swimming, there is an additional annual registration fee. The Mystic Hammerheads swim team promotes Y values, team spirit, competition and fun. Swimmers will develop new skills and stroke technique, improve times and make new friends. We also focus on team building and good competitive practices to help our swimmers take their swimming knowledge to the collegiate level. The season kicks off in September and wraps up with championship meets in March. Throughout these months, swimmers will get the chance to compete against other Y swim teams within the SENECY league. A YMCA membership is required to join the team. 12 FINANCIAL ASSISTANCE AVAILABLE! For information about Swim Team, please contact: Dolphins Swim Coach dolphinscoach@oceancommunityymca.org (401) 596-2894 For information about Swim Team, please contact: Jayde Forbes, Aquatics Director jforbes@oceancommunityymca.org (860) 536-3575 Swim Lesson Level Guide The YMCA Swim Lessons program uses a skill-based approach designed to meet the needs of local Y’s and the community they serve. The new swim lessons curriculum allows for both standardization and flexibility. The organization of the curriculum ensures that swim lesson programs look and sound the same in every Y across the country. Swim evaluations available! 13 Water Discovery & Exploration Age: 6-36mo Duration: 30m Stage: A + B No prior swimming experience is needed. Swimmers will be exploring the aquatic environment by learning to blow bubbles, gliding in the water while moving arms and legs, floating on their back, rolling front to back; working on the motor skills of grabbing onto the wall of the pool and learning to climb out and crawling on the wall in the water. Adults are required to be in the water with their swimmer and will also be learning fundamental safety and aquatic skills. Members: $80 Participants: $115 Water Stamina Age: 3-5yrs Duration: 30m Stage: 3 Swimmers must meet benchmark skills from Stage 2: Water Movement to be in this class. We will work on submerging and retrieving an object in chest-deep water, swimming on freestyle and backstroke for 10 yards unassisted, rolling front to back unassisted and treading water for 30 seconds. The benchmark skills that need to be met to move on to Stage 4: Stroke Introduction are submerging while jumping into the water, swimming, turning to swim back to the wall and grabbing the wall for 10 yards. Swimmers also must swim, float and swim for 15 yards independently. Members: $80 Participants: $115 Water Acclimation Age: 3-5yrs Duration: 30m Stage: 1 No prior swimming experience is needed. Swimmers will work on comfort with face in the water, gliding in the water, kicking, and moving their arms, floating on their back, rolling front to back and climbing out of the pool independently. The benchmark skills that need to be met to move on to Stage 2: Water Movement are submerging while jumping into the water, pushing off the bottom of the pool, turning and grabbing the wall assisted with the instructor. Swimmers also must be able to swim, float, swim for 10 feet assisted with the instructor. Members: $80 Participants: $115 Preschool Starter Class Age: 2-3yrs Duration: 30m Stage: A + B This class is for prepping your toddler for when they are 1:1 with an instructor after they age out of Water Discovery and Exploration. Adults will still be in the water, but the instructor will be swimming with each swimmer periodically 1:1. Members: $80 Participants: $115 Water Movement Age: 3-5yrs Duration: 30m Stage: 2 Swimmers must meet benchmark skills from Stage 1: Water Acclimation to be in this class. We will work on submerging our faces in the water by looking at objects under water, front and back glides, floating on their back, rolling front to back, kicking and moving their arms and treading water for 10 seconds. The benchmark skills that need to be met to move on to Stage 3: Water Stamina are submerging while jumping into the water, pushing off the bottom of the pool, turning and grabbing the wall unassisted and performing a swim, float, swim independently for 5 yards. Members: $80 Participants: $115 14 SCAN ME TO VIEW CLASS OFFERINGS & TO REGISTER! Private Swim Lessons The Ocean Community YMCA is pleased to offer Private Swim Lessons. We ask that you complete the form on our website or see our Welcome Center to put in your request. Your request will be scheduled in the order received. Please scan the QR code to fill out our online request form: Aquatics Water Stamina Age: 6-12yrs Duration: 45m Stage: 3 Swimmers must meet benchmark skills from Stage 2: Water Movement to be in this class. We will work on submerging and retrieving an object in chest-deep water, swimming on freestyle and backstroke for 15 yards unassisted, rolling front to back unassisted and treading water for 1 minute. The benchmark skills that need to be met to move on to Stage 4: Stroke Introduction are submerging while jumping into the water, swimming, turning to swim back to the wall and grabbing the wall for 10 yards. Swimmers also must be able to swim freestyle and/or backstroke for 25 yards. Members: $96 Participants: $134 Aquatics Water Movement Age: 6-12yrs Duration: 45m Stage: 2 Swimmers must meet benchmark skills from Stage 1: Water Acclimation to be in this class. We will work on submerging our faces in the water by looking at objects under water, front and back glides, floating on their back, rolling front to back, kicking and moving their arms and treading water for 10 seconds. The benchmark skills that need to be met to move on to Stage 3: Water Stamina are submerging while jumping into the water, pushing off the bottom of the pool, turning and grabbing the wall unassisted and performing a swim, float, swim independently for 5 yards. Members: $96 Participants: $134 Stroke Development & Stroke Mechanics Age: 6-12yrs Duration: 45m Stage: 5&6 Stage 5: Swimmers must meet benchmark skills from Stage 4: Stroke Introduction to be in this class. This stage works on building endurance and refining freestyle, backstroke, breaststroke and butterfly. We will be swimming 50 yards with kickboards, 50 yards with drills and swimming 50 yards of each stroke in its entirety. Kneeling and standing dives will be taught along with working on treading water for 2 minutes. Open turns and flip-turns will also be a focus throughout the class. The benchmark skills that need to be met to move on to Stage 6: Stroke Mechanics are swimming all four strokes and having the endurance to swim 75-100 yards continuously. Stage 6: Swimmers must meet benchmark skills from Stage 5: Stroke Development to be in this class. This stage works on building endurance and refining freestyle, backstroke, breaststroke and butterfly. We will be swimming 75-100 yards with kickboards, 75-100 yards with drills and swimming 75-100 yards of each stroke in its entirety. Kneeling and standing dives will be worked on along with retrieving an object from the bottom of the pool and treading water for 1 minute after. Open turns and flip-turns will also be a focus throughout the class. Members: $96 Participants: $134 Stroke Introduction Age: 6-12yrs Duration: 45m Stage: 4 Swimmers must meet benchmark skills from Stage 3: Water Stamina to be in this class. This stage works on building endurance and refining freestyle and backstroke and will introduce breaststroke and butterfly. We will be swimming 25 yards with kickboards, 25 yards with drills and swimming 25 yards of each stroke in its entirety. Sitting, kneeling and standing dives will be taught along with working on treading water for 1 minute. Open turns and flip-turns will be introduced. The benchmark skills that need to be met to move on to Stage 5: Stroke Development are swimming all four strokes and having the endurance to swim 50 yards continuously. Members: $96 Participants: $134 15 Westerly-Pawcatuck Branch Scan here to view Group Water Exercise Classes Scan here to view Group Water Exercise Classes Classes include Aqua Cardio, Aqua Flow & Glow, Silver Sneakers Splash, and more! Classes include Deep Water Workout, Aquacize, Senior Water Workout, S’WET and more! Naik Family Branch Water Acclimation Age: 6-12yrs Duration: 45m Stage: 1 No prior swimming experience is needed. Swimmers will work on comfort with face in the water, gliding in the water, kicking and moving their arms, floating on their back, rolling front to back and climbing out of the pool independently. The benchmark skills that need to be met to move on to Stage 2: Water Movement are submerging while jumping into the water, pushing off the bottom of the pool, turning and grabbing the wall assisted with the instructor. Swimmers also must be able to swim, float, swim for 10 feet assisted with the instructor. Members: $96 Participants: $134 SCAN ME TO VIEW CLASS OFFERINGS & TO REGISTER! Water Group Exercise Classes *NEW* Pop-Up Art Workshops with MMoA: Sponsored by Grace McDonnell Art Fund Age: 7-12yrs Duration: 2hrs Join us at the Naik Family Branch as we welcome artists from the Mystic Museum of Art for a pop-up art workshop. Each session will focus on a specific style, theme, or technique, and each participant will go home with their artwork inspired by the lesson. Dates to come! Members: FREE Participants: FREE Youth & Family Programs Parent’s Night Out Age: 5-12yrs Duration: 3hrs Bring your children to the Westerly-Pawcatuck Branch or Naik Family Branch for an evening of fun games and activities and enjoy an evening out! Dinner is provided. Registration is required. Space is limited. Members: $25; Participants: $40; Teen Night Age: 12-14 Duration: 3hrs Join your friends and make new ones at the Westerly-Pawcatuck Branch or Naik Family Branch! Participate in some exciting activities with our FUN YMCA staff! Dinner will be provided. Members: $25; Participants: $40; $5 per additional child $10 per additional child 16 $5 per additional child $10 per additional child Vacation Days Age: 5-15yrs Duration: Varies Spend your Spring vacation at the YMCA! Students K-6 will enjoy a variety of activities that will include arts & crafts, STEM projects, swimming, outdoor activities (weather permitting), and more! Vacation days will be offered from April 14-18 at the Naik Family Branch. Members: $55/day Participants: $75/day Story Time Age: 2-5yrs Duration: 30m Listen to captivating tales featuring beloved characters, adventures, and life lessons. After the story, children will create a themed craft project inspired by the day's tale. From colorful art pieces to simple DIY creations, each craft encourages creativity and fine motor skills. Offered at the Westerly-Pawcatuck Branch & Naik Family Branch. Members: FREE ARC Babysitting Course Age: 11-15yrs Duration: 6hrs Come and take part in our two class workshop at the Westerly-Pawcatuck Branch to develop the skills needed to be safe, responsible and successful babysitters. At the completion of class, students will receive American Red Cross Certified Babysitter Certificates which will include Pediatric First Aid and CPR. Other topics include: leadership styles, starting a business, decision making, childcare, and handling an emergency situation. Must be able to attend both days. Members: $125 Participants: $160 LEGO Club Age: 5-14yrs Duration: 45m Lego Club is a STEM focused enjoyable peer activity that stimulates and develops spatial intelligence. It teaches participants teamwork, problem solving, and enhances creativity. Let’s let our imaginations run wild and build together at the Naik Family Branch! Members: $90 Participants: $126 OCYMCA Leader’s Club Age: Grades 6-12 Duration: 60m Leaders Club is designed to offer young adults the opportunity to develop leadership skills as they provide volunteer service within the YMCA and the local community. This program is extremely hands-on and is managed by an elected executive board. For OCYMCA members only. Meetings will be held on a weekly basis. Meetings are held at the Naik Family Branch. Members: FREE Crafting Club Age: 5-10yrs Duration: 45m Creative and craft kids come together to create different arts and crafts projects. Y staff at the Naik Family Branch will plan a project for each week and allow participants to add their own creative twists! Members: $90 Participants: $126 Spring Break Camp at Camp Watchaug Age: 5-14yrs Duration: Varies Spend your Spring Break at Camp Watchaug! Participate in activities such as the climbing wall, low ropes course, archery, gaga ball, field games, arts & crafts, nature, fire pit stories and more! Pool time and gym games provided during afternoon extended care. Bus transportation will be provided from the Westerly-Pawcatuck Branch YMCA. Members: Varies Participants: Varies Annual Easter Egg Hunt at Camp Watchaug Age: ALL Duration: 45m Register today for the Annual Easter Egg Hunt at Camp Watchaug for a day of family fun and adventure! Search for hidden eggs, enjoy the beautiful outdoors, and create unforgettable memories together. Members: FREE Participants: FREE Easter Egg Splash Age: ALL Duration: 45m Join us at this FREE & FUN event at the Naik Family Branch & Westerly-Pawcatuck Branch to collect Easter eggs in the pool in exchange for candy from the Easter bunny! Don’t forget to take a photo after with the Easter bunny too! Dates to come! Members: FREE Participants: FREE SCAN ME TO VIEW CLASS OFFERINGS & TO REGISTER! Adult Enrichment Adult Tap Dance Age: 18+ Duration: 60m In these classes you will learn or continue to development tap techniques with a focus on speed, transitions, and style. Offered at the Westerly-Pawcatuck & Naik Family Branches. Members: $108 Participants: $151 Garden Club Age: 18+ Duration: 2hrs Garden Club promotes the encouragement and advancement of gardening. Club meetings are held on the 3rd Wednesday of the month with a specific presentation. Events and activities are scheduled throughout the year. All funds raised are put towards camperships. Members: FREE Participants: $32 Annually 18 ARC First Aid/CPR/AED Age: 14+ Duration: 2hrs This course is designed to teach you to recognize signs and symptoms of heart attacks and other emergencies and respond to them appropriately. Includes certification for adults, children and infants. BLENDED COURSE: Certification is good for two years. Online component followed by in person skills section. Offered at the Westerly-Pawcatuck, Naik Family and Arcadia Branches. Members: $125 Participants: $160 ARC Lifeguarding Course Age: 15+yrs Duration: Varies Lifeguard Requirements: Must be 15 years old before the course begins; Must be able to swim 300 yard without stopping; Must be physically able to make rescues in water. Participants will become certified as Red Cross Lifeguards as well as First Aid/CPR/AED for the Professional Rescuer. Certification is FREE with your commitment to work at the YMCA. Offered at the Westerly-Pawcatuck Branch. Members: $399 Participants: $458 Adult Tap & Jazz Dance Age: 18+ Duration: 60m Learn basic jazz steps, techniques, terminology while improving strength, flexibility, and coordination. Jazz dance encourages personal style, body awareness and not to mention super fun! The other half of the class will include beginner tap. Offered at the Westerly-Pawcatuck Branch. Members: $108 Participants: $151 Adult Art Age: 18+ Duration: 60m Join us for an art class open to adults of all ages! Reduce boredom and anxiety and increase your creativity and self-esteem. Each week you will work on a new project. Offered at the Naik Family Branch. Members: $108 Participants: $151 SCAN ME TO VIEW CLASS OFFERINGS & TO REGISTER! Beach Concert Series Naik Family Branch Get ready for the Summer Beach Concert Series, featuring live music from June through September in a family-friendly atmosphere. Bring your loved ones, relax by the shore, and soak up the sounds of summer. More details to come! COMING SOON! Viva la Salsa! Age: 18+ Duration: 2hr Ready to spice up yJoin us for a fun and engaging beginner-friendly salsa class at the YMCA! This one-time workshop is perfect for anyone looking to learn the basics of salsa dancing in a relaxed and supportive environment. Led by an experienced instructor, you’ll discover foundational steps, simple turns, and the rhythm that makes salsa so irresistible. No dance experience or partner is required—just bring your energy and enthusiasm! Class will be offered in May at the Westerly-Pawcatuck Branch Members: $20 Participants: $25 19 ARCADIA BRANCH 1190 MAIN STREET WYOMING, RI 02898 (401) 539-2306 WESTERLY-PAWCATUCK BRANCH 95 HIGH STREET WESTERLY, RI 02891 (401) 596-2894 NAIK FAMILY BRANCH 1 HARRY AUSTIN DRIVE MYSTIC, CT 06355 (860) 536-3575 OCEANCOMMUNITYYMCA.ORG VISIT OUR BRANCHES: VISIT OUR BRANCHES:",
      "title": "OCY Information PG 2 Membership & Benefits PG 3 Mobile App & Reservations PG 4 Personal Training PG 5 Evidence Based Programs PG 6 Adult Wellness PG 7 Youth Sports & Wellness PG 8 Gymnastics PG 9 Adult Sports & Leagues PG 10 March Madness Tournament PG 11 Swim Programs PG 12-15 Youth & Family Programs PG 16 Camp Registration PG 17 Adult Enrichment PG 18 Birthday Parties PG 19 ARCADIA BRANCH 1190 Main Street Wyoming, RI 02898 P: 401-539-2306 F: 401-539-8667 NAIK FAMILY BRANCH & CAMP COVE 1 Harry Austin Drive Mystic, CT 06355 P: 860-536-3575 F: 860-536-2049 WESTERLY-PAWCATUCK BRANCH 95 High Street Westerly, RI 02891 P: 401-596-2894 F: 401-596-8675 CAMP WATCHAUG 160 Prosser Trail Charlestown, RI 02813 P: 401-364-6535 Information TABLE OF CONTENTS LOCATIONS REGISTRATION DATES Spring I 2025 March 3 - April 20 Member Registration February 17 Participant Registration February 24 Spring II 2025 April 28 - June 15 Member Registration February 17 Participant Registration February 24 2 FINANCIAL ASSISTANCE AVAILABLE! Membership & Benefits Membership Rates Effective March 1, 2025 Monthly Rates $29 per month $30 per month $36 per month $65 per month $90 per month $101 per month $57 per month $93 per month Membership Types Youth (0-12) Teen (13-17) Young Adult (18-22) Adult (23-64) One Adult Family* Two Adult Family* Senior (65+) Senior Couple (Both 65+) MEMBERSHIP INCLUDES: Group exercise classes State-of-the-art Wellness centers Strength training and free weight areas Access to 3 pools for lap swim, family swim, & more Free supervised Childcare and Teen Centers Priority program registration and member rates Nationwide reciprocity As a member of the Ocean Community YMCA, you have access to our 4 branches, each of which offers quality facilities and programs. VOLUNTEER OPPORTUNITIES When you volunteer at the Y, you take an active role in bringing about meaningful, enduring change right in your own neighborhood. To volunteer, inquire at the Welcome Centers of any of our branches. CHILD PROTECTION SCREENING The safety of the children who use our facility has always been our top priority of the OCYMCA. Technology has now evolved that provides on-going screenings for registered sex offenders in all 50 states. YMCA staff uses a system to screen all members & visitors to identify unwanted visitors from entering our YMCA. If a potential threat is identified, the Raptor System will send an instant alert to designated management staff. If necessary, law enforcement will be notified. We appreciate your continued support in protecting all the children who come to our Y. FINANCIAL ASSISTANCE At the Y, our cause is to strengthen our community, and we are committed to transforming lives every day. Our YCares Financial Assistance Program provides support to youth, adults, and families that ensures everyone has the opportunity to learn, grow and thrive. Scan the QR code for more information or to apply! JOINERS FEE This is a one-time fee charged for Young Adult, Adult, One Adult Family and Two Adult Family, Senior and Senior Couple Memberships. Individuals who do not renew within 90 days are classified as new members. Young Adults: $25 Adults, One Adult Families and Seniors: $65 Two Adult Families and Senior Couples: $80 PAYMENT PLANS: MONTHLY DRAFT This is an opportunity to pay membership dues on a monthly basis through a checking/savings account or by credit card. We accept Visa, MC, Amex, and Discover. Depending on your home branch, you will be drafted monthly on the 1st or 15th. 3 *Family Memberships include dependent children who are under the age 23. All individuals reside at the same address with adults sharing expenses. Proof of identification and/or residence required. Download Our Mobile App! Scan the QR code with your smartphone or search for DAXKO in the App Store (iPhones) or Google Play Store (Androids). 1. Download the DAXKO Health and Fitness App and open it 2. It will read: Find your Health and Wellness Center. Type in Ocean Community YMCA and hit return on the keyboard. You’ll see Ocean Community YMCA appear. Hit it and it will open the app. 3. You’ll receive a pop up that asks you to allow notifications. You should allow them because you will get valuable information about emergency closures, class changes, and weather updates. 4. On the Main Screen it will say LETS GO! Click it to enter the brief tutorial. 5. Once in the main app, look at the top of your screen to select your branch. It will default to Arcadia Branch. Tap the name to open the drop down and you can choose your branch of choice. 6. Once in your branch’s page, you can find Announcements on the Home Page, Schedules, Programs, and a place to upload your membership information and enter your scan card. 7. See any Welcome Center Staff for questions. 8. Reservations Reservations are only needed at the Westerly-Pawcatuck Branch and Naik Family Branch! Racquetball- 3 days in Advance Spin Reservations - 24 hours in Advance Pickleball - 24 Hours in Advance Racquetball & Spin: Go to oceancommunityymca.org, and under the PROGRAMS tab please click INDOOR CYCLE. From there, scroll down to view the INDOOR CYCLE schedules to view both Indoor Cycle and Racquetball reservations. On the new page use the drop-down arrows to select the Branch and narrow your selections to find your class. When you’ve made your selection hit Sign Up to book. *First Time Users: Be sure to hit Create a Login, then enter your Name, Email, and then a password. Once you create this login you will have to login the system. After you do this your information will save. NOTE: If you’ve registered online for programs (Daxko) this is a different part of the system (GroupExPro). Pickleball: Go to bit.ly/OCYPickleballDen, and either create account or log in. From there, click on SIGN-UPS. Select a date range and either the Westerly YMCA or Mystic-Naik option. Then hit the SEARCH button. All available open play times will populate. Select which time you would like to play and hit the green SIGN ME UP button in order to reserve your spot. 4 Sessions 60 Minutes 30 Minutes 1 $75 $38 2 $150 $75 3 $225 $113 4 $300 $150 5 $375 $188 6 $450 $225 7 $525 $263 8 $600 $300 Personal Training The YMCA’s Personal Training Program is tailor made for your goals. Developing, documenting, and implementing one-on-one, partner, or group workout programs that match the needs and goals of clients. Educating clients and enforcing safe and proper use of equipment. Instructing clients on basic exercise physiology and inform them of proper lifting and exercise techniques. 8 Benefits of Personal Training Motivation - Personal Trainers keep you motivated and focused on your goals. Accountability - They help you stay accountable and help you discover your strengths. Support - Having an expert in your corner through all of your sessions is key. Intensity - They provide you with the proper intensity for your workouts. Efficiency - Workouts fully tailored to your needs, your time, and your goals. Safety - Personal Trainers are certified with knowledge of body mechanics to maintain safety. Advice - Their skill and expertise will give you the proper guidance. Fitness Knowledge - You’ll discover a wealth of fitness knowledge that will extend far beyond your training sessions. SCAN TO LEARN MORE AND TO SUBMIT AN INTEREST FORM 5 BPSM is designed to help adults with hypertension lower and manage their blood pressure. The 4-month program focuses on regular home self-monitoring, one-on-one consultations with a trained Healthy Heart Ambassador, support and group-based nutrition education for better blood pressure management. First 10 participants registered will receive a free blood pressure monitor. Registration open now. Evidence Based Programs Part of the Y’s commitment to strengthening community through healthy living, LIVESTRONG at the YMCA offers adults affected by cancer a safe, supportive environment to participate in physical and social activities focused on strengthening the whole person. This FREE 12-week small group program is designed for adult cancer survivors and uses traditional exercise methods to ease you back into fitness. Pre-registration is required. Next class will run at the Westerly-Pawcatuck Branch on Tuesday & Thursdays from April 2-June 19. National DPP is a FREE CDC-recognized lifestyle change program, a research-based program focusing on healthy eating and physical activity which showed that people with prediabetes who take part in a structured lifestyle change program can cut their risk of developing type 2 diabetes by 58% (71% for people over 60 years old). Please call for more information. Class will be held at the Westerly-Pawcatuck Branch on Tuesdays from 4pm-5pm starting March 4th. A MATTER OF BALANCE is an award-winning FREE 8-week program open to Y members and the community. Matter of Balance is a cognitive restructuring class designed to view falls as manageable and make changes to reduce fall risks at home. This class is ideal for anyone concerned about falls, anyone who has fallen in the past, and anyone who has restricted activities because of falling concerns. Pre-registration is required. Next class will run April 2-June 11 at the Westerly-Pawcatuck Branch on Wednesdays from 12:30pm-2:30pm. The Naik Family Branch class will be on Thursdays from 11am-1:30pm from April 3-June 12. Powerful Tools for Caregivers gives you the skills to take care of yourself while caring for someone else. By taking care of your own health and well-being, you become a better caregiver. FREE Six class sessions held once a week are led by experienced class leaders. Class participants are given The Caregiver Help book to accompany the class and provide additional caregiver resources. Next class is April 4-May 9 at the Westerly-Pawcatuck Branch. Tai Ji Quan: Moving for Better Balance® is an evidence-based FREE falls prevention program that transforms martial arts movements into a tailored movement therapy aimed at improving postural stability, awareness and mindful control of body positioning in space, functional walking, movement symmetry and coordination, range of motion around the ankle and hip joints, and lower-extremity muscle strength. Classes will be held at the Westerly-Pawcatuck Branch on Mondays & Wednesdays 11:15am-12:15pm starting March 3. Enhanced Tai Ji Quan will be Tuesdays from 11:15am-12:15pm from April 8-June 24. 6 *Interest Roster Available - Contact Janine Parkins, Health & Wellness Director, at jparkins@oceancommunityymca.org for more information. Blood Pressure Self-Monitoring NEW PROGRAM ALERT! TO VIEW CLASS OFFERINGS & TO REGISTER! Adult Wellness Small Group Training Age: 18+ Duration: 45m Work with a personal trainer on the wellness floor to maximize your workout potential. Working out under the direction of a trainer gives you immediate feedback on your form and technique tips as well as helping you reach your fitness goals with the comradery of like-minded workout partners. Offered at the Westerly-Pawcatuck Branch. Members: $96 Participants: $134 Women on Weights Age: 18+yrs Duration: 45m WOW is a small group training class introducing weight training techniques in the wellness center. This class will educate participants in the areas of free weight use, invoke confidence while training; all while having a great workout. Currently offered at the Naik Family Branch & Arcadia Branch. Members: $96 Participants: $134 Sound Bath Age: ALL Duration: 60m Find Your Zen at the Y. De-stress and unwind with the soothing vibrations of singing bowls, gongs, and chimes. Our new sound bath sessions will leave you feeling centered, calm, and ready to take on the day. Benefits include; stress reduction, improved sleep quality, boosted relaxation and focus. Open to all levels! Classes are held once a month at the Westerly-Pawcatuck Branch. Members: $20 Participants: $25 7 Guided Meditation & Reiki Age: 18+ Duration: 45m Come experience a relaxation class designed to help you reconnect with your body and find your calm. We will use guided meditation, visualization and breathing techniques to relax our minds and bodies. Reiki, which is a form of energy healing, will be given to those who would like, accompanied by crystal placement on the body. Workshops are held once a month at the Westerly-Pawcatuck Branch. Members: $20 Participants: $25 Immersion Yoga Workshops Age: 18+ Duration: 2hrs Come explore grounding foundational poses to cultivate a sense of stability and rootedness. Feel the pose, physically, mentally and spiritually through the earth element experiencing the effects as the breath, body & mind come together in union. Workshops are held at all three branches. Members: $20 Participants: $25 Group Exercise Classes All group exercise classes are included with your membership! To view our schedules, please visit the Welcome Desk or scan here. *NEW* Becoming Strong-HER Age: 18+ Duration: 45m Personal Trainer works with each participant to advance her strength goals using techniques and equipment used for Strong-Man/Strong-Woman and bodybuilding competitions. Offered at the Naik Family Branch. Members: $96 Participants: $134 Y Walking Group Age: 18+ Duration: 45min Come join the Westerly-Pawcatuck Walking Club for some light exercise, a way to meet new people, and enjoy some fresh air around Wilcox Park! When done regularly, walking at a brisk pace may lower the risk of high blood pressure, strengthen bones and muscles, burn more calories, & lift your mood. The social connections made in walking clubs can also offer you a sense of wellbeing and positive mental health. Check the group exercise class schedule for details! Members: FREE Participants: Day Pass Adult Progressive Weight Training Age: 18+ Duration: 45m Personal Trainer works with each participant to advance their own strength goals based on each individual's starting point in a controlled program. The group meets 1 x per week to establish their strength workout for the following week. Currently offered at the Naik Family Branch. Members: $96 Participants: $134 SCAN ME PickleFIT Age: 18+ Duration: 45m PickleFIT is a high-energy group training class that works on agility, balance, coordination, and strength. It delivers the ultimate full body, calorie-burning workout using upbeat music under the guidance of a certified personal trainer at the Westerly-Pawcatuck or Naik Family Branches. Members: $96 Participants: $134 Functional Fitness 101 Age: 18+ Duration: 45min This 4 week class is designed to familiarize participants with the equipment, techniques, and principles of the functional fitness studio at the Arcadia Branch. The class provides an overview of what functional training is and how it improves everyday movement patterns, hands-on demonstrations of key equipment, instruction on foundational exercises, and guided workouts. Participants will learn how to adapt workouts to individual fitness levels and goals. Members: $96 Participants: $134 Committed to Wellness Fitness Challenge COMING MARCH 2025! Youth Pickleball Age: 10-13yrs Duration: 45m Youth Pickleball will cover all the basics you need to know to get started, from the rules of play to essential techniques like serving, dinking, and volleying. Offered at both the Naik Family & Westerly-Pawcatuck Branch. Members: $90 Participants: $126 Youth Sports & Wellness Sports Galore Age: 5-10yrs Duration: 45m This program will introduce new sports each week, like soccer, basketball, tee-ball, pickleball, volleyball, ga-ga, and more! We will focus on skills and teambuilding while enjoying heart-healthy fun. Offered at the Westerly-Pawcatuck & Naik Family Branches. Members: $90 Participants: $126 Youth/Teen Strength & Conditioning Age: 10-13yrs Duration: 45m Learn fundamental strength skills. Participants will practice how to perform basic weight training movements allowing them to build proper techniques. Class is run in a circuit format in the Wellness Center at the Westerly-Pawcatuck and Naik Family Branches. Members: $96 Participants: $134 Rookie Sports Age: 3-4yrs Duration: 30m This program is designed for kids who are new to sports and teaches basic skill development in soccer, basketball, and tee-ball. Players are introduced to sports through drills, gym games and team play. Offered at the Westerly-Pawcatuck Branch Members: $75 Participants: $110 8 Basketball Skills & Drills Age: 5-10yrs Duration: 45m This program is focused on teamwork, sportsmanship, and learning the basics of basketball. Players will learn skills including dribbling, shooting, passing, and court positions. Offered at the Naik Family Branch. Members: $90 Participants: $126 *NEW* Infant Massage Age: 0-12mo Duration: 45m Soothing touch and connection to your infant. Come learn different hand positions and massage sequences to sooth your little one at the Westerly-Pawcatuck Branch. Members: $96 Participants: $134 Lifting Club Age: 14-17yrs Duration: 60m Drop by the Westerly-Pawcatuck Wellness Center and learn with our trainers and resident highland games competitor practicing event specific lifts. Members: FREE Participants: Day Pass *NEW* Peak Performance: Off-Season Training & Conditioning Age: 13-17yrs Duration: 60m Designed to help athletes of all ages stay strong, agile, and ready for their sport during the off-season. This class focuses on building foundational fitness through exercises that improve endurance, strength, speed, and flexibility. With a mix of cardio, strength training, agility drills, and mobility work, participants can address any weaknesses and prevent injuries while staying in top physical shape. Currently offered at the Arcadia Branch in the NEW Functional Fitness Room. Members: $115 Participants: $161 TONI’S KIDS Toni’s Kids is an integration initiative designed to provide support for children with diverse emotional, developmental, and intellectual disabilities. This program allows participants to engage with typically developing peers in Y programs and activities at Camp Watchaug as well as our Westerly-Pawcatuck Branch. To see if your child qualifies for Toni’s Kids, please contact Dori McGovern, Senior Program Director, at (401)364-6535 or dmcgovern@oceancommunityymca.org *NEW* Youth Ballet Age: 4-7yrs Duration: 30m A class for the young dancer that infuses ballet basics with a creative dance approach. Dancers are introduced to the barre and center work. Curriculum involves proper body alignment, foot articulation, flexibility, musicality, and primary ballet technique. Now being offered at the Westerly-Pawcatuck Branch. Members: $75 Participants: $110 *NEW* Youth Jazz Age: 4-7yrs Duration: 30m A class for the young dancer to learn the fundamental terminology, coordination, rhythm, and form with a creative dance approach. Curriculum involves proper body alignment, foot articulation, flexibility, musicality, and basic technique. Now being offered at the Westerly-Pawcatuck Branch. Members: $75 Participants: $110 SCAN ME TO VIEW CLASS OFFERINGS & TO REGISTER! Youth Archery Age: 8-12yrs Duration: 45m Join us for an introduction to archery, led by a USA-certified archery instructor! This hands-on class covers fundamental techniques, safety guidelines, and proper equipment use to help you build confidence and precision in the sport. All ability levels are welcome. Class takes place outdoors next to the playground at the Naik Family Branch. Members: $90 Participants: $126 Gymnastics Gymnastics - Parent & Me Age: 18mo-3yrs Duration: 30m This class was developed so even our tiniest gymnasts would have the opportunity to run, jump, swing, and roll with the added support of a trusted adult. The overall goal of this class is for your little one to become familiar in our room so when the day comes for you to wait outside, they feel safe and confident. Members: $80 Participants: $115 9 Gymnastics - Rising Stars Age: 4-5yrs Duration: 45m Gymnastics Rising Stars are 4 & 5yr olds who have advanced from Tiny Tots. They will be introduced to greater focus on body shaping and muscle control. Rising Stars will further their muscle strength and progressing existing skills. Members: $96 Participants: $134 Gymnastics - Baby & Me Age: 6mo-17mo Duration: 30m This class will provide a gymnastics experience for the teeniest of gymnasts. This will include a parent guided play-based session introducing children to fundamental movement skills. This will give the teeny crawlers the opportunity to discover their body awareness in this safe & supportive environment. Members: $80 Participants: $115 Gymnastics - Tiny Tots Age: 3-5yrs Duration: 30m This class is for the child who is ready to participate without the support of an adult. The class introduces the primary skills of gymnastics including tumbling, jumping and other motor skills. Members: $80 Participants: $115 Gymnastics - Parent & Tot Age: 3-5yrs Duration: 30m The class introduces the primary skills of gymnastics including tumbling, jumping and other motor skill with the added support of an adult. Members: $80 Participants: $115 Gymnastics - Basic Age: 6-16yrs Duration: 45m Join this beginner gymnastics class to learn a variety of basic moves. Students should know how to do a forward roll and bunny hop prior to class. Students should also be able to follow directions. Members: $96 Participants: $134 Gymnastics - Boys Intermediate Age: 6-16yrs Duration: 45m This class builds upon the skills learned in the Boys Basic class, introducing more advanced techniques across all six men’s gymnastics events: Rings, Parallel Bars, Mushroom, High Bar, Floor, and Vault. Participants will also begin learning the foundational requirements for the boys’ competitive team, preparing them for the next level of gymnastics. Members: $96 Participants: $134 Gymnastics - Advanced Age: 6-16yrs Duration: 60m Advancing from intermediate gymnastics, gymnasts will continue to enhance skills. Coaches recommendation required. Members: $115 Participants: $161 Gymnastics - Pre-Team Age: 6-16yrs Duration: 60m Pre-Team is for the gymnast that shows a serious interest in the sport of gymnastics but is not ready to be on the competition team. Gymnasts will be evaluated by the coaching staff and will be asked to participate in a practice before joining. Must be members of the Y. Members: $115 Gymnastics - Boys & Girls Competition Team Age: 6-16yrs Duration: 3-6hrs/week The OCY Gymnastics Team is for gymnasts who are ready to take gymnastics to the next level. Gymnasts will compete at local and regional meets. Gymnasts must be evaluated by the coaching staff and tryout before joining. YMCA League & USAG options available. Must be members of the Y to join. Practice times and pricing determined by level. Members: Prices Vary Team Open Gym Age: 6-16yrs Duration: 1.5hrs This class is for those team members who would like to have more time to work on their routines before the competition season starts. Coaches will be available to ensure the safety of the gymnasts and give them some drills to do those skills that they are working so hard to master. Members: $10/class SCAN ME TO VIEW CLASS OFFERINGS & TO REGISTER! Gymnastics - Boys Basic Age: 6-16yrs Duration: 45m Designed specifically for boys, this class introduces foundational gymnastics skills across all six men’s events: Rings, Parallel Bars, Mushroom, High Bar, Floor, and Vault. Open to boys as young as four years old, this structured program focuses on building strength, coordination, and confidence in a fun and supportive environment. Members: $96 Participants: $134 Gymnastics - Intermediate Age: 6-16yrs Duration: 45m Advancing from basic gymnastics, we introduce more lessons on flexibility, strength, and balance. This program also incorporates and strengthens team spirit and growth of skills. Gymnasts should be recommended by the Gymnastics coaches for this class. Members: $96 Participants: $134 Pickleball 101 Age: 18+ Duration: 75m Our Pickleball 101 clinics cover all the basics you need to know to get started, from the rules of play to essential techniques like serving, dinking, and volleying. Come hone your beginner skills, at our Pickleball Clinics at the Westerly-Pawcatuck or Naik Family Branches! Members: $15 Participants: $30 Scan here to view schedules and tournament information, register for skills & drills, receive association updates, and MORE! Adult Sports & Leagues Pickleball 102 Age: 18+ Duration: 75m Pickleball 102 is our next step after 101 Pickleball. Under the guidance of an instructor, participants will begin to work on skills and in-game strategies. Come hone your beginner skills at the Westerly-Pawcatuck or Naik Family Branches! Members: $15 Participants: $30 Racquetball League Age: 18+ Similar to tennis, handball, and squash, the goal of Racquetball is to hit the ball before it takes a second bounce. Learn more about this fast-paced game and join the league! Matches are held on Mondays, Tuesdays, and Wednesdays for A league and B league, respectively. Level is based on past performance. For questions on placement and league please contact Dori McGovern at dmcgovern@oceancommunityymca.org. Members: FREE Participants: $50 10 *Must be an OCY Member to join PickleballDen* Men’s Pickleball League Age: 18+ Join the Men's Intermediate/Advanced Pickleball League to compete in fast-paced matches with skilled players. This league is perfect for those with solid pickleball experience looking to sharpen their skills and enjoy friendly competition. The league will run from March 3-April 14 at the Westerly-Pawcatuck Branch. Must be a member in PickleballDen to register. Members: $85 *NEW* Adaptive Pickleball Clinics Age: 12+ Duration: 45m The Adaptive Pickleball Clinic is designed for individuals with intellectual disabilities or who are neurodivergent, providing a supportive and inclusive environment to learn and enjoy the game. Participants will develop skills, build confidence, and have fun in a welcoming community at the Naik Family Branch. Members: FREE Participants: FREE Pickleball Skills & Drills Age: 18+ Duration: 2hrs Our Skills & Drills clinics are focused on specific skills, such as serving, volleying, or dinking, to help intermediate players refine their techniques. Register in Pickleball Den. Offered at the Westerly-Pawcatuck & Naik Family Branches. Members: $15 Participants: $30 Women’s Pickleball League Age: 18+ Join the Women's Intermediate/Advanced Pickleball League to compete in fast-paced matches with skilled players. This league is perfect for those with solid pickleball experience looking to sharpen their skills and enjoy friendly competition. The league will run from March 7-April 18 at the Naik Family Branch. Must be a member in PickleballDen to register. Members: $85 SCAN ME TO VIEW CLASS OFFERINGS & TO REGISTER! March Madness Pickleball Tournament Age: 18+ The YMCA's March Madness Pickleball Tournament will be held on Sunday, March 2, from 8 AM to 5 PM at the Westerly-Pawcatuck Branch's indoor courts. Open to the community, participants can register on Pickleball Den by February 23. Play format is up the river, down the river. Members: $30 Pickleball Point Play Age: 18+ Duration: 3hrs Pickleball Point Play is a fast moving, coach led clinic that gets your heart rate up and moving around the court. The overall purpose is to score points and be King/Queen of the court after 15 minutes. The games are fast paced with players rotating throughout the game on missed points. come check it out and you will quickly become an enthusiast! Signups will be done through PickleballDen and will be by levels (Beginner/Low Intermediate & High Intermediate/Advanced). Will be played at the Naik Family Branch. Members: $15 DOLPHINS SWIM TEAM HAMMERHEADS SWIM TEAM Swim Team Programs The Westerly-Pawcatuck Dolphins Swim Team is a USA Certified team whose coaches promote team spirit, competition, sportsmanship, tradition, YMCA Values, and fun. Swimmers will develop individual skills and stroke technique, improve times, and make new friends. Visit www.ymcadolphins.org for more registration info! A YMCA Membership is required to join the team. If you choose to join USA Swimming, there is an additional annual registration fee. The Mystic Hammerheads swim team promotes Y values, team spirit, competition and fun. Swimmers will develop new skills and stroke technique, improve times and make new friends. We also focus on team building and good competitive practices to help our swimmers take their swimming knowledge to the collegiate level. The season kicks off in September and wraps up with championship meets in March. Throughout these months, swimmers will get the chance to compete against other Y swim teams within the SENECY league. A YMCA membership is required to join the team. 12 FINANCIAL ASSISTANCE AVAILABLE! For information about Swim Team, please contact: Dolphins Swim Coach dolphinscoach@oceancommunityymca.org (401) 596-2894 For information about Swim Team, please contact: Jayde Forbes, Aquatics Director jforbes@oceancommunityymca.org (860) 536-3575 Swim Lesson Level Guide The YMCA Swim Lessons program uses a skill-based approach designed to meet the needs of local Y’s and the community they serve. The new swim lessons curriculum allows for both standardization and flexibility. The organization of the curriculum ensures that swim lesson programs look and sound the same in every Y across the country. Swim evaluations available! 13 Water Discovery & Exploration Age: 6-36mo Duration: 30m Stage: A + B No prior swimming experience is needed. Swimmers will be exploring the aquatic environment by learning to blow bubbles, gliding in the water while moving arms and legs, floating on their back, rolling front to back; working on the motor skills of grabbing onto the wall of the pool and learning to climb out and crawling on the wall in the water. Adults are required to be in the water with their swimmer and will also be learning fundamental safety and aquatic skills. Members: $80 Participants: $115 Water Stamina Age: 3-5yrs Duration: 30m Stage: 3 Swimmers must meet benchmark skills from Stage 2: Water Movement to be in this class. We will work on submerging and retrieving an object in chest-deep water, swimming on freestyle and backstroke for 10 yards unassisted, rolling front to back unassisted and treading water for 30 seconds. The benchmark skills that need to be met to move on to Stage 4: Stroke Introduction are submerging while jumping into the water, swimming, turning to swim back to the wall and grabbing the wall for 10 yards. Swimmers also must swim, float and swim for 15 yards independently. Members: $80 Participants: $115 Water Acclimation Age: 3-5yrs Duration: 30m Stage: 1 No prior swimming experience is needed. Swimmers will work on comfort with face in the water, gliding in the water, kicking, and moving their arms, floating on their back, rolling front to back and climbing out of the pool independently. The benchmark skills that need to be met to move on to Stage 2: Water Movement are submerging while jumping into the water, pushing off the bottom of the pool, turning and grabbing the wall assisted with the instructor. Swimmers also must be able to swim, float, swim for 10 feet assisted with the instructor. Members: $80 Participants: $115 Preschool Starter Class Age: 2-3yrs Duration: 30m Stage: A + B This class is for prepping your toddler for when they are 1:1 with an instructor after they age out of Water Discovery and Exploration. Adults will still be in the water, but the instructor will be swimming with each swimmer periodically 1:1. Members: $80 Participants: $115 Water Movement Age: 3-5yrs Duration: 30m Stage: 2 Swimmers must meet benchmark skills from Stage 1: Water Acclimation to be in this class. We will work on submerging our faces in the water by looking at objects under water, front and back glides, floating on their back, rolling front to back, kicking and moving their arms and treading water for 10 seconds. The benchmark skills that need to be met to move on to Stage 3: Water Stamina are submerging while jumping into the water, pushing off the bottom of the pool, turning and grabbing the wall unassisted and performing a swim, float, swim independently for 5 yards. Members: $80 Participants: $115 14 SCAN ME TO VIEW CLASS OFFERINGS & TO REGISTER! Private Swim Lessons The Ocean Community YMCA is pleased to offer Private Swim Lessons. We ask that you complete the form on our website or see our Welcome Center to put in your request. Your request will be scheduled in the order received. Please scan the QR code to fill out our online request form: Aquatics Water Stamina Age: 6-12yrs Duration: 45m Stage: 3 Swimmers must meet benchmark skills from Stage 2: Water Movement to be in this class. We will work on submerging and retrieving an object in chest-deep water, swimming on freestyle and backstroke for 15 yards unassisted, rolling front to back unassisted and treading water for 1 minute. The benchmark skills that need to be met to move on to Stage 4: Stroke Introduction are submerging while jumping into the water, swimming, turning to swim back to the wall and grabbing the wall for 10 yards. Swimmers also must be able to swim freestyle and/or backstroke for 25 yards. Members: $96 Participants: $134 Aquatics Water Movement Age: 6-12yrs Duration: 45m Stage: 2 Swimmers must meet benchmark skills from Stage 1: Water Acclimation to be in this class. We will work on submerging our faces in the water by looking at objects under water, front and back glides, floating on their back, rolling front to back, kicking and moving their arms and treading water for 10 seconds. The benchmark skills that need to be met to move on to Stage 3: Water Stamina are submerging while jumping into the water, pushing off the bottom of the pool, turning and grabbing the wall unassisted and performing a swim, float, swim independently for 5 yards. Members: $96 Participants: $134 Stroke Development & Stroke Mechanics Age: 6-12yrs Duration: 45m Stage: 5&6 Stage 5: Swimmers must meet benchmark skills from Stage 4: Stroke Introduction to be in this class. This stage works on building endurance and refining freestyle, backstroke, breaststroke and butterfly. We will be swimming 50 yards with kickboards, 50 yards with drills and swimming 50 yards of each stroke in its entirety. Kneeling and standing dives will be taught along with working on treading water for 2 minutes. Open turns and flip-turns will also be a focus throughout the class. The benchmark skills that need to be met to move on to Stage 6: Stroke Mechanics are swimming all four strokes and having the endurance to swim 75-100 yards continuously. Stage 6: Swimmers must meet benchmark skills from Stage 5: Stroke Development to be in this class. This stage works on building endurance and refining freestyle, backstroke, breaststroke and butterfly. We will be swimming 75-100 yards with kickboards, 75-100 yards with drills and swimming 75-100 yards of each stroke in its entirety. Kneeling and standing dives will be worked on along with retrieving an object from the bottom of the pool and treading water for 1 minute after. Open turns and flip-turns will also be a focus throughout the class. Members: $96 Participants: $134 Stroke Introduction Age: 6-12yrs Duration: 45m Stage: 4 Swimmers must meet benchmark skills from Stage 3: Water Stamina to be in this class. This stage works on building endurance and refining freestyle and backstroke and will introduce breaststroke and butterfly. We will be swimming 25 yards with kickboards, 25 yards with drills and swimming 25 yards of each stroke in its entirety. Sitting, kneeling and standing dives will be taught along with working on treading water for 1 minute. Open turns and flip-turns will be introduced. The benchmark skills that need to be met to move on to Stage 5: Stroke Development are swimming all four strokes and having the endurance to swim 50 yards continuously. Members: $96 Participants: $134 15 Westerly-Pawcatuck Branch Scan here to view Group Water Exercise Classes Scan here to view Group Water Exercise Classes Classes include Aqua Cardio, Aqua Flow & Glow, Silver Sneakers Splash, and more! Classes include Deep Water Workout, Aquacize, Senior Water Workout, S’WET and more! Naik Family Branch Water Acclimation Age: 6-12yrs Duration: 45m Stage: 1 No prior swimming experience is needed. Swimmers will work on comfort with face in the water, gliding in the water, kicking and moving their arms, floating on their back, rolling front to back and climbing out of the pool independently. The benchmark skills that need to be met to move on to Stage 2: Water Movement are submerging while jumping into the water, pushing off the bottom of the pool, turning and grabbing the wall assisted with the instructor. Swimmers also must be able to swim, float, swim for 10 feet assisted with the instructor. Members: $96 Participants: $134 SCAN ME TO VIEW CLASS OFFERINGS & TO REGISTER! Water Group Exercise Classes *NEW* Pop-Up Art Workshops with MMoA: Sponsored by Grace McDonnell Art Fund Age: 7-12yrs Duration: 2hrs Join us at the Naik Family Branch as we welcome artists from the Mystic Museum of Art for a pop-up art workshop. Each session will focus on a specific style, theme, or technique, and each participant will go home with their artwork inspired by the lesson. Dates to come! Members: FREE Participants: FREE Youth & Family Programs Parent’s Night Out Age: 5-12yrs Duration: 3hrs Bring your children to the Westerly-Pawcatuck Branch or Naik Family Branch for an evening of fun games and activities and enjoy an evening out! Dinner is provided. Registration is required. Space is limited. Members: $25; Participants: $40; Teen Night Age: 12-14 Duration: 3hrs Join your friends and make new ones at the Westerly-Pawcatuck Branch or Naik Family Branch! Participate in some exciting activities with our FUN YMCA staff! Dinner will be provided. Members: $25; Participants: $40; $5 per additional child $10 per additional child 16 $5 per additional child $10 per additional child Vacation Days Age: 5-15yrs Duration: Varies Spend your Spring vacation at the YMCA! Students K-6 will enjoy a variety of activities that will include arts & crafts, STEM projects, swimming, outdoor activities (weather permitting), and more! Vacation days will be offered from April 14-18 at the Naik Family Branch. Members: $55/day Participants: $75/day Story Time Age: 2-5yrs Duration: 30m Listen to captivating tales featuring beloved characters, adventures, and life lessons. After the story, children will create a themed craft project inspired by the day's tale. From colorful art pieces to simple DIY creations, each craft encourages creativity and fine motor skills. Offered at the Westerly-Pawcatuck Branch & Naik Family Branch. Members: FREE ARC Babysitting Course Age: 11-15yrs Duration: 6hrs Come and take part in our two class workshop at the Westerly-Pawcatuck Branch to develop the skills needed to be safe, responsible and successful babysitters. At the completion of class, students will receive American Red Cross Certified Babysitter Certificates which will include Pediatric First Aid and CPR. Other topics include: leadership styles, starting a business, decision making, childcare, and handling an emergency situation. Must be able to attend both days. Members: $125 Participants: $160 LEGO Club Age: 5-14yrs Duration: 45m Lego Club is a STEM focused enjoyable peer activity that stimulates and develops spatial intelligence. It teaches participants teamwork, problem solving, and enhances creativity. Let’s let our imaginations run wild and build together at the Naik Family Branch! Members: $90 Participants: $126 OCYMCA Leader’s Club Age: Grades 6-12 Duration: 60m Leaders Club is designed to offer young adults the opportunity to develop leadership skills as they provide volunteer service within the YMCA and the local community. This program is extremely hands-on and is managed by an elected executive board. For OCYMCA members only. Meetings will be held on a weekly basis. Meetings are held at the Naik Family Branch. Members: FREE Crafting Club Age: 5-10yrs Duration: 45m Creative and craft kids come together to create different arts and crafts projects. Y staff at the Naik Family Branch will plan a project for each week and allow participants to add their own creative twists! Members: $90 Participants: $126 Spring Break Camp at Camp Watchaug Age: 5-14yrs Duration: Varies Spend your Spring Break at Camp Watchaug! Participate in activities such as the climbing wall, low ropes course, archery, gaga ball, field games, arts & crafts, nature, fire pit stories and more! Pool time and gym games provided during afternoon extended care. Bus transportation will be provided from the Westerly-Pawcatuck Branch YMCA. Members: Varies Participants: Varies Annual Easter Egg Hunt at Camp Watchaug Age: ALL Duration: 45m Register today for the Annual Easter Egg Hunt at Camp Watchaug for a day of family fun and adventure! Search for hidden eggs, enjoy the beautiful outdoors, and create unforgettable memories together. Members: FREE Participants: FREE Easter Egg Splash Age: ALL Duration: 45m Join us at this FREE & FUN event at the Naik Family Branch & Westerly-Pawcatuck Branch to collect Easter eggs in the pool in exchange for candy from the Easter bunny! Don’t forget to take a photo after with the Easter bunny too! Dates to come! Members: FREE Participants: FREE SCAN ME TO VIEW CLASS OFFERINGS & TO REGISTER! Adult Enrichment Adult Tap Dance Age: 18+ Duration: 60m In these classes you will learn or continue to development tap techniques with a focus on speed, transitions, and style. Offered at the Westerly-Pawcatuck & Naik Family Branches. Members: $108 Participants: $151 Garden Club Age: 18+ Duration: 2hrs Garden Club promotes the encouragement and advancement of gardening. Club meetings are held on the 3rd Wednesday of the month with a specific presentation. Events and activities are scheduled throughout the year. All funds raised are put towards camperships. Members: FREE Participants: $32 Annually 18 ARC First Aid/CPR/AED Age: 14+ Duration: 2hrs This course is designed to teach you to recognize signs and symptoms of heart attacks and other emergencies and respond to them appropriately. Includes certification for adults, children and infants. BLENDED COURSE: Certification is good for two years. Online component followed by in person skills section. Offered at the Westerly-Pawcatuck, Naik Family and Arcadia Branches. Members: $125 Participants: $160 ARC Lifeguarding Course Age: 15+yrs Duration: Varies Lifeguard Requirements: Must be 15 years old before the course begins; Must be able to swim 300 yard without stopping; Must be physically able to make rescues in water. Participants will become certified as Red Cross Lifeguards as well as First Aid/CPR/AED for the Professional Rescuer. Certification is FREE with your commitment to work at the YMCA. Offered at the Westerly-Pawcatuck Branch. Members: $399 Participants: $458 Adult Tap & Jazz Dance Age: 18+ Duration: 60m Learn basic jazz steps, techniques, terminology while improving strength, flexibility, and coordination. Jazz dance encourages personal style, body awareness and not to mention super fun! The other half of the class will include beginner tap. Offered at the Westerly-Pawcatuck Branch. Members: $108 Participants: $151 Adult Art Age: 18+ Duration: 60m Join us for an art class open to adults of all ages! Reduce boredom and anxiety and increase your creativity and self-esteem. Each week you will work on a new project. Offered at the Naik Family Branch. Members: $108 Participants: $151 SCAN ME TO VIEW CLASS OFFERINGS & TO REGISTER! Beach Concert Series Naik Family Branch Get ready for the Summer Beach Concert Series, featuring live music from June through September in a family-friendly atmosphere. Bring your loved ones, relax by the shore, and soak up the sounds of summer. More details to come! COMING SOON! Viva la Salsa! Age: 18+ Duration: 2hr Ready to spice up yJoin us for a fun and engaging beginner-friendly salsa class at the YMCA! This one-time workshop is perfect for anyone looking to learn the basics of salsa dancing in a relaxed and supportive environment. Led by an experienced instructor, you’ll discover foundational steps, simple turns, and the rhythm that makes salsa so irresistible. No dance experience or partner is required—just bring your energy and enthusiasm! Class will be offered in May at the Westerly-Pawcatuck Branch Members: $20 Participants: $25 19 ARCADIA BRANCH 1190 MAIN STREET WYOMING, RI 02898 (401) 539-2306 WESTERLY-PAWCATUCK BRANCH 95 HIGH STREET WESTERLY, RI 02891 (401) 596-2894 NAIK FAMILY BRANCH 1 HARRY AUSTIN DRIVE MYSTIC, CT 06355 (860) 536-3575 OCEANCOMMUNITYYMCA.ORG VISIT OUR BRANCHES: VISIT OUR BRANCHES:"
    },
    {
      "url": "https://www.brawleyhigh.org/article/2060720",
      "content": "Weekly Updates: March 3rd-7th, 2025 | Brawley Union High School District Skip to content Aeries Portals Search Site Brawley Union High School District ================================== Aeries Portals Search Site ExploreExplore Schools Translate Explore Schools Translate Our District Show submenu for Our District Our District Superintendent District Mission, Vision, & Goals School Accountability Report Cards School District Calendar Non-discrimination and Title IX Information District Notices & Public Postings Citizens' Oversight Committee Departments Show submenu for Departments Departments Business Services Cafeteria & Student Nutrition Career Technical Education Curriculum & Instruction Family Resource Center Human Resources Maintenance, Operations and Transportation Registrar/Transcripts Special Education State and Federal Programs Technology Testing and Assessment Board Of Education Show submenu for Board Of Education Board Of Education Board Of Trustees Board Meeting Dates and Agendas Reports Reports Mental Health Services Mental Health Services Hazel Health Hazel Health More Show submenu for Brawley Union High School District News Weekly Updates: March 3rd-7th, 2025 Weekly Updates: March 3rd-7th, 2025 ASB March 2, 2025 Monday, March 3rd, 2025- Odd Tuesday, March 4th, 2025- Even Wednesday, March 5th, 2025- Odd (High School Madness) Thursday, March 6th, 2025 - Even Friday, March 7th, 2025- Odd Bell Schedule 2024-2025 High School Madness (Positive Behavior is Essential to Win)! Wednesday, March 5th at 6:00 PM Location: Grandstands VSN plans to livestream the event. We are provided 398 wristbands for our students and advisors to be admitted to High School Madness based on our attendance percentage. The wristband for HSM gets the student in the gate, into HSM, and also includes carnival rides. If students are unable to receive a High School Madness wristband from BUHS, they may purchase a ticket from the fair. Just note that the ticket from the fair will not allow entrance into the grandstands for the HSM event. The fair ticket purchased on \"Wacky Wednesday\" includes carnival rides. Ticket Plan: Monday- Mrs. Self is finalizing ticket list for attendees: cheer, game participants, drumline, chaperones and students who signed up on the High School Madness form sent a week ago. If you are interested in being a game participant, please contact 25roman.carina@brawleyhigh.org Cari and ASB have been working on the game participant list. Tuesday/Wednesday- Drumline and Cheer will receive wristbands from their advisor. ASB and game participants will receive their wristbands from ASB office (Val). Students who signed up on form will be notified if they are to pick up wristbands Tuesday or Wednesday. Please note, when wristbands are picked up and paid for ($10.00), it will be attached to your wrist to reduce risk of loss and black-market sales. NO PARKING ON \"C\" STREET. NO EXCEPTIONS! The parking on \"C\" street by the band and wrestling area is designated only for busses and school vans Thank you!! After School DETENTION (M/Tu/Th) 3:05 - 4:05 Teachers: Ms Ledon (Rm 62), Mr. Carrillo (64), Mr. Rico (63), Mr. Ibarra (Lunch Tables/Cafeteria), Mr. Contreras (#51) MONDAY3/3TUESDAY3/4WEDTHURSDAY3/6FRIDAYMr. RicoMr. CarrilloWeek 1Mr. Contreras3/9Mr. Ibarra3/10Ms. LedonWeek 23/12Mr. ContrerasREPEAT SPORTS Sports Schedule up to March 14th (Subject to Change) SPRING SPORTS: BASEBALL TRYOUTS: See Mr. Carranza in Room 56 if you have any questions. SOFTBALL PLEASE SEE MRS. MUNGUIA FOR DETAILS ON HOW AND WHEN TO GO ABOUT GETTING CLEARED. ALSO, PLEASE STOP BY THE COUNSELING CENTER TO SEE MR. WISE TO GET SIGNED-UP FOR THE UPCOMING SEASON. IF YOU ARE CURRENTLY PARTICIPATING IN A WINTER SPORT PLEASE CONTACT COACH KERNS (760-791-1817) TO MAKE ARRANGEMENTS TO TRYOUT AFTER YOUR WINTER SEASON HAS BEEN COMPLETED. YOU WILL NOT BE ALLOWED TO TRYOUT FOR SOFTBALL UNTIL YOUR WINTER SPORT SEASON HAS BEEN COMPLETED. Attention All Swimmers! 🏊‍♀️🏊‍♂️ For information see Mrs. Cruz in Room 90. TRACK: Track will be at Warne Field Monday-Friday at 3:30. Must have a ticket to play. Are you interested in joining Tall Flags and performing alongside our BUHS band at exciting events? Join us for practice every day from 3:00–4:00 in Room 62. For more info, contact Ms. Ledón! ASB ASB Calendar (Click Here for ASB Calendar of Events) Online Store Click Here for Brawley Union High School Online Store . CAP AND GOWN Cap and gowns will be ordered and Mr. Honnold (Balfour) plans to bring them to high school late March. They will be distributed from the ASB office. There are a few who still need to purchase. We will have extras for sale when the gowns arrive. If you would like, you may contact Mr. Honnold below to reserve your size. I am still able to redeem PBIS Rewards and CAASPP money to cover gown costs. If you need help, email me or stop by the ASB office. dself@brawleyhigh.org Balfour: Graduation Cap and Gown Orders Contact: David Honnold, david.honnold@balfour-rep.com (use personal email to contact him because he can't send email to student emails), 619-933-8405 Cost: $35.00 (He accepts credit and debit cards) Balfour will also have a selection of Class Rings and Letterman Jackets. If a ring is ordered, a cap and gown will also be included at no additional cost. Use your school Gmail to access your Minga ID. We have also passed out physical ID's. Students- Have issues with your ID? Come see us in the ASB office! Staff ID's- Ceci in the library will help with your ID. The 2025 La Ocotilla BUHS yearbook and dedication ads are now on sale! Email Publications advisor, Ms. Camargo, for more information regarding purchases for either yearbooks or ads.\" Yearbooks - Yearbooks have sold out before June the last THREE years so it is highly recommended to purchase your yearbook as soon as possible. For online sales/card payments, fliers with links and QR codes have been emailed. For cash/check yearbook purchases: Stop by Room 54 before school, during lunch, or after school Checks can be made out to BUHS Publications All ads must be ordered by midnight on February 13, 2025 - see flier for sizing and pricing information. If you have any questions or did not receive fliers, please contact the Publications advisor, Ms. Camargo, at mcamargo@brawleyhigh.org . COUNSELING Congratulations to Sophia Valenzuela for being selected to represent BUHS at Girls State! Scholarship opportunity for seniors who have been accepted to an accredited career technical school, community college or university in the United States, for more information please contact Ms. Flores at ivrop@brawleyhigh.org Hey seniors! Just a quick reminder: if you hit that “standard met” or “standard exceeded” mark on the CAASPP, you might be in for an awesome treat! You can snag up to an $80 voucher for school-related fun and expenses! That’s a $20 voucher for “standard met” and a $40 voucher for “standard exceeded.” Huge congrats to everyone who rocked the CAASPP! To use your voucher, just swing by any activity advisor—whether it's for prom, Grad Night, your cap and gown, yearbook, and more—and let them know you want to use your voucher. They have the scoop on who gets what! Enjoy and make the most of it! Grad Night- Mrs. Hardie (61) /Mrs. Villon (Counseling Center) Cap and Gown- (ASB Office) Mrs. Self/Mrs. Lau Prom- Ms. Renteria (Office in Counseling Center Hallway), Mrs. Tomboc (46), Mrs. Self (ASB) Yearbook- Ms. Camargo (54) CAFETERIA SEL Let’s work together to make our school a more supportive, inclusive, and awesome place for all. PICTURE INFORMATION School pictures available in the ASB office! Fall sports pictures available in Mr. Brewer's office! PICTURE DATES: Sports Pictures: 3/10/2025 & 3/11/2025 (Spring) Prom: Saturday, May 3rd CLUBS 2024-2025 Club List Board Game Club We meet every Friday during lunch in Room 44 with Ms. Ross. Come and have fun by playing board games with us. Bring your own lunch. Campus Life Come join us! Campus Life - Room 7 - CAMPUS LIFE is now meeting on TUESDAY's, during LUNCH, ROOM 7. A club with a positive faith message, friends, and pizza. Everyone is welcome. Class of 2025 Grad Night Advisors: Mrs. Hardie chardie@brawleyhigh.org and Mrs. Villon svillon@brawleyhigh.org Senior Grad Nite: Important Information & Deadlines Grad Night Date: Grad Night will take place at Universal Studios on Friday, May 30th, 2025. CLASS OF 2026 FCA Club Fellowship of Christian Athletes (FCA) will meet every Thursday during lunch in room 42. GSA Club Lego Club MESA MESA meetings in Mr. Acosta's class. l5jorok is the MESA classroom code to join RETRO GAMING CLUB Gamers we will be having our next meeting on Wednesday the 26th during lunch in Rm 70. Get your game on! Scrapbook Club We meet every Monday after school. Mondays from 3-5 P.M. in Room 44 with Ms. Ross. Come join us and create your own scrapbook photo book and save your high school memories. All supplies are provided, including photo printing. The Village The Village Club meets every Wednesday during lunch in room 65. The Village room 24 is open every collaboration Wednesday. UNICEF Club Join the UNICEF Club to complete your service hours online and make a difference around the world! The UNICEF Club is focused on serving communities globally. Get involved by participating in online service or opportunities! Complete 10 hours of service with UNICEF to receive a graduation cord. Google Classroom Code: 2x2ixxr Questions? Contact Ms. Villon at svillon@brawleyhigh.org. The Wrestling Scorers Club is accepting members. See Mr. Martinez in room 71 for more information. Young Men's Club For questions, please see Advisor Mr. Castillo in the counseling center IVROP MENTAL HEALTH SERVICES Here are some planned activities for 2nd semester (event date/times are subject to change): Mar. 5th- High School Madness Mar. 9th- Daylight Savings Time Mar. 12th- 6:00 PM Board Meeting March 14th- SEL Assembly 8-11 March 19th- iCan Event April 9th- 6:00 PM Board Meeting April. 17th- Career Day April 18th-27th- Spring Break Friday, May 2nd- Asian Pacific Islander Assembly 8-11 May 3rd- Prom May 14th- 6:00 PM Board Meeting May 22nd- Senior Awards Night May 26th- No School: Memorial Day May 28th- Tutorial University Admissions Assembly May 30th- Grad Bash Universal Studios June 4th- DVHS Graduation June 5th- BUHS Graduation Find Us Brawley Union High School District109 Magnolia StreetBrawley, CA 92227Phone: 760-312-6063Fax: 760-344-9520 Schools Brawley Union High School District Brawley Union High School Desert Valley High School Other Resources --------------- BUHSD Policy on Suicide Prevention BUHSD Policy on Nondiscrimination/Harrassment BUHSD Policy on Sexual Harassment BUHSD Policy on Hate-Motivated Behavior BUHSD Policy on Bullying 2024-25 BUHSD Board Approved LCAP Civil Rights Department Posters ------------------------------- CRD Workplace Discrimination & Harassment Notice CRD Pregnancy RIghts Notice CRD Family Care, Medical Leave, & Pregnancy Disability Leave Notice CRD Transgender Rights in the Workplace Notice Stay Connected Copyright © 2025 Brawley Union High School District. All rights reserved.Powered By Apptegy Visit us to learn more",
      "title": "Weekly Updates: March 3rd-7th, 2025 | Brawley Union High School District Skip to content Aeries Portals Search Site Brawley Union High School District ================================== Aeries Portals Search Site ExploreExplore Schools Translate Explore Schools Translate Our District Show submenu for Our District Our District Superintendent District Mission, Vision, & Goals School Accountability Report Cards School District Calendar Non-discrimination and Title IX Information District Notices & Public Postings Citizens' Oversight Committee Departments Show submenu for Departments Departments Business Services Cafeteria & Student Nutrition Career Technical Education Curriculum & Instruction Family Resource Center Human Resources Maintenance, Operations and Transportation Registrar/Transcripts Special Education State and Federal Programs Technology Testing and Assessment Board Of Education Show submenu for Board Of Education Board Of Education Board Of Trustees Board Meeting Dates and Agendas Reports Reports Mental Health Services Mental Health Services Hazel Health Hazel Health More Show submenu for Brawley Union High School District News Weekly Updates: March 3rd-7th, 2025 Weekly Updates: March 3rd-7th, 2025 ASB March 2, 2025 Monday, March 3rd, 2025- Odd Tuesday, March 4th, 2025- Even Wednesday, March 5th, 2025- Odd (High School Madness) Thursday, March 6th, 2025 - Even Friday, March 7th, 2025- Odd Bell Schedule 2024-2025 High School Madness (Positive Behavior is Essential to Win)! Wednesday, March 5th at 6:00 PM Location: Grandstands VSN plans to livestream the event. We are provided 398 wristbands for our students and advisors to be admitted to High School Madness based on our attendance percentage. The wristband for HSM gets the student in the gate, into HSM, and also includes carnival rides. If students are unable to receive a High School Madness wristband from BUHS, they may purchase a ticket from the fair. Just note that the ticket from the fair will not allow entrance into the grandstands for the HSM event. The fair ticket purchased on \"Wacky Wednesday\" includes carnival rides. Ticket Plan: Monday- Mrs. Self is finalizing ticket list for attendees: cheer, game participants, drumline, chaperones and students who signed up on the High School Madness form sent a week ago. If you are interested in being a game participant, please contact 25roman.carina@brawleyhigh.org Cari and ASB have been working on the game participant list. Tuesday/Wednesday- Drumline and Cheer will receive wristbands from their advisor. ASB and game participants will receive their wristbands from ASB office (Val). Students who signed up on form will be notified if they are to pick up wristbands Tuesday or Wednesday. Please note, when wristbands are picked up and paid for ($10.00), it will be attached to your wrist to reduce risk of loss and black-market sales. NO PARKING ON \"C\" STREET. NO EXCEPTIONS! The parking on \"C\" street by the band and wrestling area is designated only for busses and school vans Thank you!! After School DETENTION (M/Tu/Th) 3:05 - 4:05 Teachers: Ms Ledon (Rm 62), Mr. Carrillo (64), Mr. Rico (63), Mr. Ibarra (Lunch Tables/Cafeteria), Mr. Contreras (#51) MONDAY3/3TUESDAY3/4WEDTHURSDAY3/6FRIDAYMr. RicoMr. CarrilloWeek 1Mr. Contreras3/9Mr. Ibarra3/10Ms. LedonWeek 23/12Mr. ContrerasREPEAT SPORTS Sports Schedule up to March 14th (Subject to Change) SPRING SPORTS: BASEBALL TRYOUTS: See Mr. Carranza in Room 56 if you have any questions. SOFTBALL PLEASE SEE MRS. MUNGUIA FOR DETAILS ON HOW AND WHEN TO GO ABOUT GETTING CLEARED. ALSO, PLEASE STOP BY THE COUNSELING CENTER TO SEE MR. WISE TO GET SIGNED-UP FOR THE UPCOMING SEASON. IF YOU ARE CURRENTLY PARTICIPATING IN A WINTER SPORT PLEASE CONTACT COACH KERNS (760-791-1817) TO MAKE ARRANGEMENTS TO TRYOUT AFTER YOUR WINTER SEASON HAS BEEN COMPLETED. YOU WILL NOT BE ALLOWED TO TRYOUT FOR SOFTBALL UNTIL YOUR WINTER SPORT SEASON HAS BEEN COMPLETED. Attention All Swimmers! 🏊‍♀️🏊‍♂️ For information see Mrs. Cruz in Room 90. TRACK: Track will be at Warne Field Monday-Friday at 3:30. Must have a ticket to play. Are you interested in joining Tall Flags and performing alongside our BUHS band at exciting events? Join us for practice every day from 3:00–4:00 in Room 62. For more info, contact Ms. Ledón! ASB ASB Calendar (Click Here for ASB Calendar of Events) Online Store Click Here for Brawley Union High School Online Store . CAP AND GOWN Cap and gowns will be ordered and Mr. Honnold (Balfour) plans to bring them to high school late March. They will be distributed from the ASB office. There are a few who still need to purchase. We will have extras for sale when the gowns arrive. If you would like, you may contact Mr. Honnold below to reserve your size. I am still able to redeem PBIS Rewards and CAASPP money to cover gown costs. If you need help, email me or stop by the ASB office. dself@brawleyhigh.org Balfour: Graduation Cap and Gown Orders Contact: David Honnold, david.honnold@balfour-rep.com (use personal email to contact him because he can't send email to student emails), 619-933-8405 Cost: $35.00 (He accepts credit and debit cards) Balfour will also have a selection of Class Rings and Letterman Jackets. If a ring is ordered, a cap and gown will also be included at no additional cost. Use your school Gmail to access your Minga ID. We have also passed out physical ID's. Students- Have issues with your ID? Come see us in the ASB office! Staff ID's- Ceci in the library will help with your ID. The 2025 La Ocotilla BUHS yearbook and dedication ads are now on sale! Email Publications advisor, Ms. Camargo, for more information regarding purchases for either yearbooks or ads.\" Yearbooks - Yearbooks have sold out before June the last THREE years so it is highly recommended to purchase your yearbook as soon as possible. For online sales/card payments, fliers with links and QR codes have been emailed. For cash/check yearbook purchases: Stop by Room 54 before school, during lunch, or after school Checks can be made out to BUHS Publications All ads must be ordered by midnight on February 13, 2025 - see flier for sizing and pricing information. If you have any questions or did not receive fliers, please contact the Publications advisor, Ms. Camargo, at mcamargo@brawleyhigh.org . COUNSELING Congratulations to Sophia Valenzuela for being selected to represent BUHS at Girls State! Scholarship opportunity for seniors who have been accepted to an accredited career technical school, community college or university in the United States, for more information please contact Ms. Flores at ivrop@brawleyhigh.org Hey seniors! Just a quick reminder: if you hit that “standard met” or “standard exceeded” mark on the CAASPP, you might be in for an awesome treat! You can snag up to an $80 voucher for school-related fun and expenses! That’s a $20 voucher for “standard met” and a $40 voucher for “standard exceeded.” Huge congrats to everyone who rocked the CAASPP! To use your voucher, just swing by any activity advisor—whether it's for prom, Grad Night, your cap and gown, yearbook, and more—and let them know you want to use your voucher. They have the scoop on who gets what! Enjoy and make the most of it! Grad Night- Mrs. Hardie (61) /Mrs. Villon (Counseling Center) Cap and Gown- (ASB Office) Mrs. Self/Mrs. Lau Prom- Ms. Renteria (Office in Counseling Center Hallway), Mrs. Tomboc (46), Mrs. Self (ASB) Yearbook- Ms. Camargo (54) CAFETERIA SEL Let’s work together to make our school a more supportive, inclusive, and awesome place for all. PICTURE INFORMATION School pictures available in the ASB office! Fall sports pictures available in Mr. Brewer's office! PICTURE DATES: Sports Pictures: 3/10/2025 & 3/11/2025 (Spring) Prom: Saturday, May 3rd CLUBS 2024-2025 Club List Board Game Club We meet every Friday during lunch in Room 44 with Ms. Ross. Come and have fun by playing board games with us. Bring your own lunch. Campus Life Come join us! Campus Life - Room 7 - CAMPUS LIFE is now meeting on TUESDAY's, during LUNCH, ROOM 7. A club with a positive faith message, friends, and pizza. Everyone is welcome. Class of 2025 Grad Night Advisors: Mrs. Hardie chardie@brawleyhigh.org and Mrs. Villon svillon@brawleyhigh.org Senior Grad Nite: Important Information & Deadlines Grad Night Date: Grad Night will take place at Universal Studios on Friday, May 30th, 2025. CLASS OF 2026 FCA Club Fellowship of Christian Athletes (FCA) will meet every Thursday during lunch in room 42. GSA Club Lego Club MESA MESA meetings in Mr. Acosta's class. l5jorok is the MESA classroom code to join RETRO GAMING CLUB Gamers we will be having our next meeting on Wednesday the 26th during lunch in Rm 70. Get your game on! Scrapbook Club We meet every Monday after school. Mondays from 3-5 P.M. in Room 44 with Ms. Ross. Come join us and create your own scrapbook photo book and save your high school memories. All supplies are provided, including photo printing. The Village The Village Club meets every Wednesday during lunch in room 65. The Village room 24 is open every collaboration Wednesday. UNICEF Club Join the UNICEF Club to complete your service hours online and make a difference around the world! The UNICEF Club is focused on serving communities globally. Get involved by participating in online service or opportunities! Complete 10 hours of service with UNICEF to receive a graduation cord. Google Classroom Code: 2x2ixxr Questions? Contact Ms. Villon at svillon@brawleyhigh.org. The Wrestling Scorers Club is accepting members. See Mr. Martinez in room 71 for more information. Young Men's Club For questions, please see Advisor Mr. Castillo in the counseling center IVROP MENTAL HEALTH SERVICES Here are some planned activities for 2nd semester (event date/times are subject to change): Mar. 5th- High School Madness Mar. 9th- Daylight Savings Time Mar. 12th- 6:00 PM Board Meeting March 14th- SEL Assembly 8-11 March 19th- iCan Event April 9th- 6:00 PM Board Meeting April. 17th- Career Day April 18th-27th- Spring Break Friday, May 2nd- Asian Pacific Islander Assembly 8-11 May 3rd- Prom May 14th- 6:00 PM Board Meeting May 22nd- Senior Awards Night May 26th- No School: Memorial Day May 28th- Tutorial University Admissions Assembly May 30th- Grad Bash Universal Studios June 4th- DVHS Graduation June 5th- BUHS Graduation Find Us Brawley Union High School District109 Magnolia StreetBrawley, CA 92227Phone: 760-312-6063Fax: 760-344-9520 Schools Brawley Union High School District Brawley Union High School Desert Valley High School Other Resources --------------- BUHSD Policy on Suicide Prevention BUHSD Policy on Nondiscrimination/Harrassment BUHSD Policy on Sexual Harassment BUHSD Policy on Hate-Motivated Behavior BUHSD Policy on Bullying 2024-25 BUHSD Board Approved LCAP Civil Rights Department Posters ------------------------------- CRD Workplace Discrimination & Harassment Notice CRD Pregnancy RIghts Notice CRD Family Care, Medical Leave, & Pregnancy Disability Leave Notice CRD Transgender Rights in the Workplace Notice Stay Connected Copyright © 2025 Brawley Union High School District. All rights reserved.Powered By Apptegy Visit us to learn more"
    },
    {
      "url": "https://www.meetup.com/lp/sports-fitness/",
      "content": "Make Friends at Sports, Fitness, & Recreation Events on Meetup | Meetup Skip to content Make Friends at Sports, Fitness, & Recreation Events on Meetup Whether you like to hike, run, cycle, or play team sports like soccer and volleyball, there are tons of groups for your interests on Meetup. Join groups to find local events and meet people who share your passion for recreational activities. Join Groups Soccer ▶ Bootcamps & Workouts ▶ Running ▶ Find Sports Groups and Events Find sports groups and events Join groups for your interests, from basketball and volleyball to darts and table tennis. Make friends with people who like what you like. Get better at the sports you enjoy and experience the satisfaction of improving your game. Join sports groups Discover upcoming online fitness events Fitness events and activities are happening all the time on Meetup. Log in to find sports, workouts, classes, and tournaments near you. Discover online events Find sports groups and events Join groups for your interests, from basketball and volleyball to darts and table tennis. Make friends with people who like what you like. Get better at the sports you enjoy and experience the satisfaction of improving your game. Join sports groups Discover upcoming online fitness events Fitness events and activities are happening all the time on Meetup. Log in to find sports, workouts, classes, and tournaments near you. Discover online events Find fitness and sports groups Popular Fitness and Sports Groups Near Me Join a dedicated group of active locals and sports enthusiasts. Make friends who share your interest in living a healthy lifestyle. See Groups ▶ Try something new: discover exciting fitness events near me Basketball ▶ Weight Loss ▶ Cycling ▶ Volleyball ▶ Winter Sports ▶ Upcoming sports and fitness events There are thousands of groups dedicated to sports and fitness on Meetup, with events happening every day. Upcoming online events Find your people Start your own fitness and sports group You don’t need to be an expert to start a thriving fitness group. Host recreation events and meet people who share your interests. Save 30% when you start a new group today! Start a group Being outside in the fresh air, exercising, and having pleasant conversations with wonderful people has made all the difference for me. My [Meetup group’s] weekly hikes have brought a smile to my face and joy to my heart! —Meetup member Stories from Meetup members ### Recording | Meetup 101: Building a Strong Community CultureGet answers to the most common questions about fostering healthy membership relations. ### Five Tips for a Great Meet and Greet EventSo you’ve got a new Meetup group, and you want to kick things off. Make your first event a simple, light, short, and stress-free Meet and Greet. ### Taking It to the Streets: Q&A with Street Art Tour Paris OrganizerIn this interview, Paris-based Meetup organizer and artist Kasia Klon talks about her love for urban artwork and how she decided to use that passion to meet people. ### Recording | Meetup 101: Building a Strong Community CultureGet answers to the most common questions about fostering healthy membership relations. ### Five Tips for a Great Meet and Greet EventSo you’ve got a new Meetup group, and you want to kick things off. Make your first event a simple, light, short, and stress-free Meet and Greet. ### Taking It to the Streets: Q&A with Street Art Tour Paris OrganizerIn this interview, Paris-based Meetup organizer and artist Kasia Klon talks about her love for urban artwork and how she decided to use that passion to meet people. Read More Stories Frequently Asked Questions What are the best sports to try as an adult? The best sport for an adult is one that’s enjoyable! If you want to pick up a sport as an adult, think back to sports you’ve enjoyed playing in the past like soccer, volleyball, football, rugby, or tennis. You can also explore newly popular sports like pickleball, spikeball, or even kayak water polo (yes, it’s a real sport on Meetup!) What are some fun and social fitness activities? Recreational activities are excellent social outings. Having a shared interest makes it easier to spark a friendship. Activities like walking, running, and hiking are great methods for meeting people and having conversations while you exercise. Search for fitness events to meet active locals. Where can I find a fitness group? You can find fitness groups in most places. Try joining a local gym for exercise classes. Search online for sports you like to play. You can also look on Meetup for fitness groups that host recreation events in your city. Create your own Meetup group.Get Started Start a new group Your Account Sign up Log in Help Become an Affiliate Discover Groups Calendar Topics Cities Online Events Local Guides Make Friends Meetup About Blog Meetup Pro Careers Apps Podcast Follow us © 2025 MeetupTerms of ServicePrivacy PolicyCookie PolicyLicense AttributionHelp",
      "title": "Make Friends at Sports, Fitness, & Recreation Events on Meetup | Meetup Skip to content Make Friends at Sports, Fitness, & Recreation Events on Meetup Whether you like to hike, run, cycle, or play team sports like soccer and volleyball, there are tons of groups for your interests on Meetup. Join groups to find local events and meet people who share your passion for recreational activities. Join Groups Soccer ▶ Bootcamps & Workouts ▶ Running ▶ Find Sports Groups and Events Find sports groups and events Join groups for your interests, from basketball and volleyball to darts and table tennis. Make friends with people who like what you like. Get better at the sports you enjoy and experience the satisfaction of improving your game. Join sports groups Discover upcoming online fitness events Fitness events and activities are happening all the time on Meetup. Log in to find sports, workouts, classes, and tournaments near you. Discover online events Find sports groups and events Join groups for your interests, from basketball and volleyball to darts and table tennis. Make friends with people who like what you like. Get better at the sports you enjoy and experience the satisfaction of improving your game. Join sports groups Discover upcoming online fitness events Fitness events and activities are happening all the time on Meetup. Log in to find sports, workouts, classes, and tournaments near you. Discover online events Find fitness and sports groups Popular Fitness and Sports Groups Near Me Join a dedicated group of active locals and sports enthusiasts. Make friends who share your interest in living a healthy lifestyle. See Groups ▶ Try something new: discover exciting fitness events near me Basketball ▶ Weight Loss ▶ Cycling ▶ Volleyball ▶ Winter Sports ▶ Upcoming sports and fitness events There are thousands of groups dedicated to sports and fitness on Meetup, with events happening every day. Upcoming online events Find your people Start your own fitness and sports group You don’t need to be an expert to start a thriving fitness group. Host recreation events and meet people who share your interests. Save 30% when you start a new group today! Start a group Being outside in the fresh air, exercising, and having pleasant conversations with wonderful people has made all the difference for me. My [Meetup group’s] weekly hikes have brought a smile to my face and joy to my heart! —Meetup member Stories from Meetup members ### Recording | Meetup 101: Building a Strong Community CultureGet answers to the most common questions about fostering healthy membership relations. ### Five Tips for a Great Meet and Greet EventSo you’ve got a new Meetup group, and you want to kick things off. Make your first event a simple, light, short, and stress-free Meet and Greet. ### Taking It to the Streets: Q&A with Street Art Tour Paris OrganizerIn this interview, Paris-based Meetup organizer and artist Kasia Klon talks about her love for urban artwork and how she decided to use that passion to meet people. ### Recording | Meetup 101: Building a Strong Community CultureGet answers to the most common questions about fostering healthy membership relations. ### Five Tips for a Great Meet and Greet EventSo you’ve got a new Meetup group, and you want to kick things off. Make your first event a simple, light, short, and stress-free Meet and Greet. ### Taking It to the Streets: Q&A with Street Art Tour Paris OrganizerIn this interview, Paris-based Meetup organizer and artist Kasia Klon talks about her love for urban artwork and how she decided to use that passion to meet people. Read More Stories Frequently Asked Questions What are the best sports to try as an adult? The best sport for an adult is one that’s enjoyable! If you want to pick up a sport as an adult, think back to sports you’ve enjoyed playing in the past like soccer, volleyball, football, rugby, or tennis. You can also explore newly popular sports like pickleball, spikeball, or even kayak water polo (yes, it’s a real sport on Meetup!) What are some fun and social fitness activities? Recreational activities are excellent social outings. Having a shared interest makes it easier to spark a friendship. Activities like walking, running, and hiking are great methods for meeting people and having conversations while you exercise. Search for fitness events to meet active locals. Where can I find a fitness group? You can find fitness groups in most places. Try joining a local gym for exercise classes. Search online for sports you like to play. You can also look on Meetup for fitness groups that host recreation events in your city. Create your own Meetup group.Get Started Start a new group Your Account Sign up Log in Help Become an Affiliate Discover Groups Calendar Topics Cities Online Events Local Guides Make Friends Meetup About Blog Meetup Pro Careers Apps Podcast Follow us © 2025 MeetupTerms of ServicePrivacy PolicyCookie PolicyLicense AttributionHelp"
    },
    {
      "url": "https://www.reddit.com/r/LifeProTips/comments/1dl9phe/lpt_join_social_sports_to_make_friends_as_an_adult/",
      "content": "How to make new friends as an adult #### Ryan Hoover WritingTweetingBuilding July 11, 2024 How to make new friends as an adult Try s_ocial sports._ It can be difficult to make friends as an adult, especially in a remote working world. In youth, socialization was a daily part of our routine. We went to school, surrounded by peers. Our parents put us in after school programs, summer camps, and sports leagues with other kids. Then we graduated into the working class, commuting to an office every day. We interacted with our coworkers and business partners, attending post-work happy hours. But now many of us work from home. We can go days without speaking to another human in person. Many of us live semi-nomadic lives, working remotely from different cities throughout the year. And so do our friends. It’s hard to know who’s in town to hang. Then the babies come. It’s more difficult to find time to spend time with friends that have children. Parents have even more responsibilities that eat into their weekends. Impromptu hangs are almost impossible when hiring a sitter is required. It’s easy to live in isolation. We’re more connected online than ever before, yet loneliness is abundant. As much as I love the internet and its ability to bring people together, we’re biologically wired for IRL human connection and many aren’t getting it. So, what’s the solution? Social sports. Or at least, it might help. Social sports are activities you can do with friends or strangers (aka future friends). They’re a Schelling point that minimizes coordination effort, a filter for people with likeminded interests, and an ice breaker for the socially anxious. Examples of social sports Technically nearly every sport could be social, but some are better suited for connecting with others and adaptable to varying skill levels. Here’s a far-from-comprehensive list[1] of social sports: Running Cycling Golf Padel, Tennis, Pickleball Rock Climbing, Bouldering Basketball, Soccer, Baseball Skiing, Snowboarding Surfing Recently I got into rock climbing and bouldering[2], a sport that’s uniquely single and multiplayer. Sometimes I go to the gym solo and end up striking up a conversation with another climber. Climbing culture is very welcoming and positive as people co-conspire strategies for scaling a wall. Sometimes I go with friends. Unlike some sports like golf, climbing is very accessible. If you’ve climbed a tree as a child, you can crush a v0 bouldering Your CTA If you’re feeling isolated, looking for new things to do with friends, or want to meet new people, pickup a social sport. Join a basketball league. Participate in a run club. Organize a Sunday morning cycle crew. Get a membership to a rock climbing gym. Start a padel players group chat for your city. You’re almost guaranteed to make friends and you’ll feel good moving your body.‍ ‍ [1] I’m sure someone is going to be angry that I excluded their favorite sport. To be clear, I’m not attacking your athletic identity. ;) [2] If you’re in Miami or SF and rock climb, let me know! ‍ Read more of my writing here. Join 25k subscribers to get the latest in your inbox: More Writing by Ryan",
      "title": "How to make new friends as an adult #### Ryan Hoover WritingTweetingBuilding July 11, 2024 How to make new friends as an adult Try s_ocial sports._ It can be difficult to make friends as an adult, especially in a remote working world. In youth, socialization was a daily part of our routine. We went to school, surrounded by peers. Our parents put us in after school programs, summer camps, and sports leagues with other kids. Then we graduated into the working class, commuting to an office every day. We interacted with our coworkers and business partners, attending post-work happy hours. But now many of us work from home. We can go days without speaking to another human in person. Many of us live semi-nomadic lives, working remotely from different cities throughout the year. And so do our friends. It’s hard to know who’s in town to hang. Then the babies come. It’s more difficult to find time to spend time with friends that have children. Parents have even more responsibilities that eat into their weekends. Impromptu hangs are almost impossible when hiring a sitter is required. It’s easy to live in isolation. We’re more connected online than ever before, yet loneliness is abundant. As much as I love the internet and its ability to bring people together, we’re biologically wired for IRL human connection and many aren’t getting it. So, what’s the solution? Social sports. Or at least, it might help. Social sports are activities you can do with friends or strangers (aka future friends). They’re a Schelling point that minimizes coordination effort, a filter for people with likeminded interests, and an ice breaker for the socially anxious. Examples of social sports Technically nearly every sport could be social, but some are better suited for connecting with others and adaptable to varying skill levels. Here’s a far-from-comprehensive list[1] of social sports: Running Cycling Golf Padel, Tennis, Pickleball Rock Climbing, Bouldering Basketball, Soccer, Baseball Skiing, Snowboarding Surfing Recently I got into rock climbing and bouldering[2], a sport that’s uniquely single and multiplayer. Sometimes I go to the gym solo and end up striking up a conversation with another climber. Climbing culture is very welcoming and positive as people co-conspire strategies for scaling a wall. Sometimes I go with friends. Unlike some sports like golf, climbing is very accessible. If you’ve climbed a tree as a child, you can crush a v0 bouldering Your CTA If you’re feeling isolated, looking for new things to do with friends, or want to meet new people, pickup a social sport. Join a basketball league. Participate in a run club. Organize a Sunday morning cycle crew. Get a membership to a rock climbing gym. Start a padel players group chat for your city. You’re almost guaranteed to make friends and you’ll feel good moving your body.‍ ‍ [1] I’m sure someone is going to be angry that I excluded their favorite sport. To be clear, I’m not attacking your athletic identity. ;) [2] If you’re in Miami or SF and rock climb, let me know! ‍ Read more of my writing here. Join 25k subscribers to get the latest in your inbox: More Writing by Ryan"
    },
    {
      "url": "https://www.quora.com/Whats-the-secret-to-making-a-few-good-friends-Ive-played-sports-taken-classes-and-socialized-with-co-workers-but-still-dont-have-any-friends-How-do-I-hang-out-like-normal-people",
      "content": "Published Time: 2025-01-21T17:36:53.710Z 25 Unique Ways To Find New Friends in 2025 top of page Home Podcast About Success Stories Download App Sermons Contact Press Legal Cookie Policy Community Guidelines Español FAQ Privacy Policy Safety Tips Security Terms of Use Members More Use tab to navigate through the menu items. All Posts Search 25 Unique Ways To Find New Friends in 2025 Let’s make 2025 the year we find new friends! You in? It will take some effort and confidence — you’ll have to be willing to get uncomfortable, but it’s worth it … promise. Whether you're a social butterfly or shy around new people, there are creative and meaningful ways to meet friends this year. After all, the Bible reminds us, \"Two are better than one, because they have a good return for their labor\" (Ecclesiastes 4:9). Here are 25 unique ways to grow your circle of friends. 1. Volunteer for a Local Church Project Offer your time to organize events, decorate for gatherings, or help in outreach programs. Not only will you meet like-minded individuals, but you’ll also feel great giving back. Be open to conversations while you work together — people often bond over shared purpose. 2. Start a “Walk and Pray” Group Invite neighbors to walk around and pray for your community. This is a great way to connect on a spiritual level while enjoying fresh air and exercise. Over time, these walks can turn into deep friendships grounded in faith. 3. Host a “Board Game Revival” Night Dust off those games and invite people over for fun and nostalgia — it’s a great icebreaker! Laughter and friendly competition naturally bring folks closer. Plus, you can tailor the night to include games that encourage teamwork. 4. Teach Yourself a New Skill … with Strangers Instead of solo learning, join a pottery or cooking class. Everyone feels a little awkward when trying something new, so breaking down walls is easy. You’ll have plenty to talk about and share as you master a new skill together. 5. Be a Mentor to Someone Younger Connect with teens or younger adults who need guidance. You can offer them advice and encouragement; often, they’ll teach you a thing or two in return! Building relationships across generations is rewarding and meaningful for both sides. (You might flip the switch and ask someone older to be your mentor, too!) 6. Bring Cookies to New Neighbors Who says this is outdated? Baking something sweet and delivering it to neighbors, new and old, is a simple, thoughtful gesture. You never know — it could lead to coffee invites, shared meals, and lasting friendships. 7. Try a “No Phones” Coffee Hangout Suggest meeting new friends where phones are off-limits. You’ll be surprised by how much you learn about each other without distractions. Encourage open and meaningful conversations over your favorite drinks. 8. Use an App To Find Friends Sometimes, technology can help you meet the right people. Take Upward, for example! Traditionally a dating app, now you can use it to find Christian friends, too! By focusing on shared values and faith, it’s a great way to find people who are looking for similar meaningful relationships. 9. Plant a Garden With Your Community Get your hands dirty and work together to grow something beautiful and lasting. Whether it’s vegetables or flowers, the process encourages teamwork. Plus, you can share stories while you dig, plant, and water. 10. Make the First Move at Church If you’re waiting for someone to approach you, flip the script! Say hello to someone sitting alone. Breaking the ice is often all it takes, and you might make someone else feel welcomed and seen. Remember, \"Do to others as you would have them do to you\" (Luke 6:31). 11. Launch a DIY Club Try posting an invite on social media for people who want to create homemade crafts. Hands-on projects spark conversations and laughter. From making candles to painting, you’ll bond over shared creativity. 12. Attend a Worship Festival, Music Camp, or Retreat These events bring like-minded people together through shared faith and fun. Singing, laughing, and learning together makes it easy to find people you click with. Plus, you’ll leave inspired and spiritually recharged. 13. Join a “Pet Playdate” Meetup If you have a dog, find a playgroup. Pets are amazing conversation starters! While your furry friends mingle, you can connect with others who share your love for animals. 14. Join a Local Sports Team or Club Sports are a classic way to meet people and find new friends! Whether it’s a casual kickball league or a tennis club, playing with teammates helps you bond quickly. Even if you’re not super athletic, cheering each other on creates a fun and supportive environment. 15. Co-Host a Neighborhood Clean-Up Be the person who inspires others to make your area cleaner. Get people involved and chat while you pick up litter. A shared goal builds unity and pride in your community. 16. Create a Bookshelf Swapping Spot Put up a “Take a Book, Leave a Book” shelf and partner with others to maintain it. This idea can attract people who love books, sparking conversations over your favorite stories. You’ll feel good sharing and discovering new literature. You can set it up in your neighborhood or at your church or local coffee shop. 17. Attend Community Events or Festivals Your town’s events are full of opportunities to find new friends! Whether it’s a farmer’s market, a concert, or a holiday festival, you’ll find people who enjoy the same things you do. A quick “hello” to someone at the next booth could spark a new friendship. 18. Be a Babysitter-for-a-Day Offer free babysitting for tired parents at church. They’ll remember your kindness and perhaps invite you into their family circle. Plus, kids are great at breaking the ice — just ask them to tell you a silly joke! 19. Participate in Online Bible Study Communities Even from home, you can find rich connections in faith-filled groups online. Look for communities with active discussions and genuine fellowship. You might find people you’ll eventually meet in person. 20. Host a Vision Board Party Invite people to create vision boards with their goals for the year — faith and personal. Sharing hopes and dreams can spark meaningful, vulnerable conversations. Encourage each other to chase those dreams! 21. Start a Hike and Devotion Club Take weekly nature walks where you reflect on scripture together. Being outdoors helps you connect with God while strengthening friendships. Walking and talking allows conversations to flow naturally. 22. Learn To Make Cultural Recipes Together Ask people in your community to share family recipes and cook together. Food always brings people closer, especially when you can share a delicious meal afterward. Plus, you’ll get a taste of their culture — literally! 23. Run an Encourage-athon on Social Media Tag others and leave uplifting comments throughout the day. Ending negativity online can inspire real-life connections. The kind person you support might just reach out to thank you. 24. Spend Time at a Library or Coffee Shop These cozy spots are a great place to find new friends at a relaxed pace. Strike up a conversation with someone over the book they’re reading or ask for a coffee recommendation. Sometimes, a simple chat grows into something meaningful. 25. Pray for Someone and Tell Them You can’t beat this one — reach out to someone, tell them you’re praying for them, and watch your connection grow. This simple gesture shows care and consideration that builds trust, which is the foundation of a long-lasting friendship. Friendship doesn’t have to be complicated. Take the first step, trust God, and watch amazing relationships blossom! Recent Posts See All Tips for Surviving a Long-Distance Friendship What To Write on Your Friendship App Profile How To Get Better at Forgiveness in Dating Upward Copyright © 2024 Affinity Apps All Rights Reserved contactus@support.upward-app.com bottom of page",
      "title": "Published Time: 2025-01-21T17:36:53.710Z 25 Unique Ways To Find New Friends in 2025 top of page Home Podcast About Success Stories Download App Sermons Contact Press Legal Cookie Policy Community Guidelines Español FAQ Privacy Policy Safety Tips Security Terms of Use Members More Use tab to navigate through the menu items. All Posts Search 25 Unique Ways To Find New Friends in 2025 Let’s make 2025 the year we find new friends! You in? It will take some effort and confidence — you’ll have to be willing to get uncomfortable, but it’s worth it … promise. Whether you're a social butterfly or shy around new people, there are creative and meaningful ways to meet friends this year. After all, the Bible reminds us, \"Two are better than one, because they have a good return for their labor\" (Ecclesiastes 4:9). Here are 25 unique ways to grow your circle of friends. 1. Volunteer for a Local Church Project Offer your time to organize events, decorate for gatherings, or help in outreach programs. Not only will you meet like-minded individuals, but you’ll also feel great giving back. Be open to conversations while you work together — people often bond over shared purpose. 2. Start a “Walk and Pray” Group Invite neighbors to walk around and pray for your community. This is a great way to connect on a spiritual level while enjoying fresh air and exercise. Over time, these walks can turn into deep friendships grounded in faith. 3. Host a “Board Game Revival” Night Dust off those games and invite people over for fun and nostalgia — it’s a great icebreaker! Laughter and friendly competition naturally bring folks closer. Plus, you can tailor the night to include games that encourage teamwork. 4. Teach Yourself a New Skill … with Strangers Instead of solo learning, join a pottery or cooking class. Everyone feels a little awkward when trying something new, so breaking down walls is easy. You’ll have plenty to talk about and share as you master a new skill together. 5. Be a Mentor to Someone Younger Connect with teens or younger adults who need guidance. You can offer them advice and encouragement; often, they’ll teach you a thing or two in return! Building relationships across generations is rewarding and meaningful for both sides. (You might flip the switch and ask someone older to be your mentor, too!) 6. Bring Cookies to New Neighbors Who says this is outdated? Baking something sweet and delivering it to neighbors, new and old, is a simple, thoughtful gesture. You never know — it could lead to coffee invites, shared meals, and lasting friendships. 7. Try a “No Phones” Coffee Hangout Suggest meeting new friends where phones are off-limits. You’ll be surprised by how much you learn about each other without distractions. Encourage open and meaningful conversations over your favorite drinks. 8. Use an App To Find Friends Sometimes, technology can help you meet the right people. Take Upward, for example! Traditionally a dating app, now you can use it to find Christian friends, too! By focusing on shared values and faith, it’s a great way to find people who are looking for similar meaningful relationships. 9. Plant a Garden With Your Community Get your hands dirty and work together to grow something beautiful and lasting. Whether it’s vegetables or flowers, the process encourages teamwork. Plus, you can share stories while you dig, plant, and water. 10. Make the First Move at Church If you’re waiting for someone to approach you, flip the script! Say hello to someone sitting alone. Breaking the ice is often all it takes, and you might make someone else feel welcomed and seen. Remember, \"Do to others as you would have them do to you\" (Luke 6:31). 11. Launch a DIY Club Try posting an invite on social media for people who want to create homemade crafts. Hands-on projects spark conversations and laughter. From making candles to painting, you’ll bond over shared creativity. 12. Attend a Worship Festival, Music Camp, or Retreat These events bring like-minded people together through shared faith and fun. Singing, laughing, and learning together makes it easy to find people you click with. Plus, you’ll leave inspired and spiritually recharged. 13. Join a “Pet Playdate” Meetup If you have a dog, find a playgroup. Pets are amazing conversation starters! While your furry friends mingle, you can connect with others who share your love for animals. 14. Join a Local Sports Team or Club Sports are a classic way to meet people and find new friends! Whether it’s a casual kickball league or a tennis club, playing with teammates helps you bond quickly. Even if you’re not super athletic, cheering each other on creates a fun and supportive environment. 15. Co-Host a Neighborhood Clean-Up Be the person who inspires others to make your area cleaner. Get people involved and chat while you pick up litter. A shared goal builds unity and pride in your community. 16. Create a Bookshelf Swapping Spot Put up a “Take a Book, Leave a Book” shelf and partner with others to maintain it. This idea can attract people who love books, sparking conversations over your favorite stories. You’ll feel good sharing and discovering new literature. You can set it up in your neighborhood or at your church or local coffee shop. 17. Attend Community Events or Festivals Your town’s events are full of opportunities to find new friends! Whether it’s a farmer’s market, a concert, or a holiday festival, you’ll find people who enjoy the same things you do. A quick “hello” to someone at the next booth could spark a new friendship. 18. Be a Babysitter-for-a-Day Offer free babysitting for tired parents at church. They’ll remember your kindness and perhaps invite you into their family circle. Plus, kids are great at breaking the ice — just ask them to tell you a silly joke! 19. Participate in Online Bible Study Communities Even from home, you can find rich connections in faith-filled groups online. Look for communities with active discussions and genuine fellowship. You might find people you’ll eventually meet in person. 20. Host a Vision Board Party Invite people to create vision boards with their goals for the year — faith and personal. Sharing hopes and dreams can spark meaningful, vulnerable conversations. Encourage each other to chase those dreams! 21. Start a Hike and Devotion Club Take weekly nature walks where you reflect on scripture together. Being outdoors helps you connect with God while strengthening friendships. Walking and talking allows conversations to flow naturally. 22. Learn To Make Cultural Recipes Together Ask people in your community to share family recipes and cook together. Food always brings people closer, especially when you can share a delicious meal afterward. Plus, you’ll get a taste of their culture — literally! 23. Run an Encourage-athon on Social Media Tag others and leave uplifting comments throughout the day. Ending negativity online can inspire real-life connections. The kind person you support might just reach out to thank you. 24. Spend Time at a Library or Coffee Shop These cozy spots are a great place to find new friends at a relaxed pace. Strike up a conversation with someone over the book they’re reading or ask for a coffee recommendation. Sometimes, a simple chat grows into something meaningful. 25. Pray for Someone and Tell Them You can’t beat this one — reach out to someone, tell them you’re praying for them, and watch your connection grow. This simple gesture shows care and consideration that builds trust, which is the foundation of a long-lasting friendship. Friendship doesn’t have to be complicated. Take the first step, trust God, and watch amazing relationships blossom! Recent Posts See All Tips for Surviving a Long-Distance Friendship What To Write on Your Friendship App Profile How To Get Better at Forgiveness in Dating Upward Copyright © 2024 Affinity Apps All Rights Reserved contactus@support.upward-app.com bottom of page"
    }
  ],
  "researchSummary": "Published Time: 2025-03-03T05:30:00Z WHAT’S ON: A list of PQB community events, week of March 3, 2025 - Parksville Qualicum Beach News Skip to content × Play Newsletter Signup Are you a FREE member? Login to your free account to access special features, including newsletters.Sign In Support Local News Subscribe today & join a community of passionate readers who believe in our journalists and meaningful storytelling.Subscribe Now Create a Free Account Contact Us News Local News Newsletters Subscribe BC National World News Entertainment Sports Business Trending Now Opinion Submit News Tips Nanaimo News Bulletin Cowichan Valley Citizen Ladysmith Chronicle Chemainus Valley Courier Tofino-Ucluelet Westerly News Vancouver Island Free Daily Neighbours Nanaimo News Bulletin Cowichan Valley Citizen Lake Cowichan Gazette Chemainus Valley Courier Ladysmith Chronicle Tofino-Ucluelet Westerly News Vancouver Island Free Daily Newsletters E-Editions Public Notices Obituaries Obituaries Celebrations of Life Funeral Care Services In Memory Place an Obituary Community Our Community Event Calendar Lost & Found Pets Do Some Good Good News Life Local Travel More Good News Our Community Public Notices Video Photo Galleries Travel West Coast Traveller Cannabis Today's Home Podcasts Food Life Puzzles Contact Us Contests Puzzles Contests Shop Impress Stories Savvy Shopper Real Estate Impress TV The Business Directory Add Your Business Flyers E-Editions Classifieds All Classifieds Autos Driver’s Seat Garage Talk Jobs Local Work Obituaries Celebrations of Life Funeral Care Services In Memory Place an Obituary Weather Contact Us About Us Contact Information Our Team Black Press Media Search Type Site Search Home Community WHAT’S ON: A list of PQB community events, week of March 3, 2025 Send your event listings to editor@pqbnews.com Philip Wolf Mar 2, 2025 9:30 PM Share by Email Share on Facebook Share on X Share on LinkedIn Print Share via Text Message (PQB News file) Listen to this article 00",
  "coreTopic": "The main topic revolves around community events and local news in the Parksville Qualicum Beach area for the week of March 3, 2025. It highlights the importance of community engagement and local storytelling through various events and publications.",
  "brandInfo": "\n        Website: https://playpickups.app/\n        Brand: playpickups\n        Products: No product images\n        Description: Besides work, you're not able to socialise much. Maybe you'd like to play tennis over the weekend but don't have a consistent group of players to play with.\n\n\n        Documents: No documents\n        Logo: No logo\n        Posts/Videos: No posts/videos\n        Taglines: None\n        Colours: 016DE5\n        Country: global\n      ",
  "youtubeVideo": null,
  "internalLinks": [
    "/blog/tips-for-growth",
    "/resources/ecommerce-guide"
  ],
  "references": [
    "https://playpickups.app/",
    "https://www.pqbnews.com/community/whats-on-a-list-of-pqb-community-events-week-of-march-3-2025-7849420",
    "https://www.palmcoast.gov/events",
    "https://clubwaka.com/locations/hartford/",
    "https://oceancommunityymca.org/wp-content/uploads/2025/02/Spring-2025-Program-Guide-9.pdf",
    "https://www.brawleyhigh.org/article/2060720",
    "https://www.meetup.com/lp/sports-fitness/",
    "https://www.reddit.com/r/LifeProTips/comments/1dl9phe/lpt_join_social_sports_to_make_friends_as_an_adult/",
    "https://www.quora.com/Whats-the-secret-to-making-a-few-good-friends-Ive-played-sports-taken-classes-and-socialized-with-co-workers-but-still-dont-have-any-friends-How-do-I-hang-out-like-normal-people"
  ],
  "existingPosts": "Unite Through the Game: Transform Loneliness into Lasting FriendshipsEngaging in sports activities is not just about physical fitness; it's a dynamic way to build friendships and forge social connections. Whether you are a newcomer in a city, a student venturing into university life, or simply someone looking to meet like-minded individuals, sports can be the bridge to meaningful relationships. Let us explore how team sports cultivate trust, collaboration, and shared interests among individuals, and offer practical strategies for creating friendships through these activities.The Social Benefits of SportsSports have a unique ability to bring people together, transcending barriers of age, background, and interests. When individuals engage in team sports, they develop bonds that can lead to lasting friendships. This is how sports serve as a foundation for social connections:Trust Building: Playing on a team necessitates trust among members as they work together towards a common goal. This shared experience fosters deeper connections.Collaboration: Team sports require cooperation and collaboration, which are essential skills in both sports and life. Through working together, players learn to rely on each other, creating a sense of belonging.Shared Interests: Engaging in sports often reflects similar interests and passions. This commonality makes it easier to initiate conversations and develop friendships.Practical Strategies for Building Friendships through SportsHow can we leverage sports to build those essential friendships? Here are actionable strategies:Coach a Newbie Over BrunchIf you enjoy a particular sport, consider inviting someone new to join you. This can be a casual brunch where you introduce them to the basics of the sport you love. Not only do you get to share your passion, but you also offer them a supportive entry into a new activity.Select a relaxed and friendly setting for brunch where discussions can flow easily.Offer to coach them in a friendly manne",
  "targetKeywords": [],
  "timestamp": "2025-03-03",
  "nudge": "h3n1g"
}