{
  "initialUrl": "https://playpickups.app/",
  "initialResearchSummary": "‎Play Pickups on the App Store Apple Store Mac iPad iPhone Watch Vision AirPods TV & Home Entertainment Accessories Support 0+ App Store Preview Play Pickups 4+ Play Sports with New Friends‪!‬ Kush Desai Free iPhone Screenshots Description Play Pickups - Connect, Socialise & Play Sports with New Friends! Say goodbye to boring meet-ups and hello to thrilling sports connections! Play Pickups: Your Ultimate Social Sports Networking App Play Pickups is the go-to app for sports lovers looking to make meaningful connections through sports. We’re dedicated to helping you meet new people, discover local games, and get out there to play – all for free! Take a break from typical social settings and make new friends on the field, court, or pitch. Whether you’ve just moved to a new city, started university, or simply don’t have friends who play your favourite sport, Play Pickups is here to bridge that gap. Get ready to discover, connect, and play with like-minded sports enthusiasts who share your passion for sports. With over 20 different sports to choose from, Play Pickups takes socialising to the turfs and courts for a healthier, more exciting way to meet new people! Key Features: - Instantly Connect with Nearby Players: Find people around you who share your love for sports and want to play right now! With our location-based technology, you can easily meet players with similar skill levels who are ready to hit the courts or fields. - Discover Local Pick-Up Games & Events: Explore and join local pick-up games, tournaments, and events happening nearby. It’s easy to RSVP, check event details, and join in the fun with just a few taps. - Create or Join Sports Groups: Build your community of sports buddies by joining or creating groups based on your favourite sport, skill level, or location. Stay connected and organised with notifications for upcoming games and events. - Personalised Match Suggestions: Get customised suggestions on players, events, and groups that align with your interests and skill level. Never miss a chance to play and meet new people! - Integrated Messaging & Scheduling: Chat with other players, set up games, and manage your schedule – all within the app. You’ll never need to switch apps to make plans again! - Play Over 20 Sports: From popular sports like Football (Soccer), Tennis, and Cricket to unique options like Pickleball, Padel, and Flag Football, there’s something for everyone on Play Pickups. Plus, we even cater to indoor games like Chess and Poker for all-around fun! Who Should Use Play Pickups? - New Residents: Just moved for work? Don’t know where to start meeting people? Play Pickups connects you with locals who love your favourite sports, making it easy to break the ice and build new friendships. - University/College Students: Connect with fellow students who love the same sports, or explore new sports with new friends. Your campus experience just got more exciting! - Social Sports Enthusiasts: Looking for a healthier way to socialise? Join the community that’s taking fun beyond bars and cafes and onto the field. Playing sports together is a great way to make lasting connections! Why Choose Play Pickups? Play Pickups is completely free to join and free to use. We believe in bringing people together through sports, making it easy to find your community, get active, and have fun. Unlike other social apps, we prioritise connections based on shared interests, skill levels, and location, so you can experience a whole new way of socialising. Download Play Pickups today and start connecting with people who share your love for sports! --- Technical Details: - Category: Sports, Social Networking - Age Rating: Suitable for all ages - Price: Free - Languages: English (more languages coming soon) Join the Play Pickups community now and discover the healthier, more exciting way to socialise! App Privacy The developer, Kush Desai, indicated that the app’s privacy practices may include handling of data as described below. For more information, see the developer’s privacy policy. Data Linked to You The following data may be collected and linked to your identity: Contact Info User Content Identifiers Data Not Linked to You The following data may be collected but it is not linked to your identity: Usage Data Diagnostics Privacy practices may vary, for example, based on the features you use or your age. Learn More Information Seller Kush Desai Size 8.6 MB Category Sports Compatibility iPhone Requires iOS 13.0 or later. iPod touch Requires iOS 13.0 or later. Languages English Age Rating 4+ Copyright © Kush Desai Price Free Developer Website App Support Privacy Policy Developer Website App Support Privacy Policy You Might Also Like Pi-Play:Play Padel, Pickleball Sports Hockey Community Sports FIFA Player App Sports Scores App for Pro Basketball Sports Scores and Odds Sports Betting Sports TNNS: Tennis Live Scores Sports Copyright © 2025 Apple Inc. All rights reserved. Internet Service Terms App Store & Privacy Cookie Warning Support More ways to shop: Find an Apple Store or other retailer near you. Or call 1-800-MY-APPLE. Choose your country or region Copyright © 2024 Apple Inc. All rights reserved. Privacy Policy Terms of Use Sales and Refunds Legal Site Map",
  "researchResults": [
    {
      "url": "https://eventpipe.com/blog/team-building-activities-youth-sports",
      "content": "Published Time: 2023-11-28T14:15:00.000Z 20 Great Team-Building Activities for Youth Sports [2024] Home Product About Us Resources News Blog Case Studies Request Demo Manage Reservations Login blog 20 Great Team-Building Activities for Youth Sports [2024] Jeff Porter | November 28, 2023 Table Of Contents At EventPipe, we know sports are much more than just games and competitions. They are a great opportunity to foster teamwork, unity, and personal growth. While we specialize in event housing management for sports tournaments and other events, we firmly believe that team camaraderie can play a significant role in the fantastic experience we aim to provide. Creating a unified team requires more than just practice, skill drills, endurance training and in-game experience. At the end of the day, it's important to include team-building activities that extend beyond the playing field. Such activities play an essential role in helping young athletes understand the value of collaboration, effective communication, mutual respect, and trust–all of which are integral to successful team dynamics. Every team is unique, but the goal to create an environment that nurtures growth, encourages positive interactions and ultimately drives team performance is universally the same. Let's dive in and start fostering the team spirit that every youth sports team needs to succeed. Why Team Building Activities Matter By participating in youth sports, children and young adolescents aren’t just playing a game! They’re developing physically, mentally, and socially while learning critical life skills and values. Improved Communication Team-building activities encourage open communication and better understanding among participants. They make it easier for individuals to express their thoughts, listen to others, and give and receive feedback, thus improving interactions within the team. Fun & Positive Team Culture Team-building activities also serve as a powerful tool for cultivating a fun and positively engaged team culture. They foster an atmosphere of shared enjoyment, collaboration, and achievement by encouraging participants to work together towards a common goal. Building Leadership Skills Sometimes getting leaders to emerge from their shells isn’t always easy. Team building activities help identify potential leaders. Through the activities, they reveal important skills like decision-making, taking initiative, motivating the team, delegating priorities and coordinating with others. Encouraging Sportsmanship Learning sportsmanship is key to the development of a well-rounded athlete, and team-building activities help them develop fundamental skills in this area. Some of these include respect for others, fair play, winning and losing gracefully, team spirit, healthy competition and good conduct. Fun Team-Building Activities for Youth Sports Here are some tried-and-tested activities that will bring your team together. These activities are especially a great option for traveling sports teams since there can be a lot of time to fill outside games and practices. 1. Relay Race Races work for all teams, whether on the ice, in the pool, in the arena or on the field. Modify them to be more interesting and challenging to your group. Some variations include obstacle relays, three-legged races or reverse races. Source 2. Silent Line-Up This is a great challenge to start other activities. It involves the group lining themselves up in order of established criteria–shortest to tallest, youngest to oldest, in alphabetical name order–without talking. This exercise develops nonverbal communication and teamwork. 3. Obstacle Course Design your obstacle course to suit your group with each obstacle presenting a unique problem to solve. Team members must quickly brainstorm, deliberate, and decide on a solution, engaging their minds and working together toward common goals. Source 4. Scavenger Hunt Individuals or teams compete to find items or complete tasks from a pre-prepared list within a certain timeframe. The game can take place in a defined area like a gym or park or could encompass a larger area like an entire city or town. This activity encourages critical thinking and teamwork. 5. Team Conditioning Kids rarely enjoy conditioning exercises, but they’re key to becoming better athletes. Make drills and exercises more enjoyable by getting the team to do them together. Team conditioning allows members to support and push each other, even engaging in healthy competition to improve team dynamics and cohesion. 6. Tug-o-War A classic game that tests strength, stamina, and team cooperation. It builds unity as teams have to work together to succeed. Split the teams into even groups, and establish a center line on the ground using a field marker, drawn line, or cone. Mark the center of the rope with a ribbon or bandana. Whoever pulls the rope over to their team line first, wins. Source 7. Human Knot Players form a circle, cross their arms in front of themselves, and hold the hands of two different people, creating a 'knot'. The task is to unravel the knot without breaking the chain, promoting problem-solving skills and collaboration. 8. Hot Potato This one’s especially fun for younger children. The team forms a circle and quickly passes around a ball or other object that is the “hot potato.” Music plays as the potato makes its way around the circle. When the music stops, whoever is holding the potato is out! As the gaps between players grow wider, the game becomes more challenging, promoting quick thinking and physical coordination. 9. Snowball Fight This classic winter game is fun for all ages and works with any size group, particularly those involved in winter sports, like hockey, basketball, and swimming. Playing in teams develops teamwork, communication, and problem-solving skills, and it helps build trust and improves morale. Organizers have the option to make the game as structured as they’d like by adding set guidelines on how you determine which team wins. Prefer a different snow sport? Try a day of sledding or have your team work together to build snow forts. Source 10. Blind Obstacle Course This trust exercise works best in pairs or small teams. Put a blindfold on one player, and their partner or team must guide them through an obstacle course, using only verbal instructions. It encourages active listening and improves trust and communication. 11. All Tied Up In this game, players break into pairs and tie their wrists together (similar to tying legs together in a three-legged race). Then, they must complete an obstacle course together. Through the exercise, players must communicate effectively, problem-solve, and work together to overcome the given challenges. 12. Hula Hoop Challenge Have your group stand in a line or circle holding hands. The goal is to pass the hula hoop down the line or around the circle over their bodies without breaking the chain. This exercise requires trust and coordinated efforts, which can foster unity, communication, and a strong sense of team synergy. Source 13. Charades Charades is a classic game in which players must act out a word or phrase without speaking, while their team tries to guess what it is within a certain time frame. By playing charades, participants improve their non-verbal communication skills and enhance their problem-solving abilities. 14. Team Dinner Social gatherings such as team dinners provide a relaxed setting for players to build relationships organically. Conversations around team successes and opportunities for improvement help boost morale, a sense of belonging, and motivation. 15. Escape Room Challenge An Escape Room Challenge is a game where a team of players cooperatively discover clues, solve puzzles, and accomplish tasks in one or more rooms to progress and ultimately escape within a set time limit. The challenges are lots of fun and encourage communication, collaboration, and problem-solving under pressure. 16. Paintball Paintball is a team sport that involves players eliminating opponents by tagging them with paintballs. This fun activity encourages cooperative strategy and teamwork under pressure, but for safety reasons, works best for older students (high schoolers). 17. Capture the Flag Capture the Flag is a traditional outdoor game where two or more teams each have a flag (or a similar object) and the objective is to capture the other team's flag, located at the team's \"base,\" and bring it safely back to their base. The game gets team members interacting and cooperating in ways that can translate into improved team dynamics. Source 18. Attend a Sporting Event An outing to a local sports game provides a great opportunity for team building in a relaxed, fun environment outside the usual context of training and matches. Opt to watch an event completely unrelated to your own or choose a professional version of your sport. Allow your team to comment on the game or match and discuss their impressions and observations. This helps them develop a deeper understanding of the game. 19. Group Volunteering for Charity Not all team building needs to have a direct connection to sports. Working together to serve the community can deepen connections between team members. Consider volunteering for local events, organizing a donation drive, or offering a hockey clinic for younger players. 20. Fundraise for the Team Another way to deepen the bond between your team is to have them organize a fundraiser, whether it benefits the team itself or another community organization. Car wash drive, anyone? The feeling of satisfaction and fulfillment they’ll receive after working together to reach their goals is priceless. Not to mention the fun they had getting there! Source More About Team Building Activities for Youth Sports Source Outdoor Team-Building Activities for Youth Sports Team-Building Here are some great team-building activity options to do outside: Relay race Obstacle course Silent line-up Scavenger hunt Team conditioning Tug-o-war Human knot Hot potato Blind obstacle course Hula hoop challenge Capture the flag Paintball Attend a sporting event Team Building Games for Youth Sports With No Equipment Here are some options if you don’t have any equipment on hand: Silent line-up Team conditioning Human knot Charades Indoor Team Building Games for Youth Sports These games are great for indoors: Escape room challenges Charades Team dinner Group volunteering for charity Streamline Your Next Youth Sports Tournament No matter which activities you choose, the best team-building activities depend on your team's dynamic, age range, and interests. Be sure to choose exercises that will be fun and beneficial for everyone involved. And if you need help with any of your sports tournament housing, put EventPipe on your team. EventPipe is a comprehensive event housing management software designed to revolutionize how you manage accommodations for your events. From sports events to corporate events, festivals, concerts, and weddings, EventPipe's end-to-end solution streamlines the booking process, boosts financial performance, and takes the hassle out of housing management for both producers and attendees. Branded website using EventPipe event housing management software. Here are some of our key features: Hotels Access: Gain access to tens of thousands of hotels to locate the perfect accommodations for your event attendees. Customizable Booking Site: Build an event-exclusive, branded site displaying your logo and imagery in less than 10 minutes. No coding is required! Additional Revenue Streams: Monetize your event housing management process through advertisements and optional amenities on your unique branded site. Group Block Management: Manage room block bookings with ease. Choose multiple hotels and room types, appoint a group block manager, view live inventory, and share booking instructions with attendees via link-sharing. Streamlined RFP Process: Simplify the RFP process with our easy-to-use interface. Request specific nights, room types, concessions, and complimentary rooms while being able to select, negotiate, and accept proposals directly from your account. Simplified Booking Experience for Attendees: EventPipe offers a user-friendly, mobile-optimized booking site. Attendees can view, manage, and track reservations, even opting to join a waitlist for fully booked hotels. Data Reporting & Analytics: Utilize our advanced Report Center for real-time insights. Track financial performance, pickup rates, hotel cut-off dates, and confirmation statuses for all your events. Ready to revolutionize your event housing management? Author Posts Jeff Porter Jeff is the Marketing Manager at EventPipe. He brings almost a decade of Marketing experience with a background in social media, events, SEO and content. Outside of work, Jeff is an independent Hip Hop artist who regularly releases and performs his music and loves to golf and play ice hockey in his spare time. Recent Posts by Jeff Porter: A Guide to Hotel Booking Software for Sports Housing Companies How to Create a Budget Plan for a Youth Sports Program How to Apply for Youth Sports Grants [2024 Guide] See more Ready to better manage and monetize hotel bookings in 2025? Chat with our team today. Request Demo For details on how we use your information please see our Privacy Policy. © 2025 EventPipe™, Inc. All rights reserved.",
      "title": "Published Time: 2023-11-28T14:15:00.000Z 20 Great Team-Building Activities for Youth Sports [2024] Home Product About Us Resources News Blog Case Studies Request Demo Manage Reservations Login blog 20 Great Team-Building Activities for Youth Sports [2024] Jeff Porter | November 28, 2023 Table Of Contents At EventPipe, we know sports are much more than just games and competitions. They are a great opportunity to foster teamwork, unity, and personal growth. While we specialize in event housing management for sports tournaments and other events, we firmly believe that team camaraderie can play a significant role in the fantastic experience we aim to provide. Creating a unified team requires more than just practice, skill drills, endurance training and in-game experience. At the end of the day, it's important to include team-building activities that extend beyond the playing field. Such activities play an essential role in helping young athletes understand the value of collaboration, effective communication, mutual respect, and trust–all of which are integral to successful team dynamics. Every team is unique, but the goal to create an environment that nurtures growth, encourages positive interactions and ultimately drives team performance is universally the same. Let's dive in and start fostering the team spirit that every youth sports team needs to succeed. Why Team Building Activities Matter By participating in youth sports, children and young adolescents aren’t just playing a game! They’re developing physically, mentally, and socially while learning critical life skills and values. Improved Communication Team-building activities encourage open communication and better understanding among participants. They make it easier for individuals to express their thoughts, listen to others, and give and receive feedback, thus improving interactions within the team. Fun & Positive Team Culture Team-building activities also serve as a powerful tool for cultivating a fun and positively engaged team culture. They foster an atmosphere of shared enjoyment, collaboration, and achievement by encouraging participants to work together towards a common goal. Building Leadership Skills Sometimes getting leaders to emerge from their shells isn’t always easy. Team building activities help identify potential leaders. Through the activities, they reveal important skills like decision-making, taking initiative, motivating the team, delegating priorities and coordinating with others. Encouraging Sportsmanship Learning sportsmanship is key to the development of a well-rounded athlete, and team-building activities help them develop fundamental skills in this area. Some of these include respect for others, fair play, winning and losing gracefully, team spirit, healthy competition and good conduct. Fun Team-Building Activities for Youth Sports Here are some tried-and-tested activities that will bring your team together. These activities are especially a great option for traveling sports teams since there can be a lot of time to fill outside games and practices. 1. Relay Race Races work for all teams, whether on the ice, in the pool, in the arena or on the field. Modify them to be more interesting and challenging to your group. Some variations include obstacle relays, three-legged races or reverse races. Source 2. Silent Line-Up This is a great challenge to start other activities. It involves the group lining themselves up in order of established criteria–shortest to tallest, youngest to oldest, in alphabetical name order–without talking. This exercise develops nonverbal communication and teamwork. 3. Obstacle Course Design your obstacle course to suit your group with each obstacle presenting a unique problem to solve. Team members must quickly brainstorm, deliberate, and decide on a solution, engaging their minds and working together toward common goals. Source 4. Scavenger Hunt Individuals or teams compete to find items or complete tasks from a pre-prepared list within a certain timeframe. The game can take place in a defined area like a gym or park or could encompass a larger area like an entire city or town. This activity encourages critical thinking and teamwork. 5. Team Conditioning Kids rarely enjoy conditioning exercises, but they’re key to becoming better athletes. Make drills and exercises more enjoyable by getting the team to do them together. Team conditioning allows members to support and push each other, even engaging in healthy competition to improve team dynamics and cohesion. 6. Tug-o-War A classic game that tests strength, stamina, and team cooperation. It builds unity as teams have to work together to succeed. Split the teams into even groups, and establish a center line on the ground using a field marker, drawn line, or cone. Mark the center of the rope with a ribbon or bandana. Whoever pulls the rope over to their team line first, wins. Source 7. Human Knot Players form a circle, cross their arms in front of themselves, and hold the hands of two different people, creating a 'knot'. The task is to unravel the knot without breaking the chain, promoting problem-solving skills and collaboration. 8. Hot Potato This one’s especially fun for younger children. The team forms a circle and quickly passes around a ball or other object that is the “hot potato.” Music plays as the potato makes its way around the circle. When the music stops, whoever is holding the potato is out! As the gaps between players grow wider, the game becomes more challenging, promoting quick thinking and physical coordination. 9. Snowball Fight This classic winter game is fun for all ages and works with any size group, particularly those involved in winter sports, like hockey, basketball, and swimming. Playing in teams develops teamwork, communication, and problem-solving skills, and it helps build trust and improves morale. Organizers have the option to make the game as structured as they’d like by adding set guidelines on how you determine which team wins. Prefer a different snow sport? Try a day of sledding or have your team work together to build snow forts. Source 10. Blind Obstacle Course This trust exercise works best in pairs or small teams. Put a blindfold on one player, and their partner or team must guide them through an obstacle course, using only verbal instructions. It encourages active listening and improves trust and communication. 11. All Tied Up In this game, players break into pairs and tie their wrists together (similar to tying legs together in a three-legged race). Then, they must complete an obstacle course together. Through the exercise, players must communicate effectively, problem-solve, and work together to overcome the given challenges. 12. Hula Hoop Challenge Have your group stand in a line or circle holding hands. The goal is to pass the hula hoop down the line or around the circle over their bodies without breaking the chain. This exercise requires trust and coordinated efforts, which can foster unity, communication, and a strong sense of team synergy. Source 13. Charades Charades is a classic game in which players must act out a word or phrase without speaking, while their team tries to guess what it is within a certain time frame. By playing charades, participants improve their non-verbal communication skills and enhance their problem-solving abilities. 14. Team Dinner Social gatherings such as team dinners provide a relaxed setting for players to build relationships organically. Conversations around team successes and opportunities for improvement help boost morale, a sense of belonging, and motivation. 15. Escape Room Challenge An Escape Room Challenge is a game where a team of players cooperatively discover clues, solve puzzles, and accomplish tasks in one or more rooms to progress and ultimately escape within a set time limit. The challenges are lots of fun and encourage communication, collaboration, and problem-solving under pressure. 16. Paintball Paintball is a team sport that involves players eliminating opponents by tagging them with paintballs. This fun activity encourages cooperative strategy and teamwork under pressure, but for safety reasons, works best for older students (high schoolers). 17. Capture the Flag Capture the Flag is a traditional outdoor game where two or more teams each have a flag (or a similar object) and the objective is to capture the other team's flag, located at the team's \"base,\" and bring it safely back to their base. The game gets team members interacting and cooperating in ways that can translate into improved team dynamics. Source 18. Attend a Sporting Event An outing to a local sports game provides a great opportunity for team building in a relaxed, fun environment outside the usual context of training and matches. Opt to watch an event completely unrelated to your own or choose a professional version of your sport. Allow your team to comment on the game or match and discuss their impressions and observations. This helps them develop a deeper understanding of the game. 19. Group Volunteering for Charity Not all team building needs to have a direct connection to sports. Working together to serve the community can deepen connections between team members. Consider volunteering for local events, organizing a donation drive, or offering a hockey clinic for younger players. 20. Fundraise for the Team Another way to deepen the bond between your team is to have them organize a fundraiser, whether it benefits the team itself or another community organization. Car wash drive, anyone? The feeling of satisfaction and fulfillment they’ll receive after working together to reach their goals is priceless. Not to mention the fun they had getting there! Source More About Team Building Activities for Youth Sports Source Outdoor Team-Building Activities for Youth Sports Team-Building Here are some great team-building activity options to do outside: Relay race Obstacle course Silent line-up Scavenger hunt Team conditioning Tug-o-war Human knot Hot potato Blind obstacle course Hula hoop challenge Capture the flag Paintball Attend a sporting event Team Building Games for Youth Sports With No Equipment Here are some options if you don’t have any equipment on hand: Silent line-up Team conditioning Human knot Charades Indoor Team Building Games for Youth Sports These games are great for indoors: Escape room challenges Charades Team dinner Group volunteering for charity Streamline Your Next Youth Sports Tournament No matter which activities you choose, the best team-building activities depend on your team's dynamic, age range, and interests. Be sure to choose exercises that will be fun and beneficial for everyone involved. And if you need help with any of your sports tournament housing, put EventPipe on your team. EventPipe is a comprehensive event housing management software designed to revolutionize how you manage accommodations for your events. From sports events to corporate events, festivals, concerts, and weddings, EventPipe's end-to-end solution streamlines the booking process, boosts financial performance, and takes the hassle out of housing management for both producers and attendees. Branded website using EventPipe event housing management software. Here are some of our key features: Hotels Access: Gain access to tens of thousands of hotels to locate the perfect accommodations for your event attendees. Customizable Booking Site: Build an event-exclusive, branded site displaying your logo and imagery in less than 10 minutes. No coding is required! Additional Revenue Streams: Monetize your event housing management process through advertisements and optional amenities on your unique branded site. Group Block Management: Manage room block bookings with ease. Choose multiple hotels and room types, appoint a group block manager, view live inventory, and share booking instructions with attendees via link-sharing. Streamlined RFP Process: Simplify the RFP process with our easy-to-use interface. Request specific nights, room types, concessions, and complimentary rooms while being able to select, negotiate, and accept proposals directly from your account. Simplified Booking Experience for Attendees: EventPipe offers a user-friendly, mobile-optimized booking site. Attendees can view, manage, and track reservations, even opting to join a waitlist for fully booked hotels. Data Reporting & Analytics: Utilize our advanced Report Center for real-time insights. Track financial performance, pickup rates, hotel cut-off dates, and confirmation statuses for all your events. Ready to revolutionize your event housing management? Author Posts Jeff Porter Jeff is the Marketing Manager at EventPipe. He brings almost a decade of Marketing experience with a background in social media, events, SEO and content. Outside of work, Jeff is an independent Hip Hop artist who regularly releases and performs his music and loves to golf and play ice hockey in his spare time. Recent Posts by Jeff Porter: A Guide to Hotel Booking Software for Sports Housing Companies How to Create a Budget Plan for a Youth Sports Program How to Apply for Youth Sports Grants [2024 Guide] See more Ready to better manage and monetize hotel bookings in 2025? Chat with our team today. Request Demo For details on how we use your information please see our Privacy Policy. © 2025 EventPipe™, Inc. All rights reserved."
    },
    {
      "url": "https://www.goodrec.com/",
      "content": "Find and Join Soccer, Volleyball, and Basketball Games Near You | GoodRec HOMEPICKUP LEAGUES & EVENTS SOCCER LEAGUESVOLLEYBALL CLINICSPICKLEBALL EVENTSCORPORATE EVENTS BLOGSHOPDOWNLOAD THE APP TAP THE APP JOIN A GAME ========================= Find and join pickup soccer, volleyball, and basketball games near you instantly through the GoodRec app. All you have to do is sign up, show up, and play! JOIN A GAME 400,000+ Players | 100,000+ Games | 10,000+ Reviews SELECT YOUR SPORT Pickup soccer, basketball and volleyball games every day in your city. Choose a time and place that suits you. ### Volleyball Spike like N'Gapeth ### Soccer Dribble like Messi ### Basketball Ball like LeBron WHY PLAY WITH US? 1. Easy and Convenient Games every day that you can join in just a few taps. 2. Zero Commitment Play your favorite sport without the pressure of long-term commitments. 3. No Uncertainty We handle all of the logistics so you can relax and just play. DOWNLOAD THE APP HAVE ANY QUESTIONS? Everything you need to know to join a game HAVE ANY QUESTIONS? Everything you need to know to join a game JOIN THE GOODREC FAMILY AND START PLAYING TODAY Our hope is that GoodRec brings people together. We love hearing that best friends have met, relationships have started, and group chats have been born through these games. We're excited to have you join us. JOIN A GAME 400,000+ Players | 100,000+ Games | 10,000+ Reviews Pickup SoccerPickup Soccer in New York CityPickup Soccer in Los AngelesPickup Soccer in OttawaPickup Soccer in Chicago Pickup BasketballPickup Basketball in New York CityPickup Basketball in Toronto Open Play VolleyballOpen Play Volleyball in New York CityOpen Play Volleyball in TorontoOpen Play Volleyball in MiamiOpen Play Volleyball in Boston SOCCER LEAGUESSoccer Leagues in New York CitySoccer Leagues in DallasSoccer Leagues in BostonSoccer Leagues in Detroit Volleyball ClinicsVolleyball Clinics in New York CityVolleyball Clinicsin DallasVolleyball Clinics in BostonVolleyball Clinics in Toronto PICKLEBALL EVENTSPickleball Events in New York CityPickleball Events in Detroit HOMESPORTSCITIESReviewsBLOG PARTNER WITH USTERMS & CONDITIONSPRIVACY POLICYDelete YOUR account Follow Us ©2024 by Just Play Apps, Inc.",
      "title": "Find and Join Soccer, Volleyball, and Basketball Games Near You | GoodRec HOMEPICKUP LEAGUES & EVENTS SOCCER LEAGUESVOLLEYBALL CLINICSPICKLEBALL EVENTSCORPORATE EVENTS BLOGSHOPDOWNLOAD THE APP TAP THE APP JOIN A GAME ========================= Find and join pickup soccer, volleyball, and basketball games near you instantly through the GoodRec app. All you have to do is sign up, show up, and play! JOIN A GAME 400,000+ Players | 100,000+ Games | 10,000+ Reviews SELECT YOUR SPORT Pickup soccer, basketball and volleyball games every day in your city. Choose a time and place that suits you. ### Volleyball Spike like N'Gapeth ### Soccer Dribble like Messi ### Basketball Ball like LeBron WHY PLAY WITH US? 1. Easy and Convenient Games every day that you can join in just a few taps. 2. Zero Commitment Play your favorite sport without the pressure of long-term commitments. 3. No Uncertainty We handle all of the logistics so you can relax and just play. DOWNLOAD THE APP HAVE ANY QUESTIONS? Everything you need to know to join a game HAVE ANY QUESTIONS? Everything you need to know to join a game JOIN THE GOODREC FAMILY AND START PLAYING TODAY Our hope is that GoodRec brings people together. We love hearing that best friends have met, relationships have started, and group chats have been born through these games. We're excited to have you join us. JOIN A GAME 400,000+ Players | 100,000+ Games | 10,000+ Reviews Pickup SoccerPickup Soccer in New York CityPickup Soccer in Los AngelesPickup Soccer in OttawaPickup Soccer in Chicago Pickup BasketballPickup Basketball in New York CityPickup Basketball in Toronto Open Play VolleyballOpen Play Volleyball in New York CityOpen Play Volleyball in TorontoOpen Play Volleyball in MiamiOpen Play Volleyball in Boston SOCCER LEAGUESSoccer Leagues in New York CitySoccer Leagues in DallasSoccer Leagues in BostonSoccer Leagues in Detroit Volleyball ClinicsVolleyball Clinics in New York CityVolleyball Clinicsin DallasVolleyball Clinics in BostonVolleyball Clinics in Toronto PICKLEBALL EVENTSPickleball Events in New York CityPickleball Events in Detroit HOMESPORTSCITIESReviewsBLOG PARTNER WITH USTERMS & CONDITIONSPRIVACY POLICYDelete YOUR account Follow Us ©2024 by Just Play Apps, Inc."
    },
    {
      "url": "https://www.yapsody.com/ticketing/blog/best-sporting-event-ideas/",
      "content": "Published Time: 2024-08-29T11:30:33+00:00 20 Best Sporting Event Ideas for Every Enthusiast - Yapsody What's new Contact Sales Contact Support What's new Contact Sales Contact Support Features Event Setup Online Store Customization Reserved Seating Management Advanced Reporting Flexible Billing Options Event Scheduling Sell Add-Ons Box Office App Ticket Scanning Block Fraudulent Users Event Widgets Integration Multiple Payment Gateways Event Setup Online Store Customization Reserved Seating Management Advanced Reporting Flexible Billing Options Event Scheduling Sell Add-Ons Box Office App Ticket Scanning Block Fraudulent Users Event Widgets Integration Multiple Payment Gateways Event Setup Configure events with seating, schedules, and media galleries. Online Store Customization Customize event store layout to enhance ticket sales. Reserved Seating Management Design seat maps and enable attendee seat selection. Advanced Reporting Gain insights with custom reports and event analytics. Flexible Billing Options Manage invoices, autopay, and diverse payment methods. Event Scheduling Automate event publishing with custom date and time. Sell Add-Ons Boost revenue by selling merchandise, parking, or upgrades. Box Office App Manage ticketing, refunds, and promotions via mobile app. Ticket Scanning Simplify entry with mobile or dedicated scanning devices. Block Fraudulent Users Block users by email, domain, or IP address. Event Widgets Integration Embed widgets for event details and ticket sales. Multiple Payment Gateways Secure payments via Stripe, PayPal, and 14+ gateways. Explore All Features Pricing Categories Casino Fairs & Festivals Farms Business & Conference Theme and Adventure Park K12, Schools & Colleges Hospitality Live Music & Concerts Non Profits Museums Hybrid Events Theaters Casino Hospitality Fairs & Festivals Farms Live Music & Concert Non-Profit Business & Conference Museums Theme and Adventure Parks Hybrid Events K12, School & University Theater Casino Maximize casino show revenue with seamless ticketing. Hospitality Simplified ticketing for hotels, restaurants, and nightlife events. Fairs & Festivals Custom solutions for trade, food, music, and art festivals. Live Music & Concert Tailored ticketing for unforgettable live music experiences. Farms Easy ticketing for seasonal farm events and gatherings. Non-Profit 50% ticketing rebate for fundraisers and charity events. Business & Conference Streamlined registrations for workshops, seminars, and networking events. Museums Custom ticketing for exhibitions, tours, and educational events. Theme and Adventure Parks Sell tickets for rides, attractions, and park experiences. Hybrid Events Simplify virtual and in-person blended event ticketing. K12, School & University Ticketing for school events, programs, and performances. Theater Professional ticketing for live productions and theater events. Explore All Categories Resources Blog Case Study Customer Story Presenter Spotlight Knowledge Articles News & Announcements Concerts Find My Tickets Presenter Log In Sign Up Demo Home > Blog > Event Ideas • Sports > 20 Best Sporting Event Ideas for Every Enthusiast 20 Best Sporting Event Ideas for Every Enthusiast August 29, 2024 Event Ideas, Sports What is a Sporting Event? A sporting event is a structured and organized competition or activity in which individuals or teams participate in physical activities or sports. These events are typically governed by specific rules and regulations to ensure fair play and are often designed to determine a winner through a performance-based outcome. Sporting events can range from small, local competitions to large, international tournaments, and they serve various purposes including entertainment, physical fitness, community engagement, and professional competition. Key Characteristics of a Sporting Event: Competition: Sporting events involve competition where participants strive to achieve the best performance or outcome, whether it’s scoring points, finishing a race, or achieving a personal best. Rules and Regulations: These events are governed by a set of rules and guidelines that ensure fair play and standardize the competition. Participants: The events feature individuals or teams as participants. The level of participants can vary from amateur enthusiasts to professional athletes. Audience: Sporting events often attract spectators, both live and through various media platforms, who watch and support the competitors. Organized Structure: These events are planned and organized by event managers, sports clubs, schools, or professional organizations to ensure they run smoothly. Types of Sporting Events: Local and Community Events: Fun Runs: Casual races often organized to raise funds for charity or to promote community health. School Sports Days: Competitions held within schools to encourage student participation in various sports. Amateur and Recreational Events: Pick-up Games: Informal sports games organized among friends or community members. Recreational Leagues: Leagues formed for non-professional players to compete regularly in sports like basketball, soccer, or softball. Professional and Competitive Events: National Championships: High-level competitions to determine the best athletes or teams in a country. International Tournaments: Events like the FIFA World Cup, the Olympics, and Wimbledon, which attract global participation and viewership. Specialty and Themed Events: Esports Tournaments: Competitions for video game players, often featuring large prize pools and professional participants. Obstacle Races: Events like Tough Mudder or Spartan Race that combine running with challenging physical obstacles. Fundraising and Charity Events: Charity Races: Events designed to raise money for specific causes through participant sponsorships and entry fees. Celebrity Matches: Games featuring celebrities or well-known athletes, often held to raise funds for charity. Benefits of Sporting Events: Physical Fitness: Encourages participants to stay active and healthy. Community Engagement: Brings people together, fostering community spirit and camaraderie. Entertainment: Provides enjoyment and excitement for spectators. Economic Impact: Generates revenue for local economies through tourism, sponsorships, and media rights. Inspiration: Inspires individuals, especially the youth, to participate in sports and lead an active lifestyle. 20 Best Sporting Event Ideas for Every Enthusiast Organizing sporting events is a fantastic way to foster community engagement, promote health and fitness, and provide entertainment. Here are 20 diverse and exciting sporting event ideas to inspire you: 1. Charity Fun Run Combine fitness with a good cause by organizing a charity fun run. Offer different race distances and encourage participants to dress up in costumes to add a fun twist. 2. Corporate Sports Day Create a day of friendly competition for companies. Activities can include traditional sports like soccer and basketball, as well as fun team-building exercises like sack races and tug-of-war. 3. Amateur Golf Tournament Host a golf tournament for players of all skill levels. Include fun challenges such as the longest drive, closest to the pin, and putting contests. 4. Youth Sports Clinics Organize clinics for kids to learn and improve their skills in sports like soccer, basketball, or tennis. Invite professional coaches to lead the sessions. 5. Fantasy Sports League Run a fantasy sports league where participants draft teams and compete based on real-world player performance. This can be an ongoing engagement throughout the sports season. 6. Marathon or Half-Marathon Plan a marathon or half-marathon in your community. Ensure proper logistics with water stations, medical support, and a festive post-race celebration. 7. Beach Volleyball Tournament Set up a beach volleyball tournament for various skill levels. Include different categories like men’s, women’s, and mixed teams to attract a broad audience. 8. Esports Tournament Organize an esports tournament for popular games such as Fortnite, League of Legends, or FIFA. This can draw a tech-savvy and young crowd. 9. Obstacle Course Race Create a challenging obstacle course race similar to Tough Mudder or Spartan Race. Design the course to test participants’ strength, endurance, and teamwork. 10. Triathlon Host a triathlon involving swimming, cycling, and running. This can be geared towards both amateur and professional athletes. 11. Pickleball Tournament Organize a pickleball tournament, a sport that blends tennis, badminton, and ping-pong. It’s easy to learn and fun for all ages. 12. Community Sports Festival Hold a sports festival featuring multiple activities, from soccer and basketball to yoga and Zumba classes. It’s a great way to engage the entire community. 13. Kickball Game Host a nostalgic kickball game that’s easy to organize and play. It’s suitable for all ages and can be a great family-friendly event. 14. Rowing Regatta If you have access to a suitable water body, organize a rowing regatta. Include different boat categories and distances to cater to all skill levels. 15. Sports Trivia Night Combine sports knowledge with fun by hosting a sports trivia night. Include questions from various sports and offer prizes for the winning teams. 16. Ultimate Frisbee Tournament Ultimate Frisbee is a fast-paced, team-oriented sport. Organize a tournament to attract enthusiasts and promote physical activity. 17. Cycling Race Plan a cycling race through scenic routes. Offer various categories, including time trials, road races, and mountain biking events. 18. Street Hockey Tournament Bring the excitement of hockey to the streets with a street hockey tournament. Include different age groups and skill levels. 19. Sports Photography Contest Encourage creativity with a sports photography contest. Invite participants to capture the spirit of sports and award prizes for the best photos. 20. Sports Film Festival Host a film festival showcasing sports documentaries and movies. This can inspire and entertain sports enthusiasts while celebrating sports culture. Conclusion These 20 sporting event ideas cater to a wide range of interests and skill levels. By organizing these events, you can promote fitness, foster community spirit, and provide memorable experiences for participants and spectators alike. So, pick an idea that resonates with you, start planning, and create an event that will be talked about for years to come! Register your event with Yapsody and start selling tickets for your events now! Connect with us to unlock special offers for listing your events on Yapsody today! Sign Up Today! Frequently asked questions 1. What are some easy-to-organize sporting event ideas for beginners? If you’re new to organizing sporting events, consider starting with simpler activities such as: Charity Fun Run: A 5K or fun run is relatively easy to set up and can attract a wide range of participants. Kickball Game: Organizing a kickball game requires minimal equipment and rules, making it perfect for beginners. Sports Trivia Night: This indoor event can be held in a community hall or online, requiring only a good set of sports-related questions. Community Sports Festival: Host a day of various mini-games and sports activities, allowing for casual and fun participation. Pickleball Tournament: Pickleball is easy to learn and organize, making it suitable for all ages and skill levels. 2. How can I ensure my sporting event appeals to a wide audience? To attract a diverse audience to your sporting event: Offer Multiple Activities: Include different types of sports and activities to cater to various interests. Promote Inclusivity: Ensure your event is accessible to all age groups and skill levels. Add Fun Elements: Incorporate fun challenges, costume themes, or music to make the event more engaging. Provide Amenities: Offer food, drinks, and entertainment for non-participants to enjoy. Engage the Community: Partner with local businesses and organizations to enhance the event’s appeal and reach. 3. What are the key considerations for organizing a large-scale sporting event like a marathon or triathlon? Organizing a large-scale event requires careful planning: Permits and Approvals: Secure all necessary permits from local authorities. Route Planning: Design a safe and manageable course, ensuring it meets all regulatory requirements. Medical Support: Arrange for medical personnel and first aid stations along the route. Volunteer Coordination: Recruit and train volunteers to assist with various tasks during the event. Marketing and Promotion: Create a robust marketing plan to attract participants and spectators. 4. How can I incorporate technology into my sporting event to enhance the experience? Technology can significantly improve both the participant and spectator experience: Registration Platforms: Use online registration platforms for easy sign-up and payment. Live Tracking: Implement live tracking for races so participants and spectators can monitor progress in real-time. Social Media: Utilize social media for promotions and live updates during the event. Wearable Tech: Encourage participants to use fitness trackers to monitor their performance. Virtual Events: Offer virtual participation options for those who cannot attend in person. 5. What are some fundraising ideas I can incorporate into my sporting event? Fundraising can add a meaningful dimension to your sporting event: Sponsorships: Seek sponsorships from local businesses to cover costs and raise additional funds. Entry Fees: Charge a participation fee, with proceeds going to a charitable cause. Merchandise Sales: Sell event-branded merchandise like T-shirts, hats, and water bottles. Pledge Drives: Encourage participants to collect pledges based on their performance (e.g., amount per mile run). Raffle and Auctions: Organize raffles or auctions with donated items to raise extra funds during the event. Share this blog : Unlock Exclusive Benefits with a Free Demo We’re thrilled to show how Yapsody can elevate your events and help you achieve your goals. Let’s take your ticketing to the next level. Looking to enhance your ticketing experience? Yapsody is an event ticketing platform that makes it easy to sell tickets online Sign Up Now Ready to refine the attendee experience? Join our latest webinar! Browse Categories: Updates & Announcements Event Promotion Event Planning Event Strategies Event Ideas Event Marketing Event Management Related Blogs 5 Ideas to Brighten Slow Evenings at Your Cafe 13 Community Event Ideas That Bring People Together 50 Proven School Fundraising Ideas That Drive Results Santa’s Top Picks: 23 Games For Kids Christmas Party 2024 « Previous Next » Ready to take the next step? It’s just a matter of one click. Create your Event Now Talk To Us Already a member? Sign in Contact Sales Event Ideas 5 Ideas to Brighten Slow Evenings at Your Cafe Read More » January 16, 2025 No Comments Event Ideas 13 Community Event Ideas That Bring People Together Read More » December 11, 2024 No Comments Event Ideas 50 Proven School Fundraising Ideas That Drive Results Read More » November 6, 2024 No Comments Christmas Santa’s Top Picks: 23 Games For Kids Christmas Party 2024 Read More » October 12, 2024 No Comments Event Ideas Host & Benefit from Private Events: Tips for Restaurants Read More » September 26, 2024 No Comments Clubs 7 Nightclub Event Ideas for a Full House Read More » September 19, 2024 No Comments Facebook Twitter Instagram Youtube Linkedin Pinterest Download our Decision Guide to explore the benefits of selling tickets online for your team with Yapsody Email Get Decision Guide Ticketing Sell Tickets Online Sell Concert Tickets Online Features Pricing Special Offers Event Categories Support Referral Program Loyalty Program Resources Blog Case Study Customer Story Presenter Spotlight Knowledge Articles News & Announcements Company About Us Contact Us Careers Concerts Home Artists Artists Shoutout Gallery © 2025 · Yapsody LLC. All Rights Reserved. | Terms of Service | Privacy Policy | Security | Cookie Policy | Features Event Setup Online Store Customization Reserved Seating Management Advanced Reporting Flexible Billing Options Event Scheduling Sell Add-Ons Box Office App Ticket Scanning Block Fraudulent Users Event Widgets Integration Multiple Payment Gateways Event Setup Online Store Customization Reserved Seating Management Advanced Reporting Flexible Billing Options Event Scheduling Sell Add-Ons Box Office App Ticket Scanning Block Fraudulent Users Event Widgets Integration Multiple Payment Gateways Event Setup Configure events with seating, schedules, and media galleries. Online Store Customization Customize event store layout to enhance ticket sales. Reserved Seating Management Design seat maps and enable attendee seat selection. Advanced Reporting Gain insights with custom reports and event analytics. Flexible Billing Options Manage invoices, autopay, and diverse payment methods. Event Scheduling Automate event publishing with custom date and time. Sell Add-Ons Boost revenue by selling merchandise, parking, or upgrades. Box Office App Manage ticketing, refunds, and promotions via mobile app. Ticket Scanning Simplify entry with mobile or dedicated scanning devices. Block Fraudulent Users Block users by email, domain, or IP address. Event Widgets Integration Embed widgets for event details and ticket sales. Multiple Payment Gateways Secure payments via Stripe, PayPal, and 14+ gateways. Explore All Features Pricing Categories Casino Fairs & Festivals Farms Business & Conference Theme and Adventure Park K12, Schools & Colleges Hospitality Live Music & Concerts Non Profits Museums Hybrid Events Theaters Casino Hospitality Fairs & Festivals Farms Live Music & Concert Non-Profit Business & Conference Museums Theme and Adventure Parks Hybrid Events K12, School & University Theater Casino Maximize casino show revenue with seamless ticketing. Hospitality Simplified ticketing for hotels, restaurants, and nightlife events. Fairs & Festivals Custom solutions for trade, food, music, and art festivals. Live Music & Concert Tailored ticketing for unforgettable live music experiences. Farms Easy ticketing for seasonal farm events and gatherings. Non-Profit 50% ticketing rebate for fundraisers and charity events. Business & Conference Streamlined registrations for workshops, seminars, and networking events. Museums Custom ticketing for exhibitions, tours, and educational events. Theme and Adventure Parks Sell tickets for rides, attractions, and park experiences. Hybrid Events Simplify virtual and in-person blended event ticketing. K12, School & University Ticketing for school events, programs, and performances. Theater Professional ticketing for live productions and theater events. Explore All Categories Resources Blog Case Study Customer Story Presenter Spotlight Knowledge Articles News & Announcements Concerts Find My Tickets Presenter Log In Sign Up Demo Knowledge Articles Email: support@yapsody.com Webinars Chat",
      "title": "Published Time: 2024-08-29T11:30:33+00:00 20 Best Sporting Event Ideas for Every Enthusiast - Yapsody What's new Contact Sales Contact Support What's new Contact Sales Contact Support Features Event Setup Online Store Customization Reserved Seating Management Advanced Reporting Flexible Billing Options Event Scheduling Sell Add-Ons Box Office App Ticket Scanning Block Fraudulent Users Event Widgets Integration Multiple Payment Gateways Event Setup Online Store Customization Reserved Seating Management Advanced Reporting Flexible Billing Options Event Scheduling Sell Add-Ons Box Office App Ticket Scanning Block Fraudulent Users Event Widgets Integration Multiple Payment Gateways Event Setup Configure events with seating, schedules, and media galleries. Online Store Customization Customize event store layout to enhance ticket sales. Reserved Seating Management Design seat maps and enable attendee seat selection. Advanced Reporting Gain insights with custom reports and event analytics. Flexible Billing Options Manage invoices, autopay, and diverse payment methods. Event Scheduling Automate event publishing with custom date and time. Sell Add-Ons Boost revenue by selling merchandise, parking, or upgrades. Box Office App Manage ticketing, refunds, and promotions via mobile app. Ticket Scanning Simplify entry with mobile or dedicated scanning devices. Block Fraudulent Users Block users by email, domain, or IP address. Event Widgets Integration Embed widgets for event details and ticket sales. Multiple Payment Gateways Secure payments via Stripe, PayPal, and 14+ gateways. Explore All Features Pricing Categories Casino Fairs & Festivals Farms Business & Conference Theme and Adventure Park K12, Schools & Colleges Hospitality Live Music & Concerts Non Profits Museums Hybrid Events Theaters Casino Hospitality Fairs & Festivals Farms Live Music & Concert Non-Profit Business & Conference Museums Theme and Adventure Parks Hybrid Events K12, School & University Theater Casino Maximize casino show revenue with seamless ticketing. Hospitality Simplified ticketing for hotels, restaurants, and nightlife events. Fairs & Festivals Custom solutions for trade, food, music, and art festivals. Live Music & Concert Tailored ticketing for unforgettable live music experiences. Farms Easy ticketing for seasonal farm events and gatherings. Non-Profit 50% ticketing rebate for fundraisers and charity events. Business & Conference Streamlined registrations for workshops, seminars, and networking events. Museums Custom ticketing for exhibitions, tours, and educational events. Theme and Adventure Parks Sell tickets for rides, attractions, and park experiences. Hybrid Events Simplify virtual and in-person blended event ticketing. K12, School & University Ticketing for school events, programs, and performances. Theater Professional ticketing for live productions and theater events. Explore All Categories Resources Blog Case Study Customer Story Presenter Spotlight Knowledge Articles News & Announcements Concerts Find My Tickets Presenter Log In Sign Up Demo Home > Blog > Event Ideas • Sports > 20 Best Sporting Event Ideas for Every Enthusiast 20 Best Sporting Event Ideas for Every Enthusiast August 29, 2024 Event Ideas, Sports What is a Sporting Event? A sporting event is a structured and organized competition or activity in which individuals or teams participate in physical activities or sports. These events are typically governed by specific rules and regulations to ensure fair play and are often designed to determine a winner through a performance-based outcome. Sporting events can range from small, local competitions to large, international tournaments, and they serve various purposes including entertainment, physical fitness, community engagement, and professional competition. Key Characteristics of a Sporting Event: Competition: Sporting events involve competition where participants strive to achieve the best performance or outcome, whether it’s scoring points, finishing a race, or achieving a personal best. Rules and Regulations: These events are governed by a set of rules and guidelines that ensure fair play and standardize the competition. Participants: The events feature individuals or teams as participants. The level of participants can vary from amateur enthusiasts to professional athletes. Audience: Sporting events often attract spectators, both live and through various media platforms, who watch and support the competitors. Organized Structure: These events are planned and organized by event managers, sports clubs, schools, or professional organizations to ensure they run smoothly. Types of Sporting Events: Local and Community Events: Fun Runs: Casual races often organized to raise funds for charity or to promote community health. School Sports Days: Competitions held within schools to encourage student participation in various sports. Amateur and Recreational Events: Pick-up Games: Informal sports games organized among friends or community members. Recreational Leagues: Leagues formed for non-professional players to compete regularly in sports like basketball, soccer, or softball. Professional and Competitive Events: National Championships: High-level competitions to determine the best athletes or teams in a country. International Tournaments: Events like the FIFA World Cup, the Olympics, and Wimbledon, which attract global participation and viewership. Specialty and Themed Events: Esports Tournaments: Competitions for video game players, often featuring large prize pools and professional participants. Obstacle Races: Events like Tough Mudder or Spartan Race that combine running with challenging physical obstacles. Fundraising and Charity Events: Charity Races: Events designed to raise money for specific causes through participant sponsorships and entry fees. Celebrity Matches: Games featuring celebrities or well-known athletes, often held to raise funds for charity. Benefits of Sporting Events: Physical Fitness: Encourages participants to stay active and healthy. Community Engagement: Brings people together, fostering community spirit and camaraderie. Entertainment: Provides enjoyment and excitement for spectators. Economic Impact: Generates revenue for local economies through tourism, sponsorships, and media rights. Inspiration: Inspires individuals, especially the youth, to participate in sports and lead an active lifestyle. 20 Best Sporting Event Ideas for Every Enthusiast Organizing sporting events is a fantastic way to foster community engagement, promote health and fitness, and provide entertainment. Here are 20 diverse and exciting sporting event ideas to inspire you: 1. Charity Fun Run Combine fitness with a good cause by organizing a charity fun run. Offer different race distances and encourage participants to dress up in costumes to add a fun twist. 2. Corporate Sports Day Create a day of friendly competition for companies. Activities can include traditional sports like soccer and basketball, as well as fun team-building exercises like sack races and tug-of-war. 3. Amateur Golf Tournament Host a golf tournament for players of all skill levels. Include fun challenges such as the longest drive, closest to the pin, and putting contests. 4. Youth Sports Clinics Organize clinics for kids to learn and improve their skills in sports like soccer, basketball, or tennis. Invite professional coaches to lead the sessions. 5. Fantasy Sports League Run a fantasy sports league where participants draft teams and compete based on real-world player performance. This can be an ongoing engagement throughout the sports season. 6. Marathon or Half-Marathon Plan a marathon or half-marathon in your community. Ensure proper logistics with water stations, medical support, and a festive post-race celebration. 7. Beach Volleyball Tournament Set up a beach volleyball tournament for various skill levels. Include different categories like men’s, women’s, and mixed teams to attract a broad audience. 8. Esports Tournament Organize an esports tournament for popular games such as Fortnite, League of Legends, or FIFA. This can draw a tech-savvy and young crowd. 9. Obstacle Course Race Create a challenging obstacle course race similar to Tough Mudder or Spartan Race. Design the course to test participants’ strength, endurance, and teamwork. 10. Triathlon Host a triathlon involving swimming, cycling, and running. This can be geared towards both amateur and professional athletes. 11. Pickleball Tournament Organize a pickleball tournament, a sport that blends tennis, badminton, and ping-pong. It’s easy to learn and fun for all ages. 12. Community Sports Festival Hold a sports festival featuring multiple activities, from soccer and basketball to yoga and Zumba classes. It’s a great way to engage the entire community. 13. Kickball Game Host a nostalgic kickball game that’s easy to organize and play. It’s suitable for all ages and can be a great family-friendly event. 14. Rowing Regatta If you have access to a suitable water body, organize a rowing regatta. Include different boat categories and distances to cater to all skill levels. 15. Sports Trivia Night Combine sports knowledge with fun by hosting a sports trivia night. Include questions from various sports and offer prizes for the winning teams. 16. Ultimate Frisbee Tournament Ultimate Frisbee is a fast-paced, team-oriented sport. Organize a tournament to attract enthusiasts and promote physical activity. 17. Cycling Race Plan a cycling race through scenic routes. Offer various categories, including time trials, road races, and mountain biking events. 18. Street Hockey Tournament Bring the excitement of hockey to the streets with a street hockey tournament. Include different age groups and skill levels. 19. Sports Photography Contest Encourage creativity with a sports photography contest. Invite participants to capture the spirit of sports and award prizes for the best photos. 20. Sports Film Festival Host a film festival showcasing sports documentaries and movies. This can inspire and entertain sports enthusiasts while celebrating sports culture. Conclusion These 20 sporting event ideas cater to a wide range of interests and skill levels. By organizing these events, you can promote fitness, foster community spirit, and provide memorable experiences for participants and spectators alike. So, pick an idea that resonates with you, start planning, and create an event that will be talked about for years to come! Register your event with Yapsody and start selling tickets for your events now! Connect with us to unlock special offers for listing your events on Yapsody today! Sign Up Today! Frequently asked questions 1. What are some easy-to-organize sporting event ideas for beginners? If you’re new to organizing sporting events, consider starting with simpler activities such as: Charity Fun Run: A 5K or fun run is relatively easy to set up and can attract a wide range of participants. Kickball Game: Organizing a kickball game requires minimal equipment and rules, making it perfect for beginners. Sports Trivia Night: This indoor event can be held in a community hall or online, requiring only a good set of sports-related questions. Community Sports Festival: Host a day of various mini-games and sports activities, allowing for casual and fun participation. Pickleball Tournament: Pickleball is easy to learn and organize, making it suitable for all ages and skill levels. 2. How can I ensure my sporting event appeals to a wide audience? To attract a diverse audience to your sporting event: Offer Multiple Activities: Include different types of sports and activities to cater to various interests. Promote Inclusivity: Ensure your event is accessible to all age groups and skill levels. Add Fun Elements: Incorporate fun challenges, costume themes, or music to make the event more engaging. Provide Amenities: Offer food, drinks, and entertainment for non-participants to enjoy. Engage the Community: Partner with local businesses and organizations to enhance the event’s appeal and reach. 3. What are the key considerations for organizing a large-scale sporting event like a marathon or triathlon? Organizing a large-scale event requires careful planning: Permits and Approvals: Secure all necessary permits from local authorities. Route Planning: Design a safe and manageable course, ensuring it meets all regulatory requirements. Medical Support: Arrange for medical personnel and first aid stations along the route. Volunteer Coordination: Recruit and train volunteers to assist with various tasks during the event. Marketing and Promotion: Create a robust marketing plan to attract participants and spectators. 4. How can I incorporate technology into my sporting event to enhance the experience? Technology can significantly improve both the participant and spectator experience: Registration Platforms: Use online registration platforms for easy sign-up and payment. Live Tracking: Implement live tracking for races so participants and spectators can monitor progress in real-time. Social Media: Utilize social media for promotions and live updates during the event. Wearable Tech: Encourage participants to use fitness trackers to monitor their performance. Virtual Events: Offer virtual participation options for those who cannot attend in person. 5. What are some fundraising ideas I can incorporate into my sporting event? Fundraising can add a meaningful dimension to your sporting event: Sponsorships: Seek sponsorships from local businesses to cover costs and raise additional funds. Entry Fees: Charge a participation fee, with proceeds going to a charitable cause. Merchandise Sales: Sell event-branded merchandise like T-shirts, hats, and water bottles. Pledge Drives: Encourage participants to collect pledges based on their performance (e.g., amount per mile run). Raffle and Auctions: Organize raffles or auctions with donated items to raise extra funds during the event. Share this blog : Unlock Exclusive Benefits with a Free Demo We’re thrilled to show how Yapsody can elevate your events and help you achieve your goals. Let’s take your ticketing to the next level. Looking to enhance your ticketing experience? Yapsody is an event ticketing platform that makes it easy to sell tickets online Sign Up Now Ready to refine the attendee experience? Join our latest webinar! Browse Categories: Updates & Announcements Event Promotion Event Planning Event Strategies Event Ideas Event Marketing Event Management Related Blogs 5 Ideas to Brighten Slow Evenings at Your Cafe 13 Community Event Ideas That Bring People Together 50 Proven School Fundraising Ideas That Drive Results Santa’s Top Picks: 23 Games For Kids Christmas Party 2024 « Previous Next » Ready to take the next step? It’s just a matter of one click. Create your Event Now Talk To Us Already a member? Sign in Contact Sales Event Ideas 5 Ideas to Brighten Slow Evenings at Your Cafe Read More » January 16, 2025 No Comments Event Ideas 13 Community Event Ideas That Bring People Together Read More » December 11, 2024 No Comments Event Ideas 50 Proven School Fundraising Ideas That Drive Results Read More » November 6, 2024 No Comments Christmas Santa’s Top Picks: 23 Games For Kids Christmas Party 2024 Read More » October 12, 2024 No Comments Event Ideas Host & Benefit from Private Events: Tips for Restaurants Read More » September 26, 2024 No Comments Clubs 7 Nightclub Event Ideas for a Full House Read More » September 19, 2024 No Comments Facebook Twitter Instagram Youtube Linkedin Pinterest Download our Decision Guide to explore the benefits of selling tickets online for your team with Yapsody Email Get Decision Guide Ticketing Sell Tickets Online Sell Concert Tickets Online Features Pricing Special Offers Event Categories Support Referral Program Loyalty Program Resources Blog Case Study Customer Story Presenter Spotlight Knowledge Articles News & Announcements Company About Us Contact Us Careers Concerts Home Artists Artists Shoutout Gallery © 2025 · Yapsody LLC. All Rights Reserved. | Terms of Service | Privacy Policy | Security | Cookie Policy | Features Event Setup Online Store Customization Reserved Seating Management Advanced Reporting Flexible Billing Options Event Scheduling Sell Add-Ons Box Office App Ticket Scanning Block Fraudulent Users Event Widgets Integration Multiple Payment Gateways Event Setup Online Store Customization Reserved Seating Management Advanced Reporting Flexible Billing Options Event Scheduling Sell Add-Ons Box Office App Ticket Scanning Block Fraudulent Users Event Widgets Integration Multiple Payment Gateways Event Setup Configure events with seating, schedules, and media galleries. Online Store Customization Customize event store layout to enhance ticket sales. Reserved Seating Management Design seat maps and enable attendee seat selection. Advanced Reporting Gain insights with custom reports and event analytics. Flexible Billing Options Manage invoices, autopay, and diverse payment methods. Event Scheduling Automate event publishing with custom date and time. Sell Add-Ons Boost revenue by selling merchandise, parking, or upgrades. Box Office App Manage ticketing, refunds, and promotions via mobile app. Ticket Scanning Simplify entry with mobile or dedicated scanning devices. Block Fraudulent Users Block users by email, domain, or IP address. Event Widgets Integration Embed widgets for event details and ticket sales. Multiple Payment Gateways Secure payments via Stripe, PayPal, and 14+ gateways. Explore All Features Pricing Categories Casino Fairs & Festivals Farms Business & Conference Theme and Adventure Park K12, Schools & Colleges Hospitality Live Music & Concerts Non Profits Museums Hybrid Events Theaters Casino Hospitality Fairs & Festivals Farms Live Music & Concert Non-Profit Business & Conference Museums Theme and Adventure Parks Hybrid Events K12, School & University Theater Casino Maximize casino show revenue with seamless ticketing. Hospitality Simplified ticketing for hotels, restaurants, and nightlife events. Fairs & Festivals Custom solutions for trade, food, music, and art festivals. Live Music & Concert Tailored ticketing for unforgettable live music experiences. Farms Easy ticketing for seasonal farm events and gatherings. Non-Profit 50% ticketing rebate for fundraisers and charity events. Business & Conference Streamlined registrations for workshops, seminars, and networking events. Museums Custom ticketing for exhibitions, tours, and educational events. Theme and Adventure Parks Sell tickets for rides, attractions, and park experiences. Hybrid Events Simplify virtual and in-person blended event ticketing. K12, School & University Ticketing for school events, programs, and performances. Theater Professional ticketing for live productions and theater events. Explore All Categories Resources Blog Case Study Customer Story Presenter Spotlight Knowledge Articles News & Announcements Concerts Find My Tickets Presenter Log In Sign Up Demo Knowledge Articles Email: support@yapsody.com Webinars Chat"
    },
    {
      "url": "https://www.experiencecolumbiasc.com/things-to-do/sports/",
      "content": "Columbia, SC Sports | Spectator Sports & Outdoor Recreation Your browser is not supported for this experience. We recommend using Chrome, Firefox, Edge, or Safari. Skip navigation Skip to main content Meetings & Conventions Sports Planners Weddings Partners Insider's Blog Menu Close Inside Columbia [![Image 3: Hot March Highlights: St. Pat’s, Pickleball and Pimento Cheese](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_426,q_65,w_640/v1/cms_resources/clients/columbia/Live_music_Senate_and_Tin_Roof_Vista_ECSC_photo_by_Brandon_Geer_fall_2021_59_Tin_Roof_Vista_After_Five_c931f82b-856d-4f0e-8efb-188572b17854.jpg)](https://www.experiencecolumbiasc.com/blog/post/march/)4 min read Hot March Highlights: St. Pat’s, Pickleball and Pimento Cheese [![Image 4: Y’all Come on Down and Boogie](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_426,q_65,w_640/v1/cms_resources/clients/columbia/Laird_84__12799d53-d7ee-45ef-8748-daeca452d86d.png)](https://www.experiencecolumbiasc.com/blog/post/yall-come-on-down-and-boogie/)4 min read Y’all Come on Down and Boogie Things to Do [![Image 5: Hot March Highlights: St. Pat’s, Pickleball and Pimento Cheese](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_426,q_65,w_640/v1/cms_resources/clients/columbia/Live_music_Senate_and_Tin_Roof_Vista_ECSC_photo_by_Brandon_Geer_fall_2021_59_Tin_Roof_Vista_After_Five_c931f82b-856d-4f0e-8efb-188572b17854.jpg)](https://www.experiencecolumbiasc.com/blog/post/march/)4 min read Hot March Highlights: St. Pat’s, Pickleball and Pimento Cheese [![Image 6: Y’all Come on Down and Boogie](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_426,q_65,w_640/v1/cms_resources/clients/columbia/Laird_84__12799d53-d7ee-45ef-8748-daeca452d86d.png)](https://www.experiencecolumbiasc.com/blog/post/yall-come-on-down-and-boogie/)4 min read Y’all Come on Down and Boogie Events [![Image 7: Hot March Highlights: St. Pat’s, Pickleball and Pimento Cheese](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_426,q_65,w_640/v1/cms_resources/clients/columbia/Live_music_Senate_and_Tin_Roof_Vista_ECSC_photo_by_Brandon_Geer_fall_2021_59_Tin_Roof_Vista_After_Five_c931f82b-856d-4f0e-8efb-188572b17854.jpg)](https://www.experiencecolumbiasc.com/blog/post/march/)4 min read Hot March Highlights: St. Pat’s, Pickleball and Pimento Cheese [![Image 8: Y’all Come on Down and Boogie](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_426,q_65,w_640/v1/cms_resources/clients/columbia/Laird_84__12799d53-d7ee-45ef-8748-daeca452d86d.png)](https://www.experiencecolumbiasc.com/blog/post/yall-come-on-down-and-boogie/)4 min read Y’all Come on Down and Boogie Food & Drink [![Image 9: Hot March Highlights: St. Pat’s, Pickleball and Pimento Cheese](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_426,q_65,w_640/v1/cms_resources/clients/columbia/Live_music_Senate_and_Tin_Roof_Vista_ECSC_photo_by_Brandon_Geer_fall_2021_59_Tin_Roof_Vista_After_Five_c931f82b-856d-4f0e-8efb-188572b17854.jpg)](https://www.experiencecolumbiasc.com/blog/post/march/)4 min read Hot March Highlights: St. Pat’s, Pickleball and Pimento Cheese [![Image 10: Y’all Come on Down and Boogie](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_426,q_65,w_640/v1/cms_resources/clients/columbia/Laird_84__12799d53-d7ee-45ef-8748-daeca452d86d.png)](https://www.experiencecolumbiasc.com/blog/post/yall-come-on-down-and-boogie/)4 min read Y’all Come on Down and Boogie Places to Stay [![Image 11: Hot March Highlights: St. Pat’s, Pickleball and Pimento Cheese](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_426,q_65,w_640/v1/cms_resources/clients/columbia/Live_music_Senate_and_Tin_Roof_Vista_ECSC_photo_by_Brandon_Geer_fall_2021_59_Tin_Roof_Vista_After_Five_c931f82b-856d-4f0e-8efb-188572b17854.jpg)](https://www.experiencecolumbiasc.com/blog/post/march/)4 min read Hot March Highlights: St. Pat’s, Pickleball and Pimento Cheese [![Image 12: Y’all Come on Down and Boogie](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_426,q_65,w_640/v1/cms_resources/clients/columbia/Laird_84__12799d53-d7ee-45ef-8748-daeca452d86d.png)](https://www.experiencecolumbiasc.com/blog/post/yall-come-on-down-and-boogie/)4 min read Y’all Come on Down and Boogie Plan Your Trip [![Image 13: Hot March Highlights: St. Pat’s, Pickleball and Pimento Cheese](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_426,q_65,w_640/v1/cms_resources/clients/columbia/Live_music_Senate_and_Tin_Roof_Vista_ECSC_photo_by_Brandon_Geer_fall_2021_59_Tin_Roof_Vista_After_Five_c931f82b-856d-4f0e-8efb-188572b17854.jpg)](https://www.experiencecolumbiasc.com/blog/post/march/)4 min read Hot March Highlights: St. Pat’s, Pickleball and Pimento Cheese [![Image 14: Y’all Come on Down and Boogie](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_426,q_65,w_640/v1/cms_resources/clients/columbia/Laird_84__12799d53-d7ee-45ef-8748-daeca452d86d.png)](https://www.experiencecolumbiasc.com/blog/post/yall-come-on-down-and-boogie/)4 min read Y’all Come on Down and Boogie Check Rates Check Rates Insider's Blog Inside Columbia Things to Do Events Food & Drink Places to Stay Plan Your Trip Meetings & Conventions Sports Planners Weddings Partners About Us Contact Media Privacy Policy Terms of Use Sitemap Funding Partners 4 min read Hot March Highlights: St. Pat’s, Pickleball and Pimento Cheese [![Image 16: Y’all Come on Down and Boogie](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_426,q_65,w_640/v1/cms_resources/clients/columbia/Laird_84__12799d53-d7ee-45ef-8748-daeca452d86d.png)](https://www.experiencecolumbiasc.com/blog/post/yall-come-on-down-and-boogie/)4 min read Y’all Come on Down and Boogie ![Image 17: Fireflies Mascot Mason](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,g_xy_center,h_996,q_65,w_640,x_2259,y_2077/v1/cms_resources/clients/columbia/Mason_the_mascot_at_Columbia_Fireflies_game_2d3df47c-3bd4-416d-b9f7-6db85da5d6f5.jpg) Home Things to Do Sports Share Sports From college sporting events and a professional baseball league, to skating rinks or active rivers perfect for kayaking, Columbia SC has you covered for all your sporting needs—both watching and playing. We’re excited you’ve decided to travel to Columbia SC and we hope you will seek to discover all that our city has to offer—after your team wins, of course. [![Image 18: 4 friends tailgating outside of Williams Brice Stadium](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,g_xy_center,h_640,q_65,w_640,x_2822,y_1670/v1/cms_resources/clients/columbia/UofSC_Football_Tailgate_Williams_Bryce_Stadium_ECSC_Fall_2019_Photo_by_Forrest_Clonts_014_44526433-7165-41ce-aecc-4d04986474cb.jpg)](https://www.experiencecolumbiasc.com/things-to-do/sports/game-days/) College Game Days [![Image 19: Watching a baseball game](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_640,q_65,w_640/v1/cms_resources/clients/columbia-redesign/Local_Teams_21c43348-4d51-4bfe-8819-f13dcd07b558.jpg)](https://www.experiencecolumbiasc.com/things-to-do/sports/local-teams/) Local Teams [![Image 20: Visit the Cities of the SEC Pass](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_640,q_65,w_640/v1/clients/columbia-redesign/default_image_7__fafffaa2-92ef-493c-9a4f-be0597f4f956.jpg)](https://www.experiencecolumbiasc.com/things-to-do/sports/visit-the-cities-of-the-sec-pass/) Visit the Cities of the SEC Pass Search All Listings [![Image 21: Riverbanks Zoo](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_640,q_65,w_640/v1/cms_resources/clients/columbia/09292016_RiverbanksZoo_0524_d364f2cb-b438-46f5-b011-b842d8986dd4.jpg)](https://www.experiencecolumbiasc.com/blog/) The Insider's Guide [![Image 22: Terra](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_640,q_65,w_640/v1/cms_resources/clients/columbia/terra_10732_d72110ed-78fb-412c-b1ce-79a749d71835.jpg)](https://www.experiencecolumbiasc.com/food-drink/) Food & Drink [![Image 23: Runaway Runway](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_640,q_65,w_640/v1/cms_resources/clients/columbia/RunawayRunway_62c05ede-f661-4a02-ade7-ae88bf128268.jpg)](https://www.experiencecolumbiasc.com/columbia-sc-events/) Events [![Image 24: Hendrix_Main_St_ECSC_spring_2019_photo_by_Forrest_Clonts_061 Hendrix on Main Street](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,g_xy_center,h_640,q_65,w_640,x_2414,y_4331/v1/cms_resources/clients/columbia/138_3_9842_jpeg_ea53c116-a166-428d-bcf9-f66574bd13f6.jpg)](https://www.experiencecolumbiasc.com/plan-your-trip/trip-ideas/) Trip Ideas Get Your Free Visitor Guide --------------------------- Subscribe & Get Trip Ideas -------------------------- Check Out Our Online Shopping ----------------------------- 1010 Lincoln Street Columbia, SC 29201 Phone: (803) 545-0000 Fax: (803) 545-0102 About Us Contact Media Privacy Policy Terms of Use Sitemap Funding Partners © 2025 Experience Columbia SC",
      "title": "Columbia, SC Sports | Spectator Sports & Outdoor Recreation Your browser is not supported for this experience. We recommend using Chrome, Firefox, Edge, or Safari. Skip navigation Skip to main content Meetings & Conventions Sports Planners Weddings Partners Insider's Blog Menu Close Inside Columbia [![Image 3: Hot March Highlights: St. Pat’s, Pickleball and Pimento Cheese](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_426,q_65,w_640/v1/cms_resources/clients/columbia/Live_music_Senate_and_Tin_Roof_Vista_ECSC_photo_by_Brandon_Geer_fall_2021_59_Tin_Roof_Vista_After_Five_c931f82b-856d-4f0e-8efb-188572b17854.jpg)](https://www.experiencecolumbiasc.com/blog/post/march/)4 min read Hot March Highlights: St. Pat’s, Pickleball and Pimento Cheese [![Image 4: Y’all Come on Down and Boogie](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_426,q_65,w_640/v1/cms_resources/clients/columbia/Laird_84__12799d53-d7ee-45ef-8748-daeca452d86d.png)](https://www.experiencecolumbiasc.com/blog/post/yall-come-on-down-and-boogie/)4 min read Y’all Come on Down and Boogie Things to Do [![Image 5: Hot March Highlights: St. Pat’s, Pickleball and Pimento Cheese](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_426,q_65,w_640/v1/cms_resources/clients/columbia/Live_music_Senate_and_Tin_Roof_Vista_ECSC_photo_by_Brandon_Geer_fall_2021_59_Tin_Roof_Vista_After_Five_c931f82b-856d-4f0e-8efb-188572b17854.jpg)](https://www.experiencecolumbiasc.com/blog/post/march/)4 min read Hot March Highlights: St. Pat’s, Pickleball and Pimento Cheese [![Image 6: Y’all Come on Down and Boogie](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_426,q_65,w_640/v1/cms_resources/clients/columbia/Laird_84__12799d53-d7ee-45ef-8748-daeca452d86d.png)](https://www.experiencecolumbiasc.com/blog/post/yall-come-on-down-and-boogie/)4 min read Y’all Come on Down and Boogie Events [![Image 7: Hot March Highlights: St. Pat’s, Pickleball and Pimento Cheese](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_426,q_65,w_640/v1/cms_resources/clients/columbia/Live_music_Senate_and_Tin_Roof_Vista_ECSC_photo_by_Brandon_Geer_fall_2021_59_Tin_Roof_Vista_After_Five_c931f82b-856d-4f0e-8efb-188572b17854.jpg)](https://www.experiencecolumbiasc.com/blog/post/march/)4 min read Hot March Highlights: St. Pat’s, Pickleball and Pimento Cheese [![Image 8: Y’all Come on Down and Boogie](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_426,q_65,w_640/v1/cms_resources/clients/columbia/Laird_84__12799d53-d7ee-45ef-8748-daeca452d86d.png)](https://www.experiencecolumbiasc.com/blog/post/yall-come-on-down-and-boogie/)4 min read Y’all Come on Down and Boogie Food & Drink [![Image 9: Hot March Highlights: St. Pat’s, Pickleball and Pimento Cheese](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_426,q_65,w_640/v1/cms_resources/clients/columbia/Live_music_Senate_and_Tin_Roof_Vista_ECSC_photo_by_Brandon_Geer_fall_2021_59_Tin_Roof_Vista_After_Five_c931f82b-856d-4f0e-8efb-188572b17854.jpg)](https://www.experiencecolumbiasc.com/blog/post/march/)4 min read Hot March Highlights: St. Pat’s, Pickleball and Pimento Cheese [![Image 10: Y’all Come on Down and Boogie](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_426,q_65,w_640/v1/cms_resources/clients/columbia/Laird_84__12799d53-d7ee-45ef-8748-daeca452d86d.png)](https://www.experiencecolumbiasc.com/blog/post/yall-come-on-down-and-boogie/)4 min read Y’all Come on Down and Boogie Places to Stay [![Image 11: Hot March Highlights: St. Pat’s, Pickleball and Pimento Cheese](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_426,q_65,w_640/v1/cms_resources/clients/columbia/Live_music_Senate_and_Tin_Roof_Vista_ECSC_photo_by_Brandon_Geer_fall_2021_59_Tin_Roof_Vista_After_Five_c931f82b-856d-4f0e-8efb-188572b17854.jpg)](https://www.experiencecolumbiasc.com/blog/post/march/)4 min read Hot March Highlights: St. Pat’s, Pickleball and Pimento Cheese [![Image 12: Y’all Come on Down and Boogie](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_426,q_65,w_640/v1/cms_resources/clients/columbia/Laird_84__12799d53-d7ee-45ef-8748-daeca452d86d.png)](https://www.experiencecolumbiasc.com/blog/post/yall-come-on-down-and-boogie/)4 min read Y’all Come on Down and Boogie Plan Your Trip [![Image 13: Hot March Highlights: St. Pat’s, Pickleball and Pimento Cheese](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_426,q_65,w_640/v1/cms_resources/clients/columbia/Live_music_Senate_and_Tin_Roof_Vista_ECSC_photo_by_Brandon_Geer_fall_2021_59_Tin_Roof_Vista_After_Five_c931f82b-856d-4f0e-8efb-188572b17854.jpg)](https://www.experiencecolumbiasc.com/blog/post/march/)4 min read Hot March Highlights: St. Pat’s, Pickleball and Pimento Cheese [![Image 14: Y’all Come on Down and Boogie](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_426,q_65,w_640/v1/cms_resources/clients/columbia/Laird_84__12799d53-d7ee-45ef-8748-daeca452d86d.png)](https://www.experiencecolumbiasc.com/blog/post/yall-come-on-down-and-boogie/)4 min read Y’all Come on Down and Boogie Check Rates Check Rates Insider's Blog Inside Columbia Things to Do Events Food & Drink Places to Stay Plan Your Trip Meetings & Conventions Sports Planners Weddings Partners About Us Contact Media Privacy Policy Terms of Use Sitemap Funding Partners 4 min read Hot March Highlights: St. Pat’s, Pickleball and Pimento Cheese [![Image 16: Y’all Come on Down and Boogie](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_426,q_65,w_640/v1/cms_resources/clients/columbia/Laird_84__12799d53-d7ee-45ef-8748-daeca452d86d.png)](https://www.experiencecolumbiasc.com/blog/post/yall-come-on-down-and-boogie/)4 min read Y’all Come on Down and Boogie ![Image 17: Fireflies Mascot Mason](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,g_xy_center,h_996,q_65,w_640,x_2259,y_2077/v1/cms_resources/clients/columbia/Mason_the_mascot_at_Columbia_Fireflies_game_2d3df47c-3bd4-416d-b9f7-6db85da5d6f5.jpg) Home Things to Do Sports Share Sports From college sporting events and a professional baseball league, to skating rinks or active rivers perfect for kayaking, Columbia SC has you covered for all your sporting needs—both watching and playing. We’re excited you’ve decided to travel to Columbia SC and we hope you will seek to discover all that our city has to offer—after your team wins, of course. [![Image 18: 4 friends tailgating outside of Williams Brice Stadium](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,g_xy_center,h_640,q_65,w_640,x_2822,y_1670/v1/cms_resources/clients/columbia/UofSC_Football_Tailgate_Williams_Bryce_Stadium_ECSC_Fall_2019_Photo_by_Forrest_Clonts_014_44526433-7165-41ce-aecc-4d04986474cb.jpg)](https://www.experiencecolumbiasc.com/things-to-do/sports/game-days/) College Game Days [![Image 19: Watching a baseball game](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_640,q_65,w_640/v1/cms_resources/clients/columbia-redesign/Local_Teams_21c43348-4d51-4bfe-8819-f13dcd07b558.jpg)](https://www.experiencecolumbiasc.com/things-to-do/sports/local-teams/) Local Teams [![Image 20: Visit the Cities of the SEC Pass](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_640,q_65,w_640/v1/clients/columbia-redesign/default_image_7__fafffaa2-92ef-493c-9a4f-be0597f4f956.jpg)](https://www.experiencecolumbiasc.com/things-to-do/sports/visit-the-cities-of-the-sec-pass/) Visit the Cities of the SEC Pass Search All Listings [![Image 21: Riverbanks Zoo](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_640,q_65,w_640/v1/cms_resources/clients/columbia/09292016_RiverbanksZoo_0524_d364f2cb-b438-46f5-b011-b842d8986dd4.jpg)](https://www.experiencecolumbiasc.com/blog/) The Insider's Guide [![Image 22: Terra](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_640,q_65,w_640/v1/cms_resources/clients/columbia/terra_10732_d72110ed-78fb-412c-b1ce-79a749d71835.jpg)](https://www.experiencecolumbiasc.com/food-drink/) Food & Drink [![Image 23: Runaway Runway](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,h_640,q_65,w_640/v1/cms_resources/clients/columbia/RunawayRunway_62c05ede-f661-4a02-ade7-ae88bf128268.jpg)](https://www.experiencecolumbiasc.com/columbia-sc-events/) Events [![Image 24: Hendrix_Main_St_ECSC_spring_2019_photo_by_Forrest_Clonts_061 Hendrix on Main Street](https://assets.simpleviewinc.com/sv-columbiasc/image/upload/c_fill,f_jpg,g_xy_center,h_640,q_65,w_640,x_2414,y_4331/v1/cms_resources/clients/columbia/138_3_9842_jpeg_ea53c116-a166-428d-bcf9-f66574bd13f6.jpg)](https://www.experiencecolumbiasc.com/plan-your-trip/trip-ideas/) Trip Ideas Get Your Free Visitor Guide --------------------------- Subscribe & Get Trip Ideas -------------------------- Check Out Our Online Shopping ----------------------------- 1010 Lincoln Street Columbia, SC 29201 Phone: (803) 545-0000 Fax: (803) 545-0102 About Us Contact Media Privacy Policy Terms of Use Sitemap Funding Partners © 2025 Experience Columbia SC"
    },
    {
      "url": "https://www.groupon.com/local/sporting-events?srsltid=AfmBOooI-5JpERwap4bsGmu8mP-Sy_4RIdXWXPB9b-hB8RGLnf7P3KE-",
      "content": "Sports events in 2025 – global sporting events calendar 2025 Skip to content Monday, February 10Sports. Travel. Events Sport + Travel Magazine About Services Contact Home Latest Bucket List Holidays & Trips Hotels & Resorts Guides Events Calendar 2025 sports events 2025 sports business events Sports events in 2025 – global sporting calendar February 2, 2025 The global sports calendar for 2025 is packed with exciting events that promise unforgettable moments for fans worldwide. From iconic competitions that celebrate long-standing traditions to new tournaments that showcase emerging talent, the year will feature a dynamic array of sports and venues. The biggest sporting events in 2025 include the Women’s Rugby World Cup, the British & Irish Lions tour of Australia, the FIFA Club World Cup, the Ryder Cup, the Ashes, and the UEFA Women’s European Championship. Sports like tennis and golf will also shine with their annual tours, grand slams and majors. Additionally, motorsport fans can look forward to the Formula 1 season, which will continue to offer thrilling races across exotic locations, including a night race in Las Vegas and the iconic Monaco Grand Prix. This diverse line-up reflects the global passion for sports and the unique way each event brings people together, creating a vibrant calendar that offers something for every sports enthusiast. We will continue to update this page as events are confirmed. Any times stated below are GMT/GST. Main image: NFL at Tottenham Hotspur Stadium in London (Credit: Mike Starling/Sports Tourism News) Other sports calendars Tennis in 2025 Marathons in 2025 Half marathons in 2025 Horse racing in 2025 Formula 1 2025 race calendar Rugby union in 2025 Golf in 2025 Darts in 2025 Snooker in 2025 Subscribe to our monthly newsletter February 2025 sports events Darts: Winmau World Masters When: 30 January to 2 February 2025 Where: Arena MK, Milton Keynes, England Rugby union: Guinness Men’s Six Nations 2025 – round one Saturday 1 February 2025: Scotland vs. Italy (Scottish Gas Murrayfield Stadium, Edinburgh); Ireland vs. England (Aviva Stadium, Dublin) Darts: BetMGM Premier League Darts – Night 1 When: Thursday 6 February 2025 Where: The SSE Arena, Belfast, Northern Ireland Hiking: HIGHLANDER Adventure, Ras Al Khaimah When: 7-9 February 2025 Where: Jebel Jais Ras Al Khaimah, UAE Website: highlanderadventure.com and visitrasalkhaimah.com The 9th Asian Winter Games Harbin 2025 When: 7-14 February 2025 Where: Harbin, Heilongjiang, China Website: harbin2025.com Rugby union: Guinness Men’s Six Nations 2025 – round two Saturday 8 February 2025: Italy vs. Wales (Stadio Olimpico, Rome); England vs. France (Allianz Stadium, Twickenham) Sunday 9 February 2025: Scotland vs. Ireland (Scottish Gas Murrayfield Stadium, Edinburgh) Hong Kong Marathon When: 9 February 2025 Where: Hong Kong Website: hkmarathon.com NFL Super Bowl LIX When: 9 February 2025 Where: Caesars Superdome, New Orleans, Louisiana, USA Website: nfl.com and nolasuperbowl.com Ticket packages: onlocationexp.com Tennis: Qatar TotalEnergies Open 2025 When: 9-15 February 2025 Where: Doha, Qatar Website: wtatennis.com Snooker: Home Nation Series – 2025 Welsh Open When: 10-16 February 2025 Where: Venue Cymru Arena, Llandudno, Wales Tickets: worldsnookertour.seetickets.com Darts: BetMGM Premier League Darts – Night 2 When: Thursday 13 February 2025 Where: OVO Hydro, Glasgow, Scotland Athletics: Keely Klassic When: 15 February 2025 Where: Utilita Arena Birmingham, England Tickets: utilitaarenabham.co.uk Nascar: Daytona 500 When: 16 February 2025 Where: Daytona International Speedway, Daytona Beach, Florida, US Website: nascar.com Tennis: Dubai Duty Free Tennis Championships When: 16 February to 1 March 2025 Where: Dubai Duty Free Tennis Stadium, Dubai, UAE Website: dubaidutyfreetennischampionships.com Cricket: ICC Men’s Champions Trophy 2025 When: 19 February to 9 March 2025 Where: Pakistan and UAE Website: icc-cricket.com Darts: BetMGM Premier League Darts – Night 3 When: Thursday 20 February 2025 Where: 3Arena, Dublin, Ireland Horse racing: Saudi Cup When: 21-22 February 2025 Where: King Abdulaziz Racetrack, Riyadh, Saudi Arabia Website: jcsa.sa UK Athletics Indoor Championships 2025 When: 22-23 February 2025 Where: Utilita Arena, Birmingham, England Website: britishathletics.org.uk and utilitaarenabham.co.uk Rugby union: Guinness Men’s Six Nations 2025 – round three Saturday 22 February 2025: Wales vs. Ireland (Principality Stadium, Cardiff); England vs. Scotland (Allianz Stadium, Twickenham) Sunday 23 February 2025: Italy vs. France (Stadio Olimpico, Rome) Rock ’n’ Roll Las Vegas Half Marathon When: 22-23 February 2025 Where: Las Vegas, Nevada, US Website: runrocknroll.com Kilimanjaro Half Marathon When: 23 February 2025 Where: Moshi, Kilimanjaro, Tanzania Website: kilimanjaromarathon.com F1 2025 pre-season testing When: 26-28 February 2025 Where: Bahrain International Circuit Darts: BetMGM Premier League Darts – Night 4 When: Thursday 27 February 2025 Where: Westpoint Exeter, England Darts: Ladbrokes UK Open When: 28 February to 2 March 2025 Where: Butlin’s Minehead Resort, England Horse racing: Dubai World Cup Carnival When: January to March 2025 Where: Meydan Racecourse, Dubai, UAE Website: dubairacingclub.com March 2025 sports events Darts: Ladbrokes UK Open When: 28 February to 2 March 2025 Where: Butlin’s Minehead Resort, England Tokyo Marathon When: 2 March 2024 Where: Tokyo, Japan Website: marathon.tokyo Tennis: BNP Paribas Open Indian Wells When: 2-16 March 2025 Where: Indian Wells, California, US Website: bnpparibasopen.com Darts: BetMGM Premier League Darts – Night 5 When: Thursday 6 March 2025 Where: The Brighton Centre, Brighton, England Golf: Arnold Palmer Invitational presented by Mastercard What: PGA Tour Signature Event When: 6-9 March 2025 Where: Arnold Palmer’s Bay Hill Club & Lodge Orlando, Florida, US Website: arnoldpalmerinvitational.com Darts: Belgian Darts Open When: 7-9 March 2025 Where: Oktoberhallen, Wieze, Belgium Rugby union: Guinness Men’s Six Nations 2025 – round four Saturday 8 March 2025: Ireland vs. France (Aviva Stadium, Dublin); Scotland vs. Wales (Scottish Gas Murrayfield Stadium, Edinburgh) Sunday 9 March 2025: England vs. Italy (Allianz Stadium, Twickenham) Half-marathon: Harmonie Mutuelle Semi de Paris When: 9 March 2025 Where: Paris, France Website: harmoniemutuellesemideparis.com Horse racing: Cheltenham Festival When: 11-14 March 2025 Where: Cheltenham Racecourse, Cheltenham, England Feature races (jumps): Unibet Champion Hurdle, Betway Queen Mother Champion Chase, Ryanair Chase, Cheltenham Gold Cup Website, tickets and hospitality: thejockeyclub.co.uk YONEX All England Open Badminton Championships 2025 When: 11-16 March 2025 Where: Utilita Arena Birmingham, England Website: allenglandbadminton.com Darts: BetMGM Premier League Darts – Night 6 When: Thursday 13 March 2025 Where: Motorpoint Arena, Nottingham, England Golf: THE PLAYERS Championship What: PGA Tour When: 13-16 March 2025 Where: TPC Sawgrass (THE PLAYERS Stadium Course) Ponte Vedra Beach, Florida, US Website: theplayers.com F1 Australian Grand Prix When: 14-16 March 2025 Where: Albert Park Rugby union: Guinness Men’s Six Nations 2025 – round five Saturday 15 March 2025 Italy vs. Ireland (Stadio Olimpico, Rome) Wales vs. England (Principality Stadium, Cardiff) France vs. Scotland (Stade de France, Paris) Football: 2025 English Women’s League Cup final When: 15 March 2025 Where: Pride Park Stadium, Derby, England Football: 2025 Carabao Cup final When: 16 March 2025 Where: Wembley Stadium, London, England Website: efl.com Bath Half Marathon 2025 When: 16 March 2025 Where: Bath, England Website: bathhalf.co.uk Surrey Half Marathon When: 16 March 2025 Where: Woking, Surrey Website: surreyhalf.com United Airlines NYC Half When: 16 March 2025 Where: New York City, US Website: nyrr.org Run Rome The Marathon When: 16 March 2025 Where: Rome, Italy Website: runromethemarathon.com Los Angeles Marathon When: 16 March 2025 Where: Los Angeles, California, US Website: mccourtfoundation.org Tennis: Miami Open presented by Itaú When: 16-30 March 2025 Where: Miami, Florida, US Website: miamiopen.com Snooker: 2025 Players Championship When: 17-23 March 2025 Where: International Centre Telford, England Tickets: worldsnookertour.seetickets.com Baseball: MLB World Tour Tokyo Series Who: Los Angeles Dodgers vs. Chicago Cubs When: 18-19 March 2025 Where: Tokyo Dome, Tokyo, Japan Website: mlb.com Darts: BetMGM Premier League Darts – Night 7 When: Thursday 20 March 2025 Where: Utilita Arena, Cardiff, Wales Darts: German Darts Open When: 21-23 March 2025 Where: Lokhalle, Gottingen, Germany F1 Chinese Grand Prix When: 21-23 March 2025 (sprint weekend) Where: Shanghai International Circuit Guinness Women’s Six Nations round one Saturday 22 March: Ireland vs. France (Kingspan Stadium, Belfast); Scotland vs. Wales (Hive Stadium, Edinburgh) Sunday 23 March: England vs. Italy (LNER Community Stadium, York) Manulife Danang International Marathon When: 23 March 2025 Where: Da Nang, Vietnam Website: rundanang.com Darts: BetMGM Premier League Darts – Night 8 When: Thursday 27 March 2025 Where: Utilita Arena, Newcastle, England Côte Chalonnaise Wine Marathon When: 29 March 2025 Where: Burgundy, France Events: marathon, half marathon, 10km, and MARA3 (race with three runners – the first runner on the 42km, the second for the 21km and third on 10km. All three runners will then finish together) Website: marathondesvinsdelacotechalonnaise.fr Guinness Women’s Six Nations round two Saturday 29 March: France vs. Scotland (Stade Marcel-Deflandre, La Rochelle); Wales vs. England (Principality Stadium, Cardiff) Sunday 30 March: Italy vs. Ireland (Stadio Sergio Lanfranchi, Parma) Horse racing: Ulster National Raceday at Downpatrick What: seven races will be on the card, including the feature race, the Randox Ulster National When: 30 March 2025 Where: Downpatrick Racecourse, Co. Down, Northern Ireland Website: downpatrickracecourse.co.uk Snooker: 2025 Tour Championship When: 31 March to 6 April 2025 Where: Manchester Central, Manchester, England Tickets: worldsnookertour.seetickets.com Horse racing: Dubai World Cup Carnival When: January to March 2025 Where: Meydan Racecourse, Dubai, UAE Website: dubairacingclub.com April 2025 sports events Snooker: 2025 Tour Championship When: 31 March to 6 April 2025 Where: Manchester Central, Manchester Tickets: worldsnookertour.seetickets.com Darts: BetMGM Premier League Darts – Night 9 When: Thursday 3 April 2025 Where: Uber Arena, Berlin, Germany Horse racing: Grand National Festival at Aintree When: 3-5 April 2025 Where: Aintree Racecourse, Liverpool, England Feature races (jumps): JLT Melling Steeple Chase, Randox Health Topham Steeple Chase, Grand National Website, tickets and hospitality: thejockeyclub.co.uk Darts: International Darts Open When: 4-6 April 2025 Where: WT Energiesysteme Arena, Riesa, Germany F1 Japanese Grand Prix When: 4-6 April 2025 Where: Suzuka Circuit Horse racing: The Grand National at Aintree When: 5 April 2025 Where: Aintree Racecourse, Liverpool, England Website, tickets and hospitality: thejockeyclub.co.uk Horse racing: Dubai World Cup 2025 When: 5 April 2025 Where: Meydan Racecourse, Dubai, UAE Website: dubairacingclub.com Tennis: Rolex Monte-Carlo Masters When: 5-13 April 2025 Where: Monte-Carlo, Monaco Website: montecarlotennismasters.com Brighton Marathon Weekend When: 6 April 2025 Where: Brighton, England Events: marathon, 10km Website: brightonmarathonweekend.co.uk London Landmarks Half Marathon When: 6 April 2025 Where: Westminster and the City, London, England Website: llhm.co.uk Darts: BetMGM Premier League Darts – Night 10 When: Thursday 10 April 2025 Where: AO Arena, Manchester, England Men’s golf major: The Masters Tournament When: 10-13 April 2025 Where: Augusta National GC, Augusta, Georgia, US Website: masters.com F1 Bahrain Grand Prix When: 11-13 April 2025 Where: Bahrain International Circuit Horse racing: Scottish Grand National Festival at Ayr When: 12 April 2025 Where: Ayr Racecourse, Scotland Feature races (jumps): Coral Scottish Champion Hurdle, Coral Scottish Grand National Website: scottishgrandnationalfestival.co.uk Guinness Women’s Six Nations round three Saturday 12 April: France vs. Wales; Ireland v England (Virgin Media Park, Cork) Sunday 13 April: Scotland vs. Italy (Hive Stadium, Edinburgh) NN Marathon Rotterdam When: 12-13 April 2025 Where: Rotterdam, Netherlands Website: nnmarathonrotterdam.nl ABP Newport Marathon Festival When: 13 April 2025 Where: Newport, Wales, UK Events: marathon, half marathon, 10K, mile Website: newportwalesmarathon.co.uk Schneider Electric Marathon de Paris When: 13 April 2025 Where: Paris, France Website: schneiderelectricparismarathon.com Darts: BetMGM Premier League Darts – Night 11 When: Thursday 17 April 2025 Where: Rotterdam Ahoy, Rotterdam, Netherlands Golf: RBC Heritage What: PGA Tour Signature Event When: 17-20 April 2025 Where: Harbour Town Golf Links Hilton Head Island, South Carolina, US Website: rbcheritage.com F1 Saudi Arabian Grand Prix When: 18-20 April 2025 Where: Jeddah Corniche Circuit Guinness Women’s Six Nations round four Saturday 19 April: Italy vs. France (Stadio Sergio Lanfranchi, Parma); England vs. Scotland (Mattioli Woods Welford Road, Leicester) Sunday 20 April: Wales vs. Ireland (Rodney Parade, Newport) Darts: German Darts Grand Prix When: 19-21 April 2025 Where: Zenith, Munich, Germany Snooker: 2025 World Snooker Championship When: 19 April to 5 May 2025 Where: The Crucible, Sheffield, England Tickets: worldsnookertour.seetickets.com Run the Great Wall – Jinshanling Great Wall When: 20 April 2025 Where: Jinshanling Great Wall Scenic Area, China Events: 10km, half marathon and full marathon Website: rungreatwall.com Boston Marathon When: Monday 21 April 2025 Where: Boston, USA Website: baa.org Tennis: Mutua Madrid Open When: 21 April to 4 May 2025 Where: La Caja Mágica, Madrid, Spain Website: mutuamadridopen.com Darts: BetMGM Premier League Darts – Night 12 When: Thursday 24 April 2025 Where: M&S Bank Arena, Liverpool, England American football: 2025 NFL Draft When: 24-26 April 2025 Where: Green Bay, Wisconsin, US Women’s golf major: The Chevron Championship When: 24-27 April 2025 Where: The Club at Carlton Woods in The Woodlands, Texas, US Website: thechevronchampionship.com Darts: Austrian Darts Open When: 25-27 April 2025 Where: Premstättner Halle, Graz, Austria Guinness Women’s Six Nations round five When: Saturday 26 April Italy vs. Wales (Stadio Sergio Lanfranchi, Parma) Scotland vs. Ireland (Hive Stadium, Edinburgh) England vs. France (Allianz Stadium, Twickenham) Horse racing: Bet365 Jump Finale at Sandown Park When: 26 April 2025 Where: Sandown Park, Surrey, England Website and tickets: thejockeyclub.co.uk Cycling: Etape Loch Ness What: Scotland’s largest closed-road cycle sportive When: 27 April 2025 Where: Loch Ness, Scotland Website: etapelochness.com Nashville Rock ‘n’ Roll Running Series When: 26-27 April 2025 Where: Nashville, Tennessee, US What: Marathon, Half Marathon, 10K, 5K, 1 Mile, Kids Rock, Doggie Dash Website: runrocknroll.com London Marathon When: 27 April 2025 Where: London, England Website: tcslondonmarathon.com Tennis: Internazionali BNL d’Italia What: ATP Masters 1000 When: 29 April to 18 May 2025 Where: Rome, Italy Website: internazionalibnlditalia.com The Sierra Leone Marathon Organisers: Street Child UK (registered charity) When: 30 April 2025 Where: Northern Sierra Leone Website: street-child.co.uk May 2025 sports events Snooker: 2025 World Snooker Championship When: 19 April to 5 May 2025 Where: The Crucible, Sheffield, England Tickets: worldsnookertour.seetickets.com Tennis: Mutua Madrid Open When: 21 April to 4 May 2025 Where: La Caja Mágica, Madrid, Spain Website: mutuamadridopen.com Tennis: Internazionali BNL d’Italia When: 29 April to 18 May 2025 Where: Rome, Italy Website: internazionalibnlditalia.com BetMGM Premier League Darts 2025 When: Thursday 1 May 2025 Where: Utilita Arena Birmingham, England Darts: European Darts Grand Prix When: 2-4 May 2025 Where: Glaspalast, Sindelfingen, Germany F1 Miami Grand Prix When: 2-4 May 2025 (sprint weekend) Where: Miami International Autodrome Horse racing: Kentucky Derby When: 3 May 2025 Where: Churchill Downs Racetrack, Louisville, Kentucky, US Website: kentuckyderby.com Rugby league: Super League Magic Weekend 2025 What: six matches in one stadium across two days When: 3-4 May 2025 Where: St James’ Park, Newcastle upon Tyne, England Website: superleague.co.uk Belfast City Marathon When: 4 May 2025 Where: Belfast, Northern Ireland Website: belfastcitymarathon.com Darts: BetMGM Premier League Darts – Night 14 When: Thursday 8 May 2025 Where: First Direct Arena, Leeds, England Golf: Truist Championship What: PGA Tour Signature Event When: 8-11 May 2025 Where: The Philadelphia Cricket Club (Wissahickon Course), US Website: truistchampionship.com Cycling: Giro d’Italia 2025 When: 9 May to 1 June 2025 Where: Albania and Italy Website: giroditalia.it Great Bristol Run Half Marathon When: 11 May 2025 Where: Bristol, England Website: greatrun.org Men’s golf major: PGA Championship When: 15-18 May 2025 Where: Quail Hollow Club, Charlotte, North Carolina, US Website: pgachampionship.com F1 Emilia-Romagna Grand Prix When: 16-18 May 2025 Where: Autodromo Enzo e Dino Ferrari Darts: BetMGM Premier League Darts – Night 15 When: Thursday 15 May 2025 Where: P&J Live, Aberdeen, Scotland Football: English FA Cup final 2025 When: Saturday 17 May 2025 Where: Wembley Stadium, London, England Website: thefa.com Football: 2025 English Women’s FA Cup final When: Sunday 18 May 2025 Where: Wembley Stadium, London Horse racing: Preakness Stakes When: 17 May 2025 Where: Pimlico Race Course, Baltimore, Maryland, US Website: preakness.com Great Ocean Road Running Festival When: 17-18 May 2025 Where: Melbourne, Australia Website: greatoceanroadrunfest.com.au AJ Bell Great Manchester Run When: 18 May 2025 Where: Manchester, England Events: half marathon, 10km Website: greatrun.org Tennis grand slam: French Open Roland-Garros When: 19 May to 8 June 2025 Where: Stade Roland-Garros, Paris, France Website: rolandgarros.com Men’s football: 2025 Uefa Europa League final When: 21 May 2025 Where: San Mamés Stadium, Bilbao, Spain Darts: BetMGM Premier League Darts – Night 16 When: Thursday 22 May 2025 Where: Utilita Arena, Sheffield, England Rugby union: EPCR Challenge Cup final When: Friday 23 May 2025 Where: Principality Stadium, Cardiff, Wales Darts: Dutch Darts Championship When: 23-25 May 2025 Where: Autotron, Rosmalen, Netherlands F1 Monaco Grand Prix When: 23-25 May 2025 Where: Circuit de Monaco MotoGP British Grand Prix 2025 When: 23-25 May 2025 Where: Silverstone Circuit, Northamptonshire, England Website: silverstone.co.uk Rugby union: Investec Champions Cup final When: 24 May 2025 Where: Principality Stadium, Cardiff, Wales Football: Uefa Women’s Champions League final When: 24 May 2025 Where: Estádio José Alvalade, Lisbon, Portugal Edinburgh Marathon When: 25 May 2025 Where: Edinburgh, Scotland Website: edinburghmarathon.com IndyCar: Indianapolis 500 When: 25 May 2025 Where: Indianapolis Motor Speedway, Speedway, Indiana, US Website: indianapolismotorspeedway.com Padel World Summit 2025 When: 27-29 May 2025 Where: Fira de Barcelona, Spain Website: padelsummit.com Men’s football: 2025 Uefa Europa Conference League final When: 28 May 2024 Where: Wrocław Stadium, Wrocław, Poland Darts: BetMGM Premier League Darts – Play-Offs When: Thursday 29 May 2025 Where: The O2, London, England Women’s golf major: US Women’s Open presented by Ally When: 29 May to 1 June 2025 Where: Erin Hills, Erin, Wisconsin, US Website: uswomensopen.com Golf: the Memorial Tournament presented by Workday What: PGA Tour Signature Event When: 29 May to 1 June 2025 Where: Muirfield Village Golf Club, Dublin, Ohio, US Website: thememorialtournament.com F1 Spanish Grand Prix When: 30 May to 1 June 2025 Where: Circuit de Barcelona-Catalunya Darts: European Darts Open When: 30 May to 1 June 2025 Where: Ostermann-Arena, Leverkusen, Germany Men’s football: 2025 Uefa Champions League finalWhen: 31 May 2025 Where: Allianz Arena, Munich, Germany Icefjord Midnight Marathon When: 31 May 2025 Where: Ilulissat, Greenland Website: icefjord-midnight-marathon.com Stockholm Marathon When: 31 May 2025 Where: Stockholm, Sweden Website: stockholmmarathon.se June 2025 sports events Cycling: Giro d’Italia 2025 When: 9 May to 1 June 2025 Where: Albania and Italy Website: giroditalia.it Tennis grand slam: French Open Roland-Garros When: 19 May to 8 June 2025 Where: Stade Roland-Garros, Paris, France Website: rolandgarros.com Women’s golf major: US Women’s Open presented by Ally When: 29 May to 1 June 2025 Where: Erin Hills, Erin, Wisconsin, US Website: uswomensopen.com Golf: the Memorial Tournament presented by Workday What: PGA Tour Signature Event When: 29 May to 1 June 2025 Where: Muirfield Village Golf Club, Dublin, Ohio, US Website: thememorialtournament.com F1 Spanish Grand Prix When: 30 May to 1 June 2025 Where: Circuit de Barcelona-Catalunya Darts: European Darts Open When: 30 May to 1 June 2025 Where: Ostermann-Arena, Leverkusen, Germany NBA Finals When: 5-22 June 2025 Website: nba.com Horse racing: Epsom Derby Festival When: 6-7 June 2025 Where: Epsom Downs, Surrey, England Feature races (flat): The Oaks, The Derby Website and tickets: thejockeyclub.co.uk Darts: Mr Vegas Nordic Darts Masters When: 6-7 June 2025 Where: Forum Copenhagen, Denmark KLM Aruba Marathon When: 7-8 June 2025 Where: Aruba What: marathon, half-marathon, 10km, 5kn Website: klmarubamarathon.com Horse racing: Belmont Stakes When: 7 June 2025 Where: Belmont Park‎, ‎Elmont, New York‎, US Website: belmontstakes.com Comrades Marathon When: 8 June 2025 Where: Durban to Pietermaritzburg, South Africa What: 89km ultra-marathon Website: comrades.com Men’s golf major: US Open When: 12-15 June 2025 Where: Oakmont CC, Oakmont, Pennsylvania, US Website: usopen.com Darts: BetVictor World Cup of Darts When: 12-15 June 2025 Where: Eissporthalle, Frankfurt, Germany F1 Canadian Grand Prix When: 13-15 June 2025 Where: Circuit Gilles Villeneuve Rugby union: Gallagher Premiership Final When: 14 June 2025 Where: Allianz Stadium, Twickenham, England Website: premiershiprugby.com Big Five Marathon When: 14 June 2025 Where: South Africa Website: big-five-marathon.com Skye Half Marathon When: 14 June 2025 Where: Isle of Skye, Scotland Website: skyehalfmarathon.com FIFA Club World Cup 2025 When: Saturday 14 June to Sunday 13 July 2025 Where: United States Website: fifa.com Horse racing: Royal Ascot When: 17-21 June 2025 Where: Ascot Racecourse, Ascot, England Feature races (flat): Gold Cup, St James’s Palace Stakes, Queen Anne Stakes, Prince of Wales’s Stakes, Coronation Stakes, Golden Jubilee Stakes Website: ascot.co.uk Women’s golf major: KPMG Women’s PGA Championship When: 19-22 June 2025 Where: Fields Ranch East at PGA Frisco, Frisco, Texas, US Website: kpmgwomenspgachampionship.com Golf: Travelers Championship What: PGA Tour Signature Event When: 19-22 June 2025 Where: TPC River Highlands, Cromwell, Connecticut, US Website: travelerschampionship.com Rugby union: British & Irish Lions vs. Argentina When: 20 June 2025 Where: Aviva Stadium, Dublin, Ireland Website: lionsrugby.com Rugby union: England XV vs. France XV When: Saturday 21 June 2025 Where: Allianz Stadium, Twickenham, England Website: englandrugby.com Midnight Sun Marathon When: 21 June 2025 Where: Tromsø, Norway Events: Marathon; Mizuno Half Marathon; Coop Mila (10km); Mini-marathon (4.2km); Children’s race (800m) Website: msm.no Darts: bet365 US Darts Masters When: 27-28 June 2025 Where: The Theater at Madison Square Garden, New York, US F1 Austrian Grand Prix When: 27-29 June 2025 Where: Red Bull Ring Darts: bet365 North American Darts Championship When: 28 June 2025 Where: The Theater at Madison Square Garden, New York, US Iceland Volcano Marathon When: 28 June 2025 Where: near Lake Mývatn, Iceland Website: iceland-volcano-marathon.com Tennis grand slam: The Championships Wimbledon When: 30 June to 13 July 2025 Where: All England Lawn Tennis & Croquet Club, London, England Website: wimbledon.com July 2025 sports events FIFA Club World Cup 2025 When: Saturday 14 June to Sunday 13 July 2025 Where: United States Website: fifa.com Tennis grand slam: The Championships Wimbledon When: 30 June to 13 July 2025 Where: All England Lawn Tennis & Croquet Club, London, England Website: wimbledon.com UEFA Women’s Euro 2025 When: 2-27 July 2025 Where: Switzerland Host cities: Basel (opening game and final), Bern, Geneva, Zurich, St. Gallen, Lucerne Website: uefa.com/womenseuro Horse racing: Old Newton Cup Festival at Haydock Park When: 3-5 July 2025 Where: Haydock Park, Merseyside, England Website and tickets: thejockeyclub.co.uk Darts: Superbet Poland Darts Masters When: 4-5 July 2025 Where: PreZero Arena Gliwice, Poland F1 British Grand Prix When: 4-6 July 2025 Where: Silverstone Circuit Rugby union: Argentina vs. England When: 5 July Where: Estadio Jorge Luis Hirschi, Buenos Aires, Argentina Website: englandrugby.com Men’s cycling: Tour de France When: 5-27 July 2025 Where: Lille to Paris, France Horse racing: The July Festival at Newmarket When: 10-12 July 2025 Where: Newmarket Racecourse, Newmarket, England Feature races (flat): Darley July Cup, Princess of Wales’s Stakes, Tattersalls Falmouth Stakes Website and tickets: thejockeyclub.co.uk Women’s golf major: Amundi Evian Championship When: 10-13 July 2025 Where: Evian Resort Golf Club, Evian-les-Bains, France Website: amundi.evianchampionship.com Men’s golf: Genesis Scottish Open What: DP World Tour Rolex Series Event When: 10-13 July 2025 Where: The Renaissance Club, North Berwick, Scotland Website: europeantour.com MOTUL FIM Superbike World Championship UK round When: 11-13 July 2025 Where: Donington Park Circuit, Castle Donington, Derbyshire, England Website: worldsbk.com Darts: Baltic Sea Darts Open When: 11-13 July 2025 Where: Wunderino Arena, Kiel, Germany Baseball: MLB All-Star Game What: All-Star Week, 95th MLB All-Star Game, T-Mobile Home Run Derby, All-Star Futures Game, MLB Draft When: 11-15 July 2025 Where: Atlanta, Georgia, US Website: mlb.com World Aquatics Championships 2025 Singapore When: 11 July to 3 August 2025 Where: Singapore Sports: Swimming, Water Polo, Diving, Artistic Swimming, Open Water Swimming, High Diving Website: worldaquatics.com Rugby union: Argentina vs. England When: 12 July Where: Estadio San Juan del Bigentenario, San Juan, Argentina Website: englandrugby.com FIFA Club World Cup Final 2025 When: 13 July 2025 Where: MetLife Stadium, New York New Jersey, US Men’s golf major: 153rd Open Championship When: 13-20 July 2025 Where: Royal Portrush Golf Club, County Antrim, Northern Ireland Website: theopen.com Zagori Mountain Running 2024 When: 18-20 July 2025 Where: Zagori, Greece Events: 80km, 44+km marathon, 21km, 10km Website: zagorirace.gr Horse racing: Summer Plate Ladies Day at Market Rasen When: 19 July 2025 Where: Market Rasen, Lincolnshire, England Feature races (jumps): Summer Plate Grade 3 Handicap Chase, Summer Handicap Hurdle Website and tickets: thejockeyclub.co.uk Rugby union: Australia vs. British & Irish Lions – 1st Test When: 19 July 2025 Where: Suncorp Stadium, Brisbane, Australia Website: lionsrugby.com SailGP: Emirates Great Britain Sail Grand Prix When: 19-20 July 2025 Where: Portsmouth, England Website: sailgp.com Darts: Betfred World Matchplay When: 19-27 July 2025 Where: Winter Gardens, Blackpool, England Horse racing: King George Weekend at Ascot When: 25-26 July 2025 Where: Ascot Racecourse, Ascot, England Feature races (flat): King George VI and Queen Elizabeth Stakes Website: ascot.co.uk F1 Belgian Grand Prix When: 25-27 July 2025 (sprint weekend) Where: Spa-Francorchamps Australian Outback Marathon When: 26 July 2025 Where: Uluru, Australia Website: australianoutbackmarathon.com Rugby union: Australia vs. British & Irish Lions – 2nd Test When: 26 July 2025 Where: Melbourne Cricket Ground, Melbourne, Australia Website: lionsrugby.com Darts: Betfred Women’s World Matchplay When: 27 July 2025 Where: Winter Gardens, Blackpool, England San Francisco Marathon When: 26-27 July 2025 Where: San Francisco, California, US Events: marathon; half marathon (bridge half/city half); 10k; 5k; family 1k Website: thesfmarathon.com Women’s cycling: 2025 Tour de France Femmes When: 26 July to 3 August 2025 Where: France Tennis: The National Bank Open presented by Rogers When: 26 July to 7 August 2025 Where: Toronto, Canada Website: nationalbankopen.com San Francisco Half Marathon When: 27 July 2025 Where: San Francisco, California, US Events: Bridge Half Marathon (first half of marathon); City Half Marathon (second half) Website: thesfmarathon.com Horse racing: Qatar Goodwood Festival What: “Glorious Goodwood” is a flat racing festival When: 29 July-2 August 2025 Where: Goodwood Racecourse, West Sussex, England Feature races (flat): Al Shaqab Goodwood Cup, Qatar Sussex Stakes, King George Qatar Stakes Website: goodwood.com Women’s golf major: AIG Women’s Open When: 31 July to 3 August 2025 Where: Royal Porthcawl, Porthcawl, Wales Website: aigwomensopen.com August 2025 sports events World Aquatics Championships 2025 Singapore When: 11 July to 3 August 2025 Where: Singapore Sports: Swimming, Water Polo, Diving, Artistic Swimming, Open Water Swimming, High Diving Website: worldaquatics.com Women’s cycling: 2025 Tour de France Femmes When: 26 July to 3 August 2025 Where: France Tennis: The National Bank Open presented by Rogers When: 26 July to 7 August 2025 Where: Toronto, Canada Website: nationalbankopen.com Horse racing: Qatar Goodwood Festival What: “Glorious Goodwood” is a flat racing festival When: 29 July-2 August 2025 Where: Goodwood Racecourse, West Sussex, England Feature races (flat): Al Shaqab Goodwood Cup, Qatar Sussex Stakes, King George Qatar Stakes Website: goodwood.com Women’s golf major: AIG Women’s Open When: 31 July to 3 August 2025 Where: Royal Porthcawl, Porthcawl, Wales Website: aigwomensopen.com F1 Hungarian Grand Prix When: 1-3 August 2025 Where: Hungaroring Festival of Sport 2025 When: 1-4 August 2025 Where: Packington Estate, Warwickshire, England Website: festivalofsportuk.com Rugby union: Australia vs. British & Irish Lions – 3rd Test When: 2 August 2025 Where: Accor Stadium, Sydney, Australia Website: lionsrugby.com UK Athletics Outdoor Championships 2025 When: 2-3 August 2025 Where: Alexander Stadium, Birmingham, England Website: britishathletics.org.uk Tennis: Cincinnati Open When: 5-18 August 2025 Where: Cincinnati, Ohio, US Website: cincinnatiopen.com Golf: FedEx St. Jude Championship What: PGA Tour FedExCup Playoffs When: 7-10 August 2025 Where: TPC Southwind, Memphis, Tennessee, US Website: fedexchampionship.com The World Games 2025 Chengdu When: 7-17 August 2025 Where: Chengdu, China Website: theworldgames.org Darts: Australian Darts Masters When: 8-9 August 2025 Where: WIN Entertainment Centre, Wollongong, Australia Football: 2025 Uefa Super Cup final What: Uefa Champions League winners vs. Uefa Europa League winners When: 13 August 2025 Where: Stadio Friuli, Udine, Italy Golf: BMW Championship What: PGA Tour FedExCup Playoffs When: 14-17 August 2025 Where: Caves Valley Golf Club, Owings Mills, Maryland, US Website: bmwchampionship.com Darts: NZ Darts Masters When: 15-16 August 2025 Where: Spark Arena, Auckland, New Zealand Horse racing: York Ebor Festival When: 20-23 August 2025 Where: York Racecourse, York, England Feature races: Juddmonte International, Darley Yorkshire Oaks, Coolmore Nunthorpe, York Ebor Tickets: yorkracecourse.co.uk Golf: TOUR Championship What: PGA Tour When: 21-25 August 2025 Where: East Lake Golf Club, Atlanta, Georgia, US Website: tourchampionship.com Women’s Rugby World Cup 2025 When: 22 August to 27 September 2025 Where: England Website: rugbyworldcup.com Antrim Coast Half Marathon When: 24 August 2025 Where: Antrim Coast Road, County Antrim, Northern Ireland Website: antrimcoasthalfmarathon.com Tennis grand slam: US Open When: 25 August to 7 September 2025 Where: USTA Billie Jean King National Tennis Center, New York City, US Website: usopen.org F1 Dutch Grand Prix When: 29-31 August 2025 Where: Circuit Zandvoort Darts: Flanders Darts Trophy When: 29-31 August 2025 Where: Antwerp Xpo, Belgium Horse racing: BetMGM Summer Celebration Saturday at Sandown Park When: 30 August 2025 Where: Sandown Park, Surrey, England Feature races: Solario Stakes Website and tickets: thejockeyclub.co.uk TCS Sydney Marathon When: 31 August 2025 Where: Sydney, Australia Events: marathon, 10km, 4.2km Website: tcssydneymarathon.com Kauai Marathon and Half Marathon When: 31 August 2025 Where: Kauai island, Hawaii, US Website: thekauaimarathon.com September 2025 sports events Women’s Rugby World Cup 2025 When: 22 August to 27 September 2025 Where: England Website: rugbyworldcup.com Tennis grand slam: US Open When: 25 August to 7 September 2025 Where: USTA Billie Jean King National Tennis Center, New York City, US Website: usopen.org Horse racing: Sprint Cup Celebration at Haydock Park When: 4-6 September 2025 Where: Haydock Park, Lancashire, England Feature races: Betfair Sprint Cup Website and tickets: thejockeyclub.co.uk F1 Italian Grand Prix When: 5-7 September 2025 Where: Autodromo Nazionale Monza Darts: Czech Darts Open When: 5-7 September 2025 Where: PVA EXPO Prague, Czech Republic Petra Desert Marathon When: 6 September 2025 Where: Petra, Jordan Website: petra-desert-marathon.com Médoc Marathon When: 6 September 2025 Where: the vineyards of the Médoc in the Gironde, France Website: marathondumedoc.com Great North Run When: 7 September 2025 Where: Newcastle to South Shields, England Website: greatrun.org The Big Half London Organisers: London Marathon Events When: 7 September 2025 Where: Tower Bridge to Cutty Sark, London, England Races: half marathon, New Balance Big Relay, Big Mile Website: thebighalf.co.uk Horse racing: St Leger Festival at Doncaster When: 11-14 September 2025 Where: Doncaster Racecourse Featured races (flat): Doncaster Cup; St Leger Stakes; Leger Legends Day charity race Website: doncaster-racecourse.co.uk Men’s golf: BMW PGA Championship What: DP World Tour Rolex Series Event When: 11-14 September 2025 Where: Wentworth Club, Virginia Water, Surrey, England Website: europeantour.com Darts: Jack’s World Series of Darts Finals When: 12-14 September 2025 Where: AFAS Live, Amsterdam, Netherlands Tallinn Marathon When: 12-14 September 2025 Where: Tallinn, Estonia Events: marathon; half marathon; 10k; 5k Website: jooks.ee World Athletics Championships Tokyo 2025 When: 13-21 September 2025 Where: Tokyo, Japan Website: worldathletics.org Copenhagen Half Marathon When: 14 September 2025 Where: Copenhagen, Denmark Website: cphhalf.dk Snooker: Home Nation Series – 2025 English Open When: 15-21 September 2025 Where: Brentwood Leisure Centre, Essex, England Tickets: worldsnookertour.seetickets.com F1 Azerbaijani Grand Prix When: 19-21 September 2025 Where: Baku City Circuit Tennis: Laver Cup What: men’s tennis tournament – Team Europe vs. Team World When: 19-21 September 2025 Where: Chase Center, San Francisco, California, USA Website: lavercup.com Darts: Hungarian Darts Trophy When: 19-21 September 2025 Where: MVM Dome, Budapest, Hungary Run Cheltenham When: 21 September 2025 Where: Cheltenham, Gloucestershire, England Events: half marathon, 10k, community mile Website: runcheltenham.com Berlin Marathon When: 21 September 2025 Where: Berlin, Germany Website: bmw-berlin-marathon.com Cycling: UCI Road World Championships When: 21-28 September 2025 Where: Kigali, Rwanda Website: ucikigali2025.rw Snooker: 2025 British Open When: 22-28 September 2025 Where: The Centaur, Cheltenham, England Tickets: worldsnookertour.seetickets.com Tennis: China Open When: 24 September to 5 October 2025 Where: Beijing, China Website: wtatennis.com Golf: 2025 Ryder Cup When: 26-28 September 2025 Where: Bethpage Black Course, NY, USA Website: rydercup.com/2025 Darts: Swiss Darts Trophy When: 26-28 September 2025 Where: St. Jakobshalle, Basel, Switzerland 13 Valleys Ultra When: 26-28 September 2025 Where: Lake District National Park, England Events: 2 Valleys (21km); 5 Valleys (55km); 7 Valleys (110km); 13 Valleys (180km) Website: 13valleysultra.com Loch Ness Marathon When: 28 September 2025 Where: Loch Ness, Scotland Website: lochnessmarathon.com Tennis: Rolex Shanghai Masters When: 30 September to 13 October 2025 Where: Shanghai, China Website: rolexshanghaimasters.com October 2025 sports events Tennis: China Open When: 24 September to 5 October 2025 Where: Beijing, China Website: wtatennis.com Tennis: Rolex Shanghai Masters When: 30 September to 13 October 2025 Where: Shanghai, China Website: rolexshanghaimasters.com F1 Singapore Grand Prix When: 3-5 October 2025 Where: Marina Bay Street Circuit Horse racing: Qatar Prix de l’Arc de Triomphe When: 4-5 October 2025 Where: Longchamps, Paris, France Website: francegalop-live.com Darts: BoyleSports World Grand Prix When: 6-12 October 2025 Where: Mattioli Arena, Leicester, England Tennis: Dongfeng Voyah Wuhan Open When: 6-12 October 2025 Where: Wuhan, China Website: wtatennis.com Horse racing: Dubai Future Champions Festival at Newmarket When: 10-11 October 2025 Where: Newmarket Racecourse, Newmarket, Suffolk, England Feature races: bet365 Fillies’ Mile, Darley Dewhurst Stakes, Cesarewitch Handicap Website and tickets: thejockeyclub.co.uk Budapest Marathon When: 11-12 October 2025 Where: Budapest, Hungary Events: marathon, marathon relay, 30km, 15km, 10km, 5km Website: marathon.runinbudapest.com Royal Parks Half Marathon When: 12 October 2025 Where: London, England Website: royalparkshalf.com Chicago Marathon When: 12 October 2025 Where: Chicago, USA Website: chicagomarathon.com Horse racing: Jump Season Opener at Carlisle When: 16 October 2025 Where: Carlisle Racecourse, Cumbria, England Website and tickets: thejockeyclub.co.uk F1 United States Grand Prix When: 17-19 October 2025 (sprint weekend) Where: Circuit of the Americas Darts: German Darts Championship When: 17-19 October 2025 Where: Halle 39, Hildesheim, Germany Horse racing: The Everest What: the world’s ‘richest race on turf’ When: 18 October 2024 Where: Royal Randwick Racecourse, Sydney, Australia Website: theeverest.com.au Toronto Waterfront Marathon When: 18-19 October 2025 Where: Toronto, Ontario, Canada Events: marathon; half marathon; 5k Website: torontowaterfrontmarathon.com Amsterdam Marathon When: 19 October 2025 Where: Amsterdam, Netherlands Events: Marathon, Half Marathon, Mini Marathon – De Borcht, Kids Run Olympisch Kwartier, Mini Marathon – Galileïplantsoen, Mini Marathon – Olympiaplein Website: tcsamsterdammarathon.eu Palma Marathon Mallorca When: 19 October 2025 Where: Palma, Mallorca, Spain Events: marathon; half marathon; 9k Website: palmademallorcamarathon.com Darts: Machineseeker European Championship When: 23-26 October 2025 Where: Westfalenhalle, Dortmund, Germany Horse racing: The Showcase at Cheltenham When: 24-25 October 2025 Where: Cheltenham Racecourse, Gloucestershire, England Website and tickets: thejockeyclub.co.uk F1 Mexican Grand Prix When: 24-26 October 2025 Where: Autódromo Hermanos Rodríguez Tennis: Rolex Paris Masters When: 25 October to 2 November 2025 Where: Paris, France Website: rolexparismasters.com Dublin Marathon When: 26 October 2025 Where: Dublin, Ireland Website: irishlifedublinmarathon.ie Venice Marathon When: 26 October 2025 Where: Venice, Italy Events: marathon; half marathon; 10k; family run Website: venicemarathon.it EVA Air Marathon When: 26 October 2025 Where: Taipei, Taiwan Events: marathon; half marathon; 10km; 3km Website: evaairrun.com Horse racing: Breeders’ Cup When: 31 October to 1 November 2025 Where: Del Mar, San Diego, California, US Website: breederscup.com November 2025 sports events Tennis: Rolex Paris Masters When: 25 October to 2 November 2025 Where: Paris, France Website: rolexparismasters.com Horse racing: Breeders’ Cup When: 31 October to 1 November 2025 Where: Del Mar, San Diego, California, US Website: breederscup.com Tennis: WTA Finals Riyadh When: 1-8 November Where: Riyadh, Saudi Arabia Website: wtatennis.com Horse racing: Melbourne Cup Carnival When: 1-8 November 2025 Where: Flemington Racecourse, Melbourne, Victoria, Australia Races: Derby Day (1 November); Cup Day (4 November); Oaks Day (6 November); Stakes Day (8 November) Website: vrc.com.au New York City Marathon When: 2 November 2025 Where: New York City, USA Website: nyrr.org Horse racing: Melbourne Cup Day When: 4 November 2025 Where: Flemington Racecourse, Melbourne, Victoria, Australia Website: vrc.com.au Men’s golf: Abu Dhabi Championship What: DP World Tour Rolex Series Event When: 6-9 November 2025 Where: Yas Links, Abu Dhabi, UAE Website: europeantour.com F1 Brazilian Grand Prix When: 7-9 November 2025 (sprint weekend) Where: Autódromo José Carlos Pace Darts: Mr Vegas Grand Slam of Darts When: 8-16 November 2025 Where: WV Active Aldersley, Wolverhampton, England Tennis: Nitto ATP Finals 2025 When: 9-16 November 2025 Where: Turin, Italy Website: nittoatpfinals.com Men’s golf: DP World Tour Championship What: DP World Tour Rolex Series Event When: 13-16 November 2025 Where: Jumeirah Golf Estates, Earth course, Dubai, UAE Website: europeantour.com Horse racing: The November Meeting at Cheltenham When: 14-16 November 2025 Where: Cheltenham Racecourse, Gloucestershire, England Featured races (jumps): Mucking Brilliant Paddy Power Handicap Chase, Paddy Power Gold Cup Chase, Unibet Greatwood Hurdle Website, tickets and hospitality: thejockeyclub.co.uk F1 Las Vegas Grand Prix When: 20-22 November 2025 Where: Las Vegas Street Circuit Darts: Ladbrokes Players Championship Finals When: 21-23 November 2025 Where: Butlin’s Minehead Resort, England Philadelphia Marathon Weekend When: 21-23 November 2025 Where: Philadelphia, Pennsylvania, US Events: marathon; half marathon; 8k; kids fun run Website: philadelphiamarathon.com Cricket: Ashes 1st Test – Australia vs. England When: 21-25 November 2025 Where: Perth Stadium, Perth, Australia Darts: Winmau World Youth Championship Final When: 23 November 2025 Where: Butlin’s Minehead Resort, England Torino City Marathon When: 23 November 2025 Where: Turin, Italy Events: marathon, half-marathon Website: torinocitymarathon.it Horse racing: Japan Cup When: 24 November 2025 Where: Tokyo Racecourse, Tokyo, Japan Website: japanracing.jp F1 Qatar Grand Prix When: 28-30 November 2025 (sprint weekend) Where: Losail International Circuit Football: Conmebol 2025 Copa Libertadores final When: 29 November 2025 Where: TBC 2025 UK Snooker Championship When: 29 November to 7 December 2025 Where: York Barbican, York, England Tickets: worldsnookertour.seetickets.com Tennis: Billie Jean King Cup Finals What: eight nation women’s tennis team tournament When: November 2025 Where: TBC Website: billiejeankingcup.com Tennis: Davis Cup Final 8 What: eight nation international men’s team event When: November 2025 Where: TBC Website: daviscup.com December 2025 sports events 2025 UK Snooker Championship When: 29 November to 7 December 2025 Where: York Barbican, York, England Tickets: worldsnookertour.seetickets.com Cricket: Ashes 2nd Test – Australia vs. England When: 4-8 December 2025 (Day/Night Test) Where: The Gabba, Brisbane, Australia Horse racing: Betfair Tingle Creek Festival at Sandown Park When: 5-6 December 2025 Where: Sandown Park, Surrey, England Feature races (jumps): Betfair Tingle Creek Chase, Henry VIII Novices’ Chase, Winter Novices’ Hurdle Website and tickets: thejockeyclub.co.uk F1 Abu Dhabi Grand Prix When: 5-7 December 2025 Where: Yas Marina Circuit Valencia Trinidad Alfonso Zurich Marathon 2025 When: 7 December 2025 Where: Valencia, Spain Website: valenciaciudaddelrunning.com Reggae Marathon When: 7 December 2025 Where: Negril, Jamaica Events: half-marathon; 10k; 5km Website: reggaemarathon.com Horse racing: The Christmas Meeting at Cheltenham When: 12-13 December 2025 Where: Cheltenham Racecourse, Gloucestershire, England Feature races (jumps): Glenfarclas Cross Country Chase; JCB Triumph Hurdle trial; Albert Bartlett Novices Hurdle trial Website and tickets: thejockeyclub.co.uk Honolulu Marathon When: 14 December 2025 Where: Honolulu, Hawaii, USA Website: honolulumarathon.org Cricket: Ashes 3rd Test – Australia vs. England When: 17-21 December 2025 Where: Adelaide Oval, Adelaide, Australia Men’s football: African Cup of Nations (AFCON) When: 21 December 2025 to 18 January 2026 Where: Morocco Horse racing: Boxing Day Racing at Aintree When: 26 December 2025 Where: Aintree Racecourse, Liverpool, England Website and tickets: thejockeyclub.co.uk Horse racing: Boxing Day Racing at Wincanton When: 26 December 2024 Where: Wincanton Racecourse, Somerset, England Website and tickets: thejockeyclub.co.uk Horse racing: Ladbrokes Christmas Festival at Kempton Park When: 26-27 December 2025 Where: Kempton Park Racecourse, Surrey, England Featured races (jump): King George VI Steeple Chase, Mare’s Handicap Hurdle Race, Wayward Lad Novices’ Steeple Chase, The Desert Orchid Chase Website, tickets and hospitality: thejockeyclub.co.uk Cricket: Ashes 4th Test – Australia vs. England When: 26-30 December 2025 Where: MCG, Melbourne, Australia Horse racing: Coral Welsh Grand National at Chepstow When: 27 December 2025 Where: Chepstow Racecourse, Chepstow, Wales Featured races (jump): Welsh National, Finale Junior Hurdle, Championship Bumper Website: chepstow-racecourse.co.uk Horse racing: New Year’s Eve Raceday at Warwick When: 31 December 2025 Where: Warwick Racecourse, England Website and tickets: thejockeyclub.co.uk Tennis: Next Gen ATP Finals presented by PIF When: December 2025 (TBC) Where: Jeddah, Saudi Arabia Website: nextgenatpfinals.com Snooker: 2025 Shoot Out When: December 2025 (TBC) Where: Mattioli Arena, Leicester, England Tickets: worldsnookertour.seetickets.com Snooker: Home Nation Series – 2025 Scottish Open When: December 2025 (TBC) Where: Meadowbank Stadium, Edinburgh, Scotland Tickets: worldsnookertour.seetickets.com Darts: PDC World Darts Championship 2025-2026 When: December 2025 to January 2026 (dates TBC) Where: Alexandra Palace, London, England January 2026 sports events Men’s football: African Cup of Nations (AFCON) When: 21 December 2025 to 18 January 2026 Where: Morocco Cricket: Ashes 5th Test – Australia vs. England When: 4-8 January 2026 Where: SCG, Sydney, Australia Editor’s note Sports Tourism News works in partnership with a number of affiliate companies, listed below. We may earn a commission should you choose to book any tickets or packages. All details are provided by affiliate partners. All events and prices subject to change. Our partners for sports tickets and stadium tours include: – Ticketmaster UK: general sports tickets – See Tickets: general sports tickets – The Jockey Club: horse racing event tickets – LastMinute.com: holidays, days out and experiences – Buy a Gift: stadium tours, venue tours, sporting days out – Red Letter Days: stadium tours, venue tours, sporting days out Posted in Calendars, Events Prev2025 sports business events and conferences calendar Next39 Hours to Kohima: a historic trek through India’s Naga Hills 1 Comment Próximos eventos deportivos internacionales – INFORMES DEL TIEMPO DIARIO Y OTROS TEMAS […] Sports Tourism News). […] August 29, 2024 at Log in to Reply Leave a Reply Cancel reply You must be logged in to post a comment. Sport + Travel Magazine: sign up for the newsletter First name or full name Email Site search Search for: SPORTS EVENTS CALENDAR Feb 15 All day Athletics: Keely Klassic Feb 16 16 February - 1 March Dubai Duty Free Tennis Championships 2025 Feb 18 All day F175 Live at The O2 – 2025 F1 season launch Feb 19 19 February - 9 March Cricket: ICC Men’s Champions Trophy 2025 Feb 22 22 February - 23 February Rugby union: Guinness Men’s Six Nations 2025 – round three View Calendar Editor’s note Sports Tourism News works with a number of affiliate partners__. Products are sold directly by agents and operators. We may earn a commission should you choose to book any tickets or packages. WordPress Theme | Viral News by HashThemes This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Cookie settingsACCEPT Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are as essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. SAVE & ACCEPT",
      "title": "Sports events in 2025 – global sporting events calendar 2025 Skip to content Monday, February 10Sports. Travel. Events Sport + Travel Magazine About Services Contact Home Latest Bucket List Holidays & Trips Hotels & Resorts Guides Events Calendar 2025 sports events 2025 sports business events Sports events in 2025 – global sporting calendar February 2, 2025 The global sports calendar for 2025 is packed with exciting events that promise unforgettable moments for fans worldwide. From iconic competitions that celebrate long-standing traditions to new tournaments that showcase emerging talent, the year will feature a dynamic array of sports and venues. The biggest sporting events in 2025 include the Women’s Rugby World Cup, the British & Irish Lions tour of Australia, the FIFA Club World Cup, the Ryder Cup, the Ashes, and the UEFA Women’s European Championship. Sports like tennis and golf will also shine with their annual tours, grand slams and majors. Additionally, motorsport fans can look forward to the Formula 1 season, which will continue to offer thrilling races across exotic locations, including a night race in Las Vegas and the iconic Monaco Grand Prix. This diverse line-up reflects the global passion for sports and the unique way each event brings people together, creating a vibrant calendar that offers something for every sports enthusiast. We will continue to update this page as events are confirmed. Any times stated below are GMT/GST. Main image: NFL at Tottenham Hotspur Stadium in London (Credit: Mike Starling/Sports Tourism News) Other sports calendars Tennis in 2025 Marathons in 2025 Half marathons in 2025 Horse racing in 2025 Formula 1 2025 race calendar Rugby union in 2025 Golf in 2025 Darts in 2025 Snooker in 2025 Subscribe to our monthly newsletter February 2025 sports events Darts: Winmau World Masters When: 30 January to 2 February 2025 Where: Arena MK, Milton Keynes, England Rugby union: Guinness Men’s Six Nations 2025 – round one Saturday 1 February 2025: Scotland vs. Italy (Scottish Gas Murrayfield Stadium, Edinburgh); Ireland vs. England (Aviva Stadium, Dublin) Darts: BetMGM Premier League Darts – Night 1 When: Thursday 6 February 2025 Where: The SSE Arena, Belfast, Northern Ireland Hiking: HIGHLANDER Adventure, Ras Al Khaimah When: 7-9 February 2025 Where: Jebel Jais Ras Al Khaimah, UAE Website: highlanderadventure.com and visitrasalkhaimah.com The 9th Asian Winter Games Harbin 2025 When: 7-14 February 2025 Where: Harbin, Heilongjiang, China Website: harbin2025.com Rugby union: Guinness Men’s Six Nations 2025 – round two Saturday 8 February 2025: Italy vs. Wales (Stadio Olimpico, Rome); England vs. France (Allianz Stadium, Twickenham) Sunday 9 February 2025: Scotland vs. Ireland (Scottish Gas Murrayfield Stadium, Edinburgh) Hong Kong Marathon When: 9 February 2025 Where: Hong Kong Website: hkmarathon.com NFL Super Bowl LIX When: 9 February 2025 Where: Caesars Superdome, New Orleans, Louisiana, USA Website: nfl.com and nolasuperbowl.com Ticket packages: onlocationexp.com Tennis: Qatar TotalEnergies Open 2025 When: 9-15 February 2025 Where: Doha, Qatar Website: wtatennis.com Snooker: Home Nation Series – 2025 Welsh Open When: 10-16 February 2025 Where: Venue Cymru Arena, Llandudno, Wales Tickets: worldsnookertour.seetickets.com Darts: BetMGM Premier League Darts – Night 2 When: Thursday 13 February 2025 Where: OVO Hydro, Glasgow, Scotland Athletics: Keely Klassic When: 15 February 2025 Where: Utilita Arena Birmingham, England Tickets: utilitaarenabham.co.uk Nascar: Daytona 500 When: 16 February 2025 Where: Daytona International Speedway, Daytona Beach, Florida, US Website: nascar.com Tennis: Dubai Duty Free Tennis Championships When: 16 February to 1 March 2025 Where: Dubai Duty Free Tennis Stadium, Dubai, UAE Website: dubaidutyfreetennischampionships.com Cricket: ICC Men’s Champions Trophy 2025 When: 19 February to 9 March 2025 Where: Pakistan and UAE Website: icc-cricket.com Darts: BetMGM Premier League Darts – Night 3 When: Thursday 20 February 2025 Where: 3Arena, Dublin, Ireland Horse racing: Saudi Cup When: 21-22 February 2025 Where: King Abdulaziz Racetrack, Riyadh, Saudi Arabia Website: jcsa.sa UK Athletics Indoor Championships 2025 When: 22-23 February 2025 Where: Utilita Arena, Birmingham, England Website: britishathletics.org.uk and utilitaarenabham.co.uk Rugby union: Guinness Men’s Six Nations 2025 – round three Saturday 22 February 2025: Wales vs. Ireland (Principality Stadium, Cardiff); England vs. Scotland (Allianz Stadium, Twickenham) Sunday 23 February 2025: Italy vs. France (Stadio Olimpico, Rome) Rock ’n’ Roll Las Vegas Half Marathon When: 22-23 February 2025 Where: Las Vegas, Nevada, US Website: runrocknroll.com Kilimanjaro Half Marathon When: 23 February 2025 Where: Moshi, Kilimanjaro, Tanzania Website: kilimanjaromarathon.com F1 2025 pre-season testing When: 26-28 February 2025 Where: Bahrain International Circuit Darts: BetMGM Premier League Darts – Night 4 When: Thursday 27 February 2025 Where: Westpoint Exeter, England Darts: Ladbrokes UK Open When: 28 February to 2 March 2025 Where: Butlin’s Minehead Resort, England Horse racing: Dubai World Cup Carnival When: January to March 2025 Where: Meydan Racecourse, Dubai, UAE Website: dubairacingclub.com March 2025 sports events Darts: Ladbrokes UK Open When: 28 February to 2 March 2025 Where: Butlin’s Minehead Resort, England Tokyo Marathon When: 2 March 2024 Where: Tokyo, Japan Website: marathon.tokyo Tennis: BNP Paribas Open Indian Wells When: 2-16 March 2025 Where: Indian Wells, California, US Website: bnpparibasopen.com Darts: BetMGM Premier League Darts – Night 5 When: Thursday 6 March 2025 Where: The Brighton Centre, Brighton, England Golf: Arnold Palmer Invitational presented by Mastercard What: PGA Tour Signature Event When: 6-9 March 2025 Where: Arnold Palmer’s Bay Hill Club & Lodge Orlando, Florida, US Website: arnoldpalmerinvitational.com Darts: Belgian Darts Open When: 7-9 March 2025 Where: Oktoberhallen, Wieze, Belgium Rugby union: Guinness Men’s Six Nations 2025 – round four Saturday 8 March 2025: Ireland vs. France (Aviva Stadium, Dublin); Scotland vs. Wales (Scottish Gas Murrayfield Stadium, Edinburgh) Sunday 9 March 2025: England vs. Italy (Allianz Stadium, Twickenham) Half-marathon: Harmonie Mutuelle Semi de Paris When: 9 March 2025 Where: Paris, France Website: harmoniemutuellesemideparis.com Horse racing: Cheltenham Festival When: 11-14 March 2025 Where: Cheltenham Racecourse, Cheltenham, England Feature races (jumps): Unibet Champion Hurdle, Betway Queen Mother Champion Chase, Ryanair Chase, Cheltenham Gold Cup Website, tickets and hospitality: thejockeyclub.co.uk YONEX All England Open Badminton Championships 2025 When: 11-16 March 2025 Where: Utilita Arena Birmingham, England Website: allenglandbadminton.com Darts: BetMGM Premier League Darts – Night 6 When: Thursday 13 March 2025 Where: Motorpoint Arena, Nottingham, England Golf: THE PLAYERS Championship What: PGA Tour When: 13-16 March 2025 Where: TPC Sawgrass (THE PLAYERS Stadium Course) Ponte Vedra Beach, Florida, US Website: theplayers.com F1 Australian Grand Prix When: 14-16 March 2025 Where: Albert Park Rugby union: Guinness Men’s Six Nations 2025 – round five Saturday 15 March 2025 Italy vs. Ireland (Stadio Olimpico, Rome) Wales vs. England (Principality Stadium, Cardiff) France vs. Scotland (Stade de France, Paris) Football: 2025 English Women’s League Cup final When: 15 March 2025 Where: Pride Park Stadium, Derby, England Football: 2025 Carabao Cup final When: 16 March 2025 Where: Wembley Stadium, London, England Website: efl.com Bath Half Marathon 2025 When: 16 March 2025 Where: Bath, England Website: bathhalf.co.uk Surrey Half Marathon When: 16 March 2025 Where: Woking, Surrey Website: surreyhalf.com United Airlines NYC Half When: 16 March 2025 Where: New York City, US Website: nyrr.org Run Rome The Marathon When: 16 March 2025 Where: Rome, Italy Website: runromethemarathon.com Los Angeles Marathon When: 16 March 2025 Where: Los Angeles, California, US Website: mccourtfoundation.org Tennis: Miami Open presented by Itaú When: 16-30 March 2025 Where: Miami, Florida, US Website: miamiopen.com Snooker: 2025 Players Championship When: 17-23 March 2025 Where: International Centre Telford, England Tickets: worldsnookertour.seetickets.com Baseball: MLB World Tour Tokyo Series Who: Los Angeles Dodgers vs. Chicago Cubs When: 18-19 March 2025 Where: Tokyo Dome, Tokyo, Japan Website: mlb.com Darts: BetMGM Premier League Darts – Night 7 When: Thursday 20 March 2025 Where: Utilita Arena, Cardiff, Wales Darts: German Darts Open When: 21-23 March 2025 Where: Lokhalle, Gottingen, Germany F1 Chinese Grand Prix When: 21-23 March 2025 (sprint weekend) Where: Shanghai International Circuit Guinness Women’s Six Nations round one Saturday 22 March: Ireland vs. France (Kingspan Stadium, Belfast); Scotland vs. Wales (Hive Stadium, Edinburgh) Sunday 23 March: England vs. Italy (LNER Community Stadium, York) Manulife Danang International Marathon When: 23 March 2025 Where: Da Nang, Vietnam Website: rundanang.com Darts: BetMGM Premier League Darts – Night 8 When: Thursday 27 March 2025 Where: Utilita Arena, Newcastle, England Côte Chalonnaise Wine Marathon When: 29 March 2025 Where: Burgundy, France Events: marathon, half marathon, 10km, and MARA3 (race with three runners – the first runner on the 42km, the second for the 21km and third on 10km. All three runners will then finish together) Website: marathondesvinsdelacotechalonnaise.fr Guinness Women’s Six Nations round two Saturday 29 March: France vs. Scotland (Stade Marcel-Deflandre, La Rochelle); Wales vs. England (Principality Stadium, Cardiff) Sunday 30 March: Italy vs. Ireland (Stadio Sergio Lanfranchi, Parma) Horse racing: Ulster National Raceday at Downpatrick What: seven races will be on the card, including the feature race, the Randox Ulster National When: 30 March 2025 Where: Downpatrick Racecourse, Co. Down, Northern Ireland Website: downpatrickracecourse.co.uk Snooker: 2025 Tour Championship When: 31 March to 6 April 2025 Where: Manchester Central, Manchester, England Tickets: worldsnookertour.seetickets.com Horse racing: Dubai World Cup Carnival When: January to March 2025 Where: Meydan Racecourse, Dubai, UAE Website: dubairacingclub.com April 2025 sports events Snooker: 2025 Tour Championship When: 31 March to 6 April 2025 Where: Manchester Central, Manchester Tickets: worldsnookertour.seetickets.com Darts: BetMGM Premier League Darts – Night 9 When: Thursday 3 April 2025 Where: Uber Arena, Berlin, Germany Horse racing: Grand National Festival at Aintree When: 3-5 April 2025 Where: Aintree Racecourse, Liverpool, England Feature races (jumps): JLT Melling Steeple Chase, Randox Health Topham Steeple Chase, Grand National Website, tickets and hospitality: thejockeyclub.co.uk Darts: International Darts Open When: 4-6 April 2025 Where: WT Energiesysteme Arena, Riesa, Germany F1 Japanese Grand Prix When: 4-6 April 2025 Where: Suzuka Circuit Horse racing: The Grand National at Aintree When: 5 April 2025 Where: Aintree Racecourse, Liverpool, England Website, tickets and hospitality: thejockeyclub.co.uk Horse racing: Dubai World Cup 2025 When: 5 April 2025 Where: Meydan Racecourse, Dubai, UAE Website: dubairacingclub.com Tennis: Rolex Monte-Carlo Masters When: 5-13 April 2025 Where: Monte-Carlo, Monaco Website: montecarlotennismasters.com Brighton Marathon Weekend When: 6 April 2025 Where: Brighton, England Events: marathon, 10km Website: brightonmarathonweekend.co.uk London Landmarks Half Marathon When: 6 April 2025 Where: Westminster and the City, London, England Website: llhm.co.uk Darts: BetMGM Premier League Darts – Night 10 When: Thursday 10 April 2025 Where: AO Arena, Manchester, England Men’s golf major: The Masters Tournament When: 10-13 April 2025 Where: Augusta National GC, Augusta, Georgia, US Website: masters.com F1 Bahrain Grand Prix When: 11-13 April 2025 Where: Bahrain International Circuit Horse racing: Scottish Grand National Festival at Ayr When: 12 April 2025 Where: Ayr Racecourse, Scotland Feature races (jumps): Coral Scottish Champion Hurdle, Coral Scottish Grand National Website: scottishgrandnationalfestival.co.uk Guinness Women’s Six Nations round three Saturday 12 April: France vs. Wales; Ireland v England (Virgin Media Park, Cork) Sunday 13 April: Scotland vs. Italy (Hive Stadium, Edinburgh) NN Marathon Rotterdam When: 12-13 April 2025 Where: Rotterdam, Netherlands Website: nnmarathonrotterdam.nl ABP Newport Marathon Festival When: 13 April 2025 Where: Newport, Wales, UK Events: marathon, half marathon, 10K, mile Website: newportwalesmarathon.co.uk Schneider Electric Marathon de Paris When: 13 April 2025 Where: Paris, France Website: schneiderelectricparismarathon.com Darts: BetMGM Premier League Darts – Night 11 When: Thursday 17 April 2025 Where: Rotterdam Ahoy, Rotterdam, Netherlands Golf: RBC Heritage What: PGA Tour Signature Event When: 17-20 April 2025 Where: Harbour Town Golf Links Hilton Head Island, South Carolina, US Website: rbcheritage.com F1 Saudi Arabian Grand Prix When: 18-20 April 2025 Where: Jeddah Corniche Circuit Guinness Women’s Six Nations round four Saturday 19 April: Italy vs. France (Stadio Sergio Lanfranchi, Parma); England vs. Scotland (Mattioli Woods Welford Road, Leicester) Sunday 20 April: Wales vs. Ireland (Rodney Parade, Newport) Darts: German Darts Grand Prix When: 19-21 April 2025 Where: Zenith, Munich, Germany Snooker: 2025 World Snooker Championship When: 19 April to 5 May 2025 Where: The Crucible, Sheffield, England Tickets: worldsnookertour.seetickets.com Run the Great Wall – Jinshanling Great Wall When: 20 April 2025 Where: Jinshanling Great Wall Scenic Area, China Events: 10km, half marathon and full marathon Website: rungreatwall.com Boston Marathon When: Monday 21 April 2025 Where: Boston, USA Website: baa.org Tennis: Mutua Madrid Open When: 21 April to 4 May 2025 Where: La Caja Mágica, Madrid, Spain Website: mutuamadridopen.com Darts: BetMGM Premier League Darts – Night 12 When: Thursday 24 April 2025 Where: M&S Bank Arena, Liverpool, England American football: 2025 NFL Draft When: 24-26 April 2025 Where: Green Bay, Wisconsin, US Women’s golf major: The Chevron Championship When: 24-27 April 2025 Where: The Club at Carlton Woods in The Woodlands, Texas, US Website: thechevronchampionship.com Darts: Austrian Darts Open When: 25-27 April 2025 Where: Premstättner Halle, Graz, Austria Guinness Women’s Six Nations round five When: Saturday 26 April Italy vs. Wales (Stadio Sergio Lanfranchi, Parma) Scotland vs. Ireland (Hive Stadium, Edinburgh) England vs. France (Allianz Stadium, Twickenham) Horse racing: Bet365 Jump Finale at Sandown Park When: 26 April 2025 Where: Sandown Park, Surrey, England Website and tickets: thejockeyclub.co.uk Cycling: Etape Loch Ness What: Scotland’s largest closed-road cycle sportive When: 27 April 2025 Where: Loch Ness, Scotland Website: etapelochness.com Nashville Rock ‘n’ Roll Running Series When: 26-27 April 2025 Where: Nashville, Tennessee, US What: Marathon, Half Marathon, 10K, 5K, 1 Mile, Kids Rock, Doggie Dash Website: runrocknroll.com London Marathon When: 27 April 2025 Where: London, England Website: tcslondonmarathon.com Tennis: Internazionali BNL d’Italia What: ATP Masters 1000 When: 29 April to 18 May 2025 Where: Rome, Italy Website: internazionalibnlditalia.com The Sierra Leone Marathon Organisers: Street Child UK (registered charity) When: 30 April 2025 Where: Northern Sierra Leone Website: street-child.co.uk May 2025 sports events Snooker: 2025 World Snooker Championship When: 19 April to 5 May 2025 Where: The Crucible, Sheffield, England Tickets: worldsnookertour.seetickets.com Tennis: Mutua Madrid Open When: 21 April to 4 May 2025 Where: La Caja Mágica, Madrid, Spain Website: mutuamadridopen.com Tennis: Internazionali BNL d’Italia When: 29 April to 18 May 2025 Where: Rome, Italy Website: internazionalibnlditalia.com BetMGM Premier League Darts 2025 When: Thursday 1 May 2025 Where: Utilita Arena Birmingham, England Darts: European Darts Grand Prix When: 2-4 May 2025 Where: Glaspalast, Sindelfingen, Germany F1 Miami Grand Prix When: 2-4 May 2025 (sprint weekend) Where: Miami International Autodrome Horse racing: Kentucky Derby When: 3 May 2025 Where: Churchill Downs Racetrack, Louisville, Kentucky, US Website: kentuckyderby.com Rugby league: Super League Magic Weekend 2025 What: six matches in one stadium across two days When: 3-4 May 2025 Where: St James’ Park, Newcastle upon Tyne, England Website: superleague.co.uk Belfast City Marathon When: 4 May 2025 Where: Belfast, Northern Ireland Website: belfastcitymarathon.com Darts: BetMGM Premier League Darts – Night 14 When: Thursday 8 May 2025 Where: First Direct Arena, Leeds, England Golf: Truist Championship What: PGA Tour Signature Event When: 8-11 May 2025 Where: The Philadelphia Cricket Club (Wissahickon Course), US Website: truistchampionship.com Cycling: Giro d’Italia 2025 When: 9 May to 1 June 2025 Where: Albania and Italy Website: giroditalia.it Great Bristol Run Half Marathon When: 11 May 2025 Where: Bristol, England Website: greatrun.org Men’s golf major: PGA Championship When: 15-18 May 2025 Where: Quail Hollow Club, Charlotte, North Carolina, US Website: pgachampionship.com F1 Emilia-Romagna Grand Prix When: 16-18 May 2025 Where: Autodromo Enzo e Dino Ferrari Darts: BetMGM Premier League Darts – Night 15 When: Thursday 15 May 2025 Where: P&J Live, Aberdeen, Scotland Football: English FA Cup final 2025 When: Saturday 17 May 2025 Where: Wembley Stadium, London, England Website: thefa.com Football: 2025 English Women’s FA Cup final When: Sunday 18 May 2025 Where: Wembley Stadium, London Horse racing: Preakness Stakes When: 17 May 2025 Where: Pimlico Race Course, Baltimore, Maryland, US Website: preakness.com Great Ocean Road Running Festival When: 17-18 May 2025 Where: Melbourne, Australia Website: greatoceanroadrunfest.com.au AJ Bell Great Manchester Run When: 18 May 2025 Where: Manchester, England Events: half marathon, 10km Website: greatrun.org Tennis grand slam: French Open Roland-Garros When: 19 May to 8 June 2025 Where: Stade Roland-Garros, Paris, France Website: rolandgarros.com Men’s football: 2025 Uefa Europa League final When: 21 May 2025 Where: San Mamés Stadium, Bilbao, Spain Darts: BetMGM Premier League Darts – Night 16 When: Thursday 22 May 2025 Where: Utilita Arena, Sheffield, England Rugby union: EPCR Challenge Cup final When: Friday 23 May 2025 Where: Principality Stadium, Cardiff, Wales Darts: Dutch Darts Championship When: 23-25 May 2025 Where: Autotron, Rosmalen, Netherlands F1 Monaco Grand Prix When: 23-25 May 2025 Where: Circuit de Monaco MotoGP British Grand Prix 2025 When: 23-25 May 2025 Where: Silverstone Circuit, Northamptonshire, England Website: silverstone.co.uk Rugby union: Investec Champions Cup final When: 24 May 2025 Where: Principality Stadium, Cardiff, Wales Football: Uefa Women’s Champions League final When: 24 May 2025 Where: Estádio José Alvalade, Lisbon, Portugal Edinburgh Marathon When: 25 May 2025 Where: Edinburgh, Scotland Website: edinburghmarathon.com IndyCar: Indianapolis 500 When: 25 May 2025 Where: Indianapolis Motor Speedway, Speedway, Indiana, US Website: indianapolismotorspeedway.com Padel World Summit 2025 When: 27-29 May 2025 Where: Fira de Barcelona, Spain Website: padelsummit.com Men’s football: 2025 Uefa Europa Conference League final When: 28 May 2024 Where: Wrocław Stadium, Wrocław, Poland Darts: BetMGM Premier League Darts – Play-Offs When: Thursday 29 May 2025 Where: The O2, London, England Women’s golf major: US Women’s Open presented by Ally When: 29 May to 1 June 2025 Where: Erin Hills, Erin, Wisconsin, US Website: uswomensopen.com Golf: the Memorial Tournament presented by Workday What: PGA Tour Signature Event When: 29 May to 1 June 2025 Where: Muirfield Village Golf Club, Dublin, Ohio, US Website: thememorialtournament.com F1 Spanish Grand Prix When: 30 May to 1 June 2025 Where: Circuit de Barcelona-Catalunya Darts: European Darts Open When: 30 May to 1 June 2025 Where: Ostermann-Arena, Leverkusen, Germany Men’s football: 2025 Uefa Champions League finalWhen: 31 May 2025 Where: Allianz Arena, Munich, Germany Icefjord Midnight Marathon When: 31 May 2025 Where: Ilulissat, Greenland Website: icefjord-midnight-marathon.com Stockholm Marathon When: 31 May 2025 Where: Stockholm, Sweden Website: stockholmmarathon.se June 2025 sports events Cycling: Giro d’Italia 2025 When: 9 May to 1 June 2025 Where: Albania and Italy Website: giroditalia.it Tennis grand slam: French Open Roland-Garros When: 19 May to 8 June 2025 Where: Stade Roland-Garros, Paris, France Website: rolandgarros.com Women’s golf major: US Women’s Open presented by Ally When: 29 May to 1 June 2025 Where: Erin Hills, Erin, Wisconsin, US Website: uswomensopen.com Golf: the Memorial Tournament presented by Workday What: PGA Tour Signature Event When: 29 May to 1 June 2025 Where: Muirfield Village Golf Club, Dublin, Ohio, US Website: thememorialtournament.com F1 Spanish Grand Prix When: 30 May to 1 June 2025 Where: Circuit de Barcelona-Catalunya Darts: European Darts Open When: 30 May to 1 June 2025 Where: Ostermann-Arena, Leverkusen, Germany NBA Finals When: 5-22 June 2025 Website: nba.com Horse racing: Epsom Derby Festival When: 6-7 June 2025 Where: Epsom Downs, Surrey, England Feature races (flat): The Oaks, The Derby Website and tickets: thejockeyclub.co.uk Darts: Mr Vegas Nordic Darts Masters When: 6-7 June 2025 Where: Forum Copenhagen, Denmark KLM Aruba Marathon When: 7-8 June 2025 Where: Aruba What: marathon, half-marathon, 10km, 5kn Website: klmarubamarathon.com Horse racing: Belmont Stakes When: 7 June 2025 Where: Belmont Park‎, ‎Elmont, New York‎, US Website: belmontstakes.com Comrades Marathon When: 8 June 2025 Where: Durban to Pietermaritzburg, South Africa What: 89km ultra-marathon Website: comrades.com Men’s golf major: US Open When: 12-15 June 2025 Where: Oakmont CC, Oakmont, Pennsylvania, US Website: usopen.com Darts: BetVictor World Cup of Darts When: 12-15 June 2025 Where: Eissporthalle, Frankfurt, Germany F1 Canadian Grand Prix When: 13-15 June 2025 Where: Circuit Gilles Villeneuve Rugby union: Gallagher Premiership Final When: 14 June 2025 Where: Allianz Stadium, Twickenham, England Website: premiershiprugby.com Big Five Marathon When: 14 June 2025 Where: South Africa Website: big-five-marathon.com Skye Half Marathon When: 14 June 2025 Where: Isle of Skye, Scotland Website: skyehalfmarathon.com FIFA Club World Cup 2025 When: Saturday 14 June to Sunday 13 July 2025 Where: United States Website: fifa.com Horse racing: Royal Ascot When: 17-21 June 2025 Where: Ascot Racecourse, Ascot, England Feature races (flat): Gold Cup, St James’s Palace Stakes, Queen Anne Stakes, Prince of Wales’s Stakes, Coronation Stakes, Golden Jubilee Stakes Website: ascot.co.uk Women’s golf major: KPMG Women’s PGA Championship When: 19-22 June 2025 Where: Fields Ranch East at PGA Frisco, Frisco, Texas, US Website: kpmgwomenspgachampionship.com Golf: Travelers Championship What: PGA Tour Signature Event When: 19-22 June 2025 Where: TPC River Highlands, Cromwell, Connecticut, US Website: travelerschampionship.com Rugby union: British & Irish Lions vs. Argentina When: 20 June 2025 Where: Aviva Stadium, Dublin, Ireland Website: lionsrugby.com Rugby union: England XV vs. France XV When: Saturday 21 June 2025 Where: Allianz Stadium, Twickenham, England Website: englandrugby.com Midnight Sun Marathon When: 21 June 2025 Where: Tromsø, Norway Events: Marathon; Mizuno Half Marathon; Coop Mila (10km); Mini-marathon (4.2km); Children’s race (800m) Website: msm.no Darts: bet365 US Darts Masters When: 27-28 June 2025 Where: The Theater at Madison Square Garden, New York, US F1 Austrian Grand Prix When: 27-29 June 2025 Where: Red Bull Ring Darts: bet365 North American Darts Championship When: 28 June 2025 Where: The Theater at Madison Square Garden, New York, US Iceland Volcano Marathon When: 28 June 2025 Where: near Lake Mývatn, Iceland Website: iceland-volcano-marathon.com Tennis grand slam: The Championships Wimbledon When: 30 June to 13 July 2025 Where: All England Lawn Tennis & Croquet Club, London, England Website: wimbledon.com July 2025 sports events FIFA Club World Cup 2025 When: Saturday 14 June to Sunday 13 July 2025 Where: United States Website: fifa.com Tennis grand slam: The Championships Wimbledon When: 30 June to 13 July 2025 Where: All England Lawn Tennis & Croquet Club, London, England Website: wimbledon.com UEFA Women’s Euro 2025 When: 2-27 July 2025 Where: Switzerland Host cities: Basel (opening game and final), Bern, Geneva, Zurich, St. Gallen, Lucerne Website: uefa.com/womenseuro Horse racing: Old Newton Cup Festival at Haydock Park When: 3-5 July 2025 Where: Haydock Park, Merseyside, England Website and tickets: thejockeyclub.co.uk Darts: Superbet Poland Darts Masters When: 4-5 July 2025 Where: PreZero Arena Gliwice, Poland F1 British Grand Prix When: 4-6 July 2025 Where: Silverstone Circuit Rugby union: Argentina vs. England When: 5 July Where: Estadio Jorge Luis Hirschi, Buenos Aires, Argentina Website: englandrugby.com Men’s cycling: Tour de France When: 5-27 July 2025 Where: Lille to Paris, France Horse racing: The July Festival at Newmarket When: 10-12 July 2025 Where: Newmarket Racecourse, Newmarket, England Feature races (flat): Darley July Cup, Princess of Wales’s Stakes, Tattersalls Falmouth Stakes Website and tickets: thejockeyclub.co.uk Women’s golf major: Amundi Evian Championship When: 10-13 July 2025 Where: Evian Resort Golf Club, Evian-les-Bains, France Website: amundi.evianchampionship.com Men’s golf: Genesis Scottish Open What: DP World Tour Rolex Series Event When: 10-13 July 2025 Where: The Renaissance Club, North Berwick, Scotland Website: europeantour.com MOTUL FIM Superbike World Championship UK round When: 11-13 July 2025 Where: Donington Park Circuit, Castle Donington, Derbyshire, England Website: worldsbk.com Darts: Baltic Sea Darts Open When: 11-13 July 2025 Where: Wunderino Arena, Kiel, Germany Baseball: MLB All-Star Game What: All-Star Week, 95th MLB All-Star Game, T-Mobile Home Run Derby, All-Star Futures Game, MLB Draft When: 11-15 July 2025 Where: Atlanta, Georgia, US Website: mlb.com World Aquatics Championships 2025 Singapore When: 11 July to 3 August 2025 Where: Singapore Sports: Swimming, Water Polo, Diving, Artistic Swimming, Open Water Swimming, High Diving Website: worldaquatics.com Rugby union: Argentina vs. England When: 12 July Where: Estadio San Juan del Bigentenario, San Juan, Argentina Website: englandrugby.com FIFA Club World Cup Final 2025 When: 13 July 2025 Where: MetLife Stadium, New York New Jersey, US Men’s golf major: 153rd Open Championship When: 13-20 July 2025 Where: Royal Portrush Golf Club, County Antrim, Northern Ireland Website: theopen.com Zagori Mountain Running 2024 When: 18-20 July 2025 Where: Zagori, Greece Events: 80km, 44+km marathon, 21km, 10km Website: zagorirace.gr Horse racing: Summer Plate Ladies Day at Market Rasen When: 19 July 2025 Where: Market Rasen, Lincolnshire, England Feature races (jumps): Summer Plate Grade 3 Handicap Chase, Summer Handicap Hurdle Website and tickets: thejockeyclub.co.uk Rugby union: Australia vs. British & Irish Lions – 1st Test When: 19 July 2025 Where: Suncorp Stadium, Brisbane, Australia Website: lionsrugby.com SailGP: Emirates Great Britain Sail Grand Prix When: 19-20 July 2025 Where: Portsmouth, England Website: sailgp.com Darts: Betfred World Matchplay When: 19-27 July 2025 Where: Winter Gardens, Blackpool, England Horse racing: King George Weekend at Ascot When: 25-26 July 2025 Where: Ascot Racecourse, Ascot, England Feature races (flat): King George VI and Queen Elizabeth Stakes Website: ascot.co.uk F1 Belgian Grand Prix When: 25-27 July 2025 (sprint weekend) Where: Spa-Francorchamps Australian Outback Marathon When: 26 July 2025 Where: Uluru, Australia Website: australianoutbackmarathon.com Rugby union: Australia vs. British & Irish Lions – 2nd Test When: 26 July 2025 Where: Melbourne Cricket Ground, Melbourne, Australia Website: lionsrugby.com Darts: Betfred Women’s World Matchplay When: 27 July 2025 Where: Winter Gardens, Blackpool, England San Francisco Marathon When: 26-27 July 2025 Where: San Francisco, California, US Events: marathon; half marathon (bridge half/city half); 10k; 5k; family 1k Website: thesfmarathon.com Women’s cycling: 2025 Tour de France Femmes When: 26 July to 3 August 2025 Where: France Tennis: The National Bank Open presented by Rogers When: 26 July to 7 August 2025 Where: Toronto, Canada Website: nationalbankopen.com San Francisco Half Marathon When: 27 July 2025 Where: San Francisco, California, US Events: Bridge Half Marathon (first half of marathon); City Half Marathon (second half) Website: thesfmarathon.com Horse racing: Qatar Goodwood Festival What: “Glorious Goodwood” is a flat racing festival When: 29 July-2 August 2025 Where: Goodwood Racecourse, West Sussex, England Feature races (flat): Al Shaqab Goodwood Cup, Qatar Sussex Stakes, King George Qatar Stakes Website: goodwood.com Women’s golf major: AIG Women’s Open When: 31 July to 3 August 2025 Where: Royal Porthcawl, Porthcawl, Wales Website: aigwomensopen.com August 2025 sports events World Aquatics Championships 2025 Singapore When: 11 July to 3 August 2025 Where: Singapore Sports: Swimming, Water Polo, Diving, Artistic Swimming, Open Water Swimming, High Diving Website: worldaquatics.com Women’s cycling: 2025 Tour de France Femmes When: 26 July to 3 August 2025 Where: France Tennis: The National Bank Open presented by Rogers When: 26 July to 7 August 2025 Where: Toronto, Canada Website: nationalbankopen.com Horse racing: Qatar Goodwood Festival What: “Glorious Goodwood” is a flat racing festival When: 29 July-2 August 2025 Where: Goodwood Racecourse, West Sussex, England Feature races (flat): Al Shaqab Goodwood Cup, Qatar Sussex Stakes, King George Qatar Stakes Website: goodwood.com Women’s golf major: AIG Women’s Open When: 31 July to 3 August 2025 Where: Royal Porthcawl, Porthcawl, Wales Website: aigwomensopen.com F1 Hungarian Grand Prix When: 1-3 August 2025 Where: Hungaroring Festival of Sport 2025 When: 1-4 August 2025 Where: Packington Estate, Warwickshire, England Website: festivalofsportuk.com Rugby union: Australia vs. British & Irish Lions – 3rd Test When: 2 August 2025 Where: Accor Stadium, Sydney, Australia Website: lionsrugby.com UK Athletics Outdoor Championships 2025 When: 2-3 August 2025 Where: Alexander Stadium, Birmingham, England Website: britishathletics.org.uk Tennis: Cincinnati Open When: 5-18 August 2025 Where: Cincinnati, Ohio, US Website: cincinnatiopen.com Golf: FedEx St. Jude Championship What: PGA Tour FedExCup Playoffs When: 7-10 August 2025 Where: TPC Southwind, Memphis, Tennessee, US Website: fedexchampionship.com The World Games 2025 Chengdu When: 7-17 August 2025 Where: Chengdu, China Website: theworldgames.org Darts: Australian Darts Masters When: 8-9 August 2025 Where: WIN Entertainment Centre, Wollongong, Australia Football: 2025 Uefa Super Cup final What: Uefa Champions League winners vs. Uefa Europa League winners When: 13 August 2025 Where: Stadio Friuli, Udine, Italy Golf: BMW Championship What: PGA Tour FedExCup Playoffs When: 14-17 August 2025 Where: Caves Valley Golf Club, Owings Mills, Maryland, US Website: bmwchampionship.com Darts: NZ Darts Masters When: 15-16 August 2025 Where: Spark Arena, Auckland, New Zealand Horse racing: York Ebor Festival When: 20-23 August 2025 Where: York Racecourse, York, England Feature races: Juddmonte International, Darley Yorkshire Oaks, Coolmore Nunthorpe, York Ebor Tickets: yorkracecourse.co.uk Golf: TOUR Championship What: PGA Tour When: 21-25 August 2025 Where: East Lake Golf Club, Atlanta, Georgia, US Website: tourchampionship.com Women’s Rugby World Cup 2025 When: 22 August to 27 September 2025 Where: England Website: rugbyworldcup.com Antrim Coast Half Marathon When: 24 August 2025 Where: Antrim Coast Road, County Antrim, Northern Ireland Website: antrimcoasthalfmarathon.com Tennis grand slam: US Open When: 25 August to 7 September 2025 Where: USTA Billie Jean King National Tennis Center, New York City, US Website: usopen.org F1 Dutch Grand Prix When: 29-31 August 2025 Where: Circuit Zandvoort Darts: Flanders Darts Trophy When: 29-31 August 2025 Where: Antwerp Xpo, Belgium Horse racing: BetMGM Summer Celebration Saturday at Sandown Park When: 30 August 2025 Where: Sandown Park, Surrey, England Feature races: Solario Stakes Website and tickets: thejockeyclub.co.uk TCS Sydney Marathon When: 31 August 2025 Where: Sydney, Australia Events: marathon, 10km, 4.2km Website: tcssydneymarathon.com Kauai Marathon and Half Marathon When: 31 August 2025 Where: Kauai island, Hawaii, US Website: thekauaimarathon.com September 2025 sports events Women’s Rugby World Cup 2025 When: 22 August to 27 September 2025 Where: England Website: rugbyworldcup.com Tennis grand slam: US Open When: 25 August to 7 September 2025 Where: USTA Billie Jean King National Tennis Center, New York City, US Website: usopen.org Horse racing: Sprint Cup Celebration at Haydock Park When: 4-6 September 2025 Where: Haydock Park, Lancashire, England Feature races: Betfair Sprint Cup Website and tickets: thejockeyclub.co.uk F1 Italian Grand Prix When: 5-7 September 2025 Where: Autodromo Nazionale Monza Darts: Czech Darts Open When: 5-7 September 2025 Where: PVA EXPO Prague, Czech Republic Petra Desert Marathon When: 6 September 2025 Where: Petra, Jordan Website: petra-desert-marathon.com Médoc Marathon When: 6 September 2025 Where: the vineyards of the Médoc in the Gironde, France Website: marathondumedoc.com Great North Run When: 7 September 2025 Where: Newcastle to South Shields, England Website: greatrun.org The Big Half London Organisers: London Marathon Events When: 7 September 2025 Where: Tower Bridge to Cutty Sark, London, England Races: half marathon, New Balance Big Relay, Big Mile Website: thebighalf.co.uk Horse racing: St Leger Festival at Doncaster When: 11-14 September 2025 Where: Doncaster Racecourse Featured races (flat): Doncaster Cup; St Leger Stakes; Leger Legends Day charity race Website: doncaster-racecourse.co.uk Men’s golf: BMW PGA Championship What: DP World Tour Rolex Series Event When: 11-14 September 2025 Where: Wentworth Club, Virginia Water, Surrey, England Website: europeantour.com Darts: Jack’s World Series of Darts Finals When: 12-14 September 2025 Where: AFAS Live, Amsterdam, Netherlands Tallinn Marathon When: 12-14 September 2025 Where: Tallinn, Estonia Events: marathon; half marathon; 10k; 5k Website: jooks.ee World Athletics Championships Tokyo 2025 When: 13-21 September 2025 Where: Tokyo, Japan Website: worldathletics.org Copenhagen Half Marathon When: 14 September 2025 Where: Copenhagen, Denmark Website: cphhalf.dk Snooker: Home Nation Series – 2025 English Open When: 15-21 September 2025 Where: Brentwood Leisure Centre, Essex, England Tickets: worldsnookertour.seetickets.com F1 Azerbaijani Grand Prix When: 19-21 September 2025 Where: Baku City Circuit Tennis: Laver Cup What: men’s tennis tournament – Team Europe vs. Team World When: 19-21 September 2025 Where: Chase Center, San Francisco, California, USA Website: lavercup.com Darts: Hungarian Darts Trophy When: 19-21 September 2025 Where: MVM Dome, Budapest, Hungary Run Cheltenham When: 21 September 2025 Where: Cheltenham, Gloucestershire, England Events: half marathon, 10k, community mile Website: runcheltenham.com Berlin Marathon When: 21 September 2025 Where: Berlin, Germany Website: bmw-berlin-marathon.com Cycling: UCI Road World Championships When: 21-28 September 2025 Where: Kigali, Rwanda Website: ucikigali2025.rw Snooker: 2025 British Open When: 22-28 September 2025 Where: The Centaur, Cheltenham, England Tickets: worldsnookertour.seetickets.com Tennis: China Open When: 24 September to 5 October 2025 Where: Beijing, China Website: wtatennis.com Golf: 2025 Ryder Cup When: 26-28 September 2025 Where: Bethpage Black Course, NY, USA Website: rydercup.com/2025 Darts: Swiss Darts Trophy When: 26-28 September 2025 Where: St. Jakobshalle, Basel, Switzerland 13 Valleys Ultra When: 26-28 September 2025 Where: Lake District National Park, England Events: 2 Valleys (21km); 5 Valleys (55km); 7 Valleys (110km); 13 Valleys (180km) Website: 13valleysultra.com Loch Ness Marathon When: 28 September 2025 Where: Loch Ness, Scotland Website: lochnessmarathon.com Tennis: Rolex Shanghai Masters When: 30 September to 13 October 2025 Where: Shanghai, China Website: rolexshanghaimasters.com October 2025 sports events Tennis: China Open When: 24 September to 5 October 2025 Where: Beijing, China Website: wtatennis.com Tennis: Rolex Shanghai Masters When: 30 September to 13 October 2025 Where: Shanghai, China Website: rolexshanghaimasters.com F1 Singapore Grand Prix When: 3-5 October 2025 Where: Marina Bay Street Circuit Horse racing: Qatar Prix de l’Arc de Triomphe When: 4-5 October 2025 Where: Longchamps, Paris, France Website: francegalop-live.com Darts: BoyleSports World Grand Prix When: 6-12 October 2025 Where: Mattioli Arena, Leicester, England Tennis: Dongfeng Voyah Wuhan Open When: 6-12 October 2025 Where: Wuhan, China Website: wtatennis.com Horse racing: Dubai Future Champions Festival at Newmarket When: 10-11 October 2025 Where: Newmarket Racecourse, Newmarket, Suffolk, England Feature races: bet365 Fillies’ Mile, Darley Dewhurst Stakes, Cesarewitch Handicap Website and tickets: thejockeyclub.co.uk Budapest Marathon When: 11-12 October 2025 Where: Budapest, Hungary Events: marathon, marathon relay, 30km, 15km, 10km, 5km Website: marathon.runinbudapest.com Royal Parks Half Marathon When: 12 October 2025 Where: London, England Website: royalparkshalf.com Chicago Marathon When: 12 October 2025 Where: Chicago, USA Website: chicagomarathon.com Horse racing: Jump Season Opener at Carlisle When: 16 October 2025 Where: Carlisle Racecourse, Cumbria, England Website and tickets: thejockeyclub.co.uk F1 United States Grand Prix When: 17-19 October 2025 (sprint weekend) Where: Circuit of the Americas Darts: German Darts Championship When: 17-19 October 2025 Where: Halle 39, Hildesheim, Germany Horse racing: The Everest What: the world’s ‘richest race on turf’ When: 18 October 2024 Where: Royal Randwick Racecourse, Sydney, Australia Website: theeverest.com.au Toronto Waterfront Marathon When: 18-19 October 2025 Where: Toronto, Ontario, Canada Events: marathon; half marathon; 5k Website: torontowaterfrontmarathon.com Amsterdam Marathon When: 19 October 2025 Where: Amsterdam, Netherlands Events: Marathon, Half Marathon, Mini Marathon – De Borcht, Kids Run Olympisch Kwartier, Mini Marathon – Galileïplantsoen, Mini Marathon – Olympiaplein Website: tcsamsterdammarathon.eu Palma Marathon Mallorca When: 19 October 2025 Where: Palma, Mallorca, Spain Events: marathon; half marathon; 9k Website: palmademallorcamarathon.com Darts: Machineseeker European Championship When: 23-26 October 2025 Where: Westfalenhalle, Dortmund, Germany Horse racing: The Showcase at Cheltenham When: 24-25 October 2025 Where: Cheltenham Racecourse, Gloucestershire, England Website and tickets: thejockeyclub.co.uk F1 Mexican Grand Prix When: 24-26 October 2025 Where: Autódromo Hermanos Rodríguez Tennis: Rolex Paris Masters When: 25 October to 2 November 2025 Where: Paris, France Website: rolexparismasters.com Dublin Marathon When: 26 October 2025 Where: Dublin, Ireland Website: irishlifedublinmarathon.ie Venice Marathon When: 26 October 2025 Where: Venice, Italy Events: marathon; half marathon; 10k; family run Website: venicemarathon.it EVA Air Marathon When: 26 October 2025 Where: Taipei, Taiwan Events: marathon; half marathon; 10km; 3km Website: evaairrun.com Horse racing: Breeders’ Cup When: 31 October to 1 November 2025 Where: Del Mar, San Diego, California, US Website: breederscup.com November 2025 sports events Tennis: Rolex Paris Masters When: 25 October to 2 November 2025 Where: Paris, France Website: rolexparismasters.com Horse racing: Breeders’ Cup When: 31 October to 1 November 2025 Where: Del Mar, San Diego, California, US Website: breederscup.com Tennis: WTA Finals Riyadh When: 1-8 November Where: Riyadh, Saudi Arabia Website: wtatennis.com Horse racing: Melbourne Cup Carnival When: 1-8 November 2025 Where: Flemington Racecourse, Melbourne, Victoria, Australia Races: Derby Day (1 November); Cup Day (4 November); Oaks Day (6 November); Stakes Day (8 November) Website: vrc.com.au New York City Marathon When: 2 November 2025 Where: New York City, USA Website: nyrr.org Horse racing: Melbourne Cup Day When: 4 November 2025 Where: Flemington Racecourse, Melbourne, Victoria, Australia Website: vrc.com.au Men’s golf: Abu Dhabi Championship What: DP World Tour Rolex Series Event When: 6-9 November 2025 Where: Yas Links, Abu Dhabi, UAE Website: europeantour.com F1 Brazilian Grand Prix When: 7-9 November 2025 (sprint weekend) Where: Autódromo José Carlos Pace Darts: Mr Vegas Grand Slam of Darts When: 8-16 November 2025 Where: WV Active Aldersley, Wolverhampton, England Tennis: Nitto ATP Finals 2025 When: 9-16 November 2025 Where: Turin, Italy Website: nittoatpfinals.com Men’s golf: DP World Tour Championship What: DP World Tour Rolex Series Event When: 13-16 November 2025 Where: Jumeirah Golf Estates, Earth course, Dubai, UAE Website: europeantour.com Horse racing: The November Meeting at Cheltenham When: 14-16 November 2025 Where: Cheltenham Racecourse, Gloucestershire, England Featured races (jumps): Mucking Brilliant Paddy Power Handicap Chase, Paddy Power Gold Cup Chase, Unibet Greatwood Hurdle Website, tickets and hospitality: thejockeyclub.co.uk F1 Las Vegas Grand Prix When: 20-22 November 2025 Where: Las Vegas Street Circuit Darts: Ladbrokes Players Championship Finals When: 21-23 November 2025 Where: Butlin’s Minehead Resort, England Philadelphia Marathon Weekend When: 21-23 November 2025 Where: Philadelphia, Pennsylvania, US Events: marathon; half marathon; 8k; kids fun run Website: philadelphiamarathon.com Cricket: Ashes 1st Test – Australia vs. England When: 21-25 November 2025 Where: Perth Stadium, Perth, Australia Darts: Winmau World Youth Championship Final When: 23 November 2025 Where: Butlin’s Minehead Resort, England Torino City Marathon When: 23 November 2025 Where: Turin, Italy Events: marathon, half-marathon Website: torinocitymarathon.it Horse racing: Japan Cup When: 24 November 2025 Where: Tokyo Racecourse, Tokyo, Japan Website: japanracing.jp F1 Qatar Grand Prix When: 28-30 November 2025 (sprint weekend) Where: Losail International Circuit Football: Conmebol 2025 Copa Libertadores final When: 29 November 2025 Where: TBC 2025 UK Snooker Championship When: 29 November to 7 December 2025 Where: York Barbican, York, England Tickets: worldsnookertour.seetickets.com Tennis: Billie Jean King Cup Finals What: eight nation women’s tennis team tournament When: November 2025 Where: TBC Website: billiejeankingcup.com Tennis: Davis Cup Final 8 What: eight nation international men’s team event When: November 2025 Where: TBC Website: daviscup.com December 2025 sports events 2025 UK Snooker Championship When: 29 November to 7 December 2025 Where: York Barbican, York, England Tickets: worldsnookertour.seetickets.com Cricket: Ashes 2nd Test – Australia vs. England When: 4-8 December 2025 (Day/Night Test) Where: The Gabba, Brisbane, Australia Horse racing: Betfair Tingle Creek Festival at Sandown Park When: 5-6 December 2025 Where: Sandown Park, Surrey, England Feature races (jumps): Betfair Tingle Creek Chase, Henry VIII Novices’ Chase, Winter Novices’ Hurdle Website and tickets: thejockeyclub.co.uk F1 Abu Dhabi Grand Prix When: 5-7 December 2025 Where: Yas Marina Circuit Valencia Trinidad Alfonso Zurich Marathon 2025 When: 7 December 2025 Where: Valencia, Spain Website: valenciaciudaddelrunning.com Reggae Marathon When: 7 December 2025 Where: Negril, Jamaica Events: half-marathon; 10k; 5km Website: reggaemarathon.com Horse racing: The Christmas Meeting at Cheltenham When: 12-13 December 2025 Where: Cheltenham Racecourse, Gloucestershire, England Feature races (jumps): Glenfarclas Cross Country Chase; JCB Triumph Hurdle trial; Albert Bartlett Novices Hurdle trial Website and tickets: thejockeyclub.co.uk Honolulu Marathon When: 14 December 2025 Where: Honolulu, Hawaii, USA Website: honolulumarathon.org Cricket: Ashes 3rd Test – Australia vs. England When: 17-21 December 2025 Where: Adelaide Oval, Adelaide, Australia Men’s football: African Cup of Nations (AFCON) When: 21 December 2025 to 18 January 2026 Where: Morocco Horse racing: Boxing Day Racing at Aintree When: 26 December 2025 Where: Aintree Racecourse, Liverpool, England Website and tickets: thejockeyclub.co.uk Horse racing: Boxing Day Racing at Wincanton When: 26 December 2024 Where: Wincanton Racecourse, Somerset, England Website and tickets: thejockeyclub.co.uk Horse racing: Ladbrokes Christmas Festival at Kempton Park When: 26-27 December 2025 Where: Kempton Park Racecourse, Surrey, England Featured races (jump): King George VI Steeple Chase, Mare’s Handicap Hurdle Race, Wayward Lad Novices’ Steeple Chase, The Desert Orchid Chase Website, tickets and hospitality: thejockeyclub.co.uk Cricket: Ashes 4th Test – Australia vs. England When: 26-30 December 2025 Where: MCG, Melbourne, Australia Horse racing: Coral Welsh Grand National at Chepstow When: 27 December 2025 Where: Chepstow Racecourse, Chepstow, Wales Featured races (jump): Welsh National, Finale Junior Hurdle, Championship Bumper Website: chepstow-racecourse.co.uk Horse racing: New Year’s Eve Raceday at Warwick When: 31 December 2025 Where: Warwick Racecourse, England Website and tickets: thejockeyclub.co.uk Tennis: Next Gen ATP Finals presented by PIF When: December 2025 (TBC) Where: Jeddah, Saudi Arabia Website: nextgenatpfinals.com Snooker: 2025 Shoot Out When: December 2025 (TBC) Where: Mattioli Arena, Leicester, England Tickets: worldsnookertour.seetickets.com Snooker: Home Nation Series – 2025 Scottish Open When: December 2025 (TBC) Where: Meadowbank Stadium, Edinburgh, Scotland Tickets: worldsnookertour.seetickets.com Darts: PDC World Darts Championship 2025-2026 When: December 2025 to January 2026 (dates TBC) Where: Alexandra Palace, London, England January 2026 sports events Men’s football: African Cup of Nations (AFCON) When: 21 December 2025 to 18 January 2026 Where: Morocco Cricket: Ashes 5th Test – Australia vs. England When: 4-8 January 2026 Where: SCG, Sydney, Australia Editor’s note Sports Tourism News works in partnership with a number of affiliate companies, listed below. We may earn a commission should you choose to book any tickets or packages. All details are provided by affiliate partners. All events and prices subject to change. Our partners for sports tickets and stadium tours include: – Ticketmaster UK: general sports tickets – See Tickets: general sports tickets – The Jockey Club: horse racing event tickets – LastMinute.com: holidays, days out and experiences – Buy a Gift: stadium tours, venue tours, sporting days out – Red Letter Days: stadium tours, venue tours, sporting days out Posted in Calendars, Events Prev2025 sports business events and conferences calendar Next39 Hours to Kohima: a historic trek through India’s Naga Hills 1 Comment Próximos eventos deportivos internacionales – INFORMES DEL TIEMPO DIARIO Y OTROS TEMAS […] Sports Tourism News). […] August 29, 2024 at Log in to Reply Leave a Reply Cancel reply You must be logged in to post a comment. Sport + Travel Magazine: sign up for the newsletter First name or full name Email Site search Search for: SPORTS EVENTS CALENDAR Feb 15 All day Athletics: Keely Klassic Feb 16 16 February - 1 March Dubai Duty Free Tennis Championships 2025 Feb 18 All day F175 Live at The O2 – 2025 F1 season launch Feb 19 19 February - 9 March Cricket: ICC Men’s Champions Trophy 2025 Feb 22 22 February - 23 February Rugby union: Guinness Men’s Six Nations 2025 – round three View Calendar Editor’s note Sports Tourism News works with a number of affiliate partners__. Products are sold directly by agents and operators. We may earn a commission should you choose to book any tickets or packages. WordPress Theme | Viral News by HashThemes This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Cookie settingsACCEPT Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are as essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. SAVE & ACCEPT"
    },
    {
      "url": "https://www.ticketmaster.com/discover/sports",
      "content": "Ticketmaster: Buy Verified Tickets for Concerts, Sports, Theater and Events Your browser is not supported. For the best experience, use any of these supported browsers: Chrome, Firefox, Safari, Edge. Skip to main content USUnited States selected, change country HotelsSellGift CardsHelpVIP Ticketmaster Home page ConcertsSportsArts, Theater & ComedyFamilyMore Toggle search bar Sign In/Register Current location All DatesChange date range: All Dates Search for Artist, Event or Venue See All Results SearchSearch Ticketmaster United States Highlights Popular Near You Concerts See AllSee All Concerts Pop ### Eagles R&B ### The Spinners R&B ### Commodores R&B ### Beyoncé Oldies & Classics ### Darlene Love Country ### Shania Twain Country ### Lady A Country ### Blake Shelton Alternative Rock ### Coldplay Heavy Metal ### Metallica Sports See AllSee All Sports NBA ### San Antonio Spurs NBA ### Sacramento Kings NBA ### Phoenix Suns NBA ### Memphis Grizzlies NBA ### Milwaukee Bucks NBA ### Minnesota Timberwolves NHL ### NHL Stadium Series NBA ### Orlando Magic NBA ### Brooklyn Nets NBA ### Portland Trail Blazers Arts, Theater & Comedy See AllSee All Arts, Theater & Comedy Musical ### Hamilton (Touring) Musical ### Hamilton (NY) Drama ### Harry Potter and the Cursed Child (NY) Spectacular ### V-U2 An Immersive Concert Film at Sphere Las Vegas Ice Shows ### Disney On Ice presents Into the Magic Comedy ### Tom Segura Comedy ### Sebastian Maniscalco Comedy ### Jerry Seinfeld And Jim Gaffigan Comedy ### Weird Al Yankovic Comedy ### Leanne Morgan Family See AllSee All Family Alternative Rock ### Coachella Valley Music and Arts Festival Ice Shows ### Disney On Ice presents Into the Magic Rodeo ### San Antonio Stock Show and Rodeo Other ### Dude Perfect Bullriding ### PBR: Unleash the Beast Other ### Neil deGrasse Tyson Children's Theatre ### The Wild Kratts Live! Bullriding ### PBR: Velocity Tour Children's Theatre ### The Wiggles Ice Shows ### Disney On Ice presents Frozen & Encanto Entertainment Guides ### NFL Get tickets to catch your favorite team live at the Official Ticket Marketplace of the NFL. ### NBA See your favorite team hit the court and get tickets at the Official Ticket Marketplace of the NBA. ### NHL Be there live when your favorite team hits the ice and get tickets at the Official Ticket Marketplace of the NHL. ### MLS Tickets Catch every action-packed game this season and get tickets at the Official Ticket Marketplace of the MLS. ### Broadway Don't miss your chance to catch the hottest shows live in NYC. ### Las Vegas Concerts Make your trip to Las Vegas even more memorable with access to last-minute tickets, VIP experiences and special offers. Discover More Sports ### Holiday Sports Preview Here's a rundown on the must-watch NBA, NFL, NHL & NCAA games taking place this Christmas and New Year’s Day. Discover More Music ### What to Bring to a Concert Read our ultimate packing checklist before you go to your next concert. Discover More Tips ### How to Prepare for Ticket Sales Before tickets go on sale, follow these tips to get ready. Discover More Arts & Theater ### 9 Broadway Shows to See This Winter in NYC Need ideas for family activities in NYC? Here are the best Broadway shows to see during the 2024 winter season. Discover More Welcome ### Get Started on Ticketmaster Everything you need to know about buying tickets, navigating your account, finding out when tickets go on sale, and more. Discover More Sports ### Last 10 Super Bowl Winners Ahead of Super Bowl LIX, happening on February 9 in NoLa, relive all the glory and highlights from the last 10 games. Discover More Advertisement Featured ### Hotels ### Ticket Deals ### VIP Packages ### Sell on Ticketmaster Ticketmaster Footer Navigation Ticketmaster Logo Let's connect (Opens in new tab) (Opens in new tab) (Opens in new tab) (Opens in new tab) (Opens in new tab) Download Our Apps (Opens in new tab) (Opens in new tab) By continuing past this page, you agree to our terms of use Helpful Links Help/FAQ Sell My Account Contact Us Gift Cards Refunds and Exchanges Do Not Sell or Share My Personal Information Get Started on Ticketmaster Our Network Live Nation House of Blues Front Gate Tickets TicketWeb universe NFL NBA NHL About Us Ticketmaster Blog Ticketing Truths Privacy Policy Ad Choices Careers Ticket Your Event Innovation Friends & Partners PayPal Allianz AWS Purchase Policy Privacy Policy Cookie Policy Manage my cookies and ad choices © 1999-2025 Ticketmaster. All rights reserved.",
      "title": "Ticketmaster: Buy Verified Tickets for Concerts, Sports, Theater and Events Your browser is not supported. For the best experience, use any of these supported browsers: Chrome, Firefox, Safari, Edge. Skip to main content USUnited States selected, change country HotelsSellGift CardsHelpVIP Ticketmaster Home page ConcertsSportsArts, Theater & ComedyFamilyMore Toggle search bar Sign In/Register Current location All DatesChange date range: All Dates Search for Artist, Event or Venue See All Results SearchSearch Ticketmaster United States Highlights Popular Near You Concerts See AllSee All Concerts Pop ### Eagles R&B ### The Spinners R&B ### Commodores R&B ### Beyoncé Oldies & Classics ### Darlene Love Country ### Shania Twain Country ### Lady A Country ### Blake Shelton Alternative Rock ### Coldplay Heavy Metal ### Metallica Sports See AllSee All Sports NBA ### San Antonio Spurs NBA ### Sacramento Kings NBA ### Phoenix Suns NBA ### Memphis Grizzlies NBA ### Milwaukee Bucks NBA ### Minnesota Timberwolves NHL ### NHL Stadium Series NBA ### Orlando Magic NBA ### Brooklyn Nets NBA ### Portland Trail Blazers Arts, Theater & Comedy See AllSee All Arts, Theater & Comedy Musical ### Hamilton (Touring) Musical ### Hamilton (NY) Drama ### Harry Potter and the Cursed Child (NY) Spectacular ### V-U2 An Immersive Concert Film at Sphere Las Vegas Ice Shows ### Disney On Ice presents Into the Magic Comedy ### Tom Segura Comedy ### Sebastian Maniscalco Comedy ### Jerry Seinfeld And Jim Gaffigan Comedy ### Weird Al Yankovic Comedy ### Leanne Morgan Family See AllSee All Family Alternative Rock ### Coachella Valley Music and Arts Festival Ice Shows ### Disney On Ice presents Into the Magic Rodeo ### San Antonio Stock Show and Rodeo Other ### Dude Perfect Bullriding ### PBR: Unleash the Beast Other ### Neil deGrasse Tyson Children's Theatre ### The Wild Kratts Live! Bullriding ### PBR: Velocity Tour Children's Theatre ### The Wiggles Ice Shows ### Disney On Ice presents Frozen & Encanto Entertainment Guides ### NFL Get tickets to catch your favorite team live at the Official Ticket Marketplace of the NFL. ### NBA See your favorite team hit the court and get tickets at the Official Ticket Marketplace of the NBA. ### NHL Be there live when your favorite team hits the ice and get tickets at the Official Ticket Marketplace of the NHL. ### MLS Tickets Catch every action-packed game this season and get tickets at the Official Ticket Marketplace of the MLS. ### Broadway Don't miss your chance to catch the hottest shows live in NYC. ### Las Vegas Concerts Make your trip to Las Vegas even more memorable with access to last-minute tickets, VIP experiences and special offers. Discover More Sports ### Holiday Sports Preview Here's a rundown on the must-watch NBA, NFL, NHL & NCAA games taking place this Christmas and New Year’s Day. Discover More Music ### What to Bring to a Concert Read our ultimate packing checklist before you go to your next concert. Discover More Tips ### How to Prepare for Ticket Sales Before tickets go on sale, follow these tips to get ready. Discover More Arts & Theater ### 9 Broadway Shows to See This Winter in NYC Need ideas for family activities in NYC? Here are the best Broadway shows to see during the 2024 winter season. Discover More Welcome ### Get Started on Ticketmaster Everything you need to know about buying tickets, navigating your account, finding out when tickets go on sale, and more. Discover More Sports ### Last 10 Super Bowl Winners Ahead of Super Bowl LIX, happening on February 9 in NoLa, relive all the glory and highlights from the last 10 games. Discover More Advertisement Featured ### Hotels ### Ticket Deals ### VIP Packages ### Sell on Ticketmaster Ticketmaster Footer Navigation Ticketmaster Logo Let's connect (Opens in new tab) (Opens in new tab) (Opens in new tab) (Opens in new tab) (Opens in new tab) Download Our Apps (Opens in new tab) (Opens in new tab) By continuing past this page, you agree to our terms of use Helpful Links Help/FAQ Sell My Account Contact Us Gift Cards Refunds and Exchanges Do Not Sell or Share My Personal Information Get Started on Ticketmaster Our Network Live Nation House of Blues Front Gate Tickets TicketWeb universe NFL NBA NHL About Us Ticketmaster Blog Ticketing Truths Privacy Policy Ad Choices Careers Ticket Your Event Innovation Friends & Partners PayPal Allianz AWS Purchase Policy Privacy Policy Cookie Policy Manage my cookies and ad choices © 1999-2025 Ticketmaster. All rights reserved."
    },
    {
      "url": "https://www.sling.com/programming/sports/schedules",
      "content": "Live Sports on Sling TV: Schedules, How To Watch & More Live Sports on Sling TV: Schedules, How To Watch & More Bookmark this page for weekly schedules of all the sports on Sling, including the MLB, Golf, F1, NASCAR, Soccer, Wrestling, and more! College Football on Sling Get Sling Orange + Blue w/ Sports Extras to watch the most games! MLB Baseball Time (ET) Game Channel Service Thursday, Sep. 21 1:00 PM Brewers at Cardinals or Angels at Rays MLB Network Sports Extras 7:15 PM Orioles at Guardians or Mets at Phillies FOX Sling Blue* 10:00 PM Giants at Dodgers MLB Network Sports Extras Friday, Sep. 22 2:00 PM Rockies at Cubs MLB Network Sports Extras 9:30 PM Cardinals at Padres or Tigers at A's MLB Network Sports Extras Saturday, Sep. 23 1:00 PM Diamondbacks at Yankees or Braves at Nationals MLB Network Sports Extras 4:00 PM Blue Jays at Rays or Mets at Phillies MLB Network Sports Extras 7:00 PM Mariners at Rangers or Orioles at Guardians MLB Network Sports Extras 10:00 PM Giants at Dodgers or Cardinals at Padres MLB Network Sports Extras Sunday, Sep. 24 1:00 PM Blue Jays at Rays or Mets at Phillies MLB Network Sports Extras 4:00 PM Cardinals at Padres or Tigers at A's MLB Network Sports Extras 7:00 PM Giants at Dodgers ESPN Sling Orange Monday, Sep. 25 7:30 PM Diamondbacks at White Sox MLB Network Sports Extras 9:45 PM Padres at Giants FS1 Sling Blue Tuesday, Sep. 26 3:00 PM Dodgers at Rockies MLB Network Sports Extras 7:20 PM Cubs at Braves TBS Sling Orange or Blue 9:30 PM Rangers at Angels or Padres at Giants MLB Network Sports Extras 10:05 PM Astros at Mariners TBS Sling Orange or Blue Wednesday, Sep. 27 2:00 PM Diamondbacks at White Sox MLB Network Sports Extras 9:30 PM Astros at Mariners or Padres at Giants MLB Network Sports Extras Thursday, Sep. 28 1:00 PM A's at Twins or Royals at Tigers MLB Network Sports Extras 4:00 PM Cardinals at Brewers MLB Network Sports Extras 7:00 PM Yankess at Blue or Cubs at Braves MLB Network Sports Extras Date Time (ET) Channel Bristol 300 Friday, Sept. 15 7:30 PM USA Texas 300 Saturday, Sept. 23 3:30 PM USA Charlotte Roval 200 Saturday, Oct. 7 3:00 PM NBC* Las Vegas 302 Saturday, Oct. 14 3:30 PM USA Homestead-Miami 300 Saturday, Oct. 21 3:00 PM USA Martinsville 250 Saturday, Oct. 28 3:30 PM USA Phoenix Championship Saturday, Nov. 4 7:00 PM USA Date Time (ET) Channel Bristol 200 Thursday, Sept. 14 9:00 PM FS1 Talladega 250 Saturday, Sept. 30 1:00 PM FS1 Homestead-Miami 200 Saturday, Oct. 21 12:00 PM FS1 Phoenix Championship Friday, Nov. 3 10:00 PM FS1 Date Time (ET) Channel Bristol, TN Thursday, Sept. 14 6:00 PM FS1 Salem, IN Saturday, Sept. 30 4:00 PM FS2 Toledo, OH Saturday, Oct. 7 4:00 PM FS2 Date Time (ET) Channel Grand Prix of Monterey Sunday, Sept. 10 2:30 PM NBC* Date Time (ET) Channel Reading Nationals Sunday, Sept. 17 2:00 PM FS1 Carolina Nationals Sunday, Sept. 24 2:00 PM FS1 Midwest Nationals Sunday, Oct. 1 3:00 PM FS1 Texas FallNationals Sunday, Oct. 15 3:00 PM FS1 Nevada Nationals Sunday, Oct. 29 5:00 PM FS1 Pomona Finals Sunday, Nov. 12 4:00 PM FS1 Date Time (ET) Channel IMSA Battle on the Bricks Sunday, Sept. 17 1:00 PM NBC* Motul Petit Le Mans Saturday, Oct. 14 6:30 PM USA Date Time (ET) Channel Indian Grand Prix Sunday, Sept. 24 1:30 PM NBC* Japanese Grand Prix Sunday, Oct. 1 4:00 PM CNBC Indonesian Grand Prix Sunday, Oct. 15 2:30 PM CNBC Australian Grand Prix Sunday, Oct. 22 1:30 PM CNBC Thailand Grand Prix Sunday, Oct. 29 3:00 PM CNBC Malaysian Grand Prix Sunday, Nov. 12 1:30 PM NBC* Qatar Grand Prix Sunday, Nov. 19 3:00 PM CNBC Valencia Grand Prix Sunday, Nov. 26 3:00 PM CNBC Time (ET) Matchup Channel Saturday, September 16 7:30 AM Wolves vs Liverpool USA 10:00 AM West Ham vs Man. City USA 12:30 PM Newcastle vs. Brentford NBC* Sunday, September 17 9:00 AM Bournemouth vs. Chelsea USA 11:30 AM Everton vs. Arsenal NBC* Monday, September 18 9:00 AM Nott'm Forest vs Burnley USA Time (ET) Game Channel Service Friday, Sept. 8 12:00 PM Georgia vs. Spain FS2 Sports Extras 2:45 PM Turkey vs. Armenia FS2 Sports Extras Saturday, Sept. 9 9:00 AM Azerbaijan vs. Belgium FS1 Sling Blue 12:00 PM Ukraine vs. England FS2 Sports Extras 2:45 PM Germany vs. Japan (Friendly) FS2 Sports Extras Sunday, Sept. 10 9:00 AM Kazakhstan vs. N. Ireland FS2 Sports Extras 12:00 PM Finland vs. Denmark FS2 Sports Extras 2:45 PM Albania vs. Slovenia FS1 Sling Blue Monday, Sept. 11 12:00 PM Armenia vs. Croatia FS2 Sports Extras 2:45 PM Portugal vs. Luxembourg FS2 Sports Extras 2:45 PM Slovakia vs. Liechtenstein FS2 Sports Extras Tuesday, Sept. 12 12:00 PM Azerbaijan vs. Jordan (Friendly) FS2 Sports Extras 2:45 PM Scotland vs. England (Friendly) FS2 Sports Extras Time (ET) Matchup Channel Sunday, September 17 8:30 PM Austin at Portland FS1 Event Time (ET) Channel Service Monday WWE RAW 8:00 PM USA Sling Blue Tuesday WWE NXT 8:00 PM USA Sling Blue Wednesday AEW Dynamite 8:00 PM TBS Sling Orange or Blue Friday WWE SmackDown 8:00 PM FOX* Sling Blue (Select Markets) AEW Rampage 10:00 PM TNT Sling Orange or Blue Saturday AEW Collision 8:00 PM TNT Sling Orange or Blue All games are subject to local blackout restrictions.Click here for more information on how to watch MLB Baseball on Sling. Formula 1 Watch Every Race with Sling Orange ABC is available with Sling Blue in select markets. Date Time (ET) Channel Singapore Grand Prix Sunday, Sept. 17 8:00 AM ESPN Japanese Grand Prix Sunday, Sept. 24 1:00 AM ESPN2 Qatar Grand Prix Sunday, Oct. 8 10:00 AM ESPN2 United States Grand Prix* Sunday, Oct. 22 3:00 PM ABC/ESPN3 Mexico Grand Prix Sunday, Oct. 29 4:00 PM ABC/ESPN3 Brazil Grand Prix Sunday, Nov. 5 12:00 PM ESPN2 Las Vegas Grand Prix* Sunday, Nov. 19 1:00 AM ESPN Abu Dhabi Grand Prix Sunday, Nov. 26 8:00 AM ESPN *Alternate broadcast on ESPN2 with Daniel Ricciardo & Will Arnett. Click here for more information on how to watch F1 on Sling. NASCAR Watch on USA and NBC (Select Markets) with Sling Blue Date Time (ET) Channel Bristol Night Race Saturday, Sept. 16 7:30 PM USA Texas 400 Sunday, Sept. 24 3:30 PM USA Talladega 500 Sunday, Oct. 1 2:00 PM NBC* Charlotte Roval 400 Sunday, Oct. 8 2:00 PM NBC* Las Vegas 400 Sunday, Oct. 15 2:30 PM NBC* Homestead-Miami 400 Sunday, Oct. 22 2:30 PM NBC* Martinsville 500 Sunday, Oct. 29 2:00 PM NBC* Phoenix Championship Sunday, Nov. 5 3:00 PM NBC* Click here for more information on how to watch NASCAR on Sling. NASCAR Watch on USA and NBC (Select Markets) with Sling Blue NASCAR Watch All Races on FS1 with Sling Blue ARCA Menards Series Racing Watch on FS1 (Sling Blue) and FS2 (Blue w/ Sports Extra) NTT IndyCar Series Racing on Sling Watch on NBC (Select Markets) and USA with Sling Blue Click here for more information on how to watch IndyCar on Sling. NHRA Drag Racing Watch on FS1 and FOX (Select Markets) with Sling Blue Click here for more information on how to watch NHRA Drag Racing on Sling. IMSA SportsCar Championship Racing on Sling Watch on USA and NBC (Select Markets) with Sling Blue MotoGP World Championship Watch on CNBC (Sling Blue w/ News Extra) *NBC is available with Sling Blue in select markets. Premier League Soccer Watch on USA and NBC (Select Markets) with Sling Blue FIFA Men's World Cup Qualifiers on Sling Watch on FS1 and FS2 with Sling Blue w/ Sports Extras Major League Soccer on Sling Watch on FS1 and FOX (Select Markets) with Sling Blue WNBA Playoffs Begin Sept. 13! Watch on ESPN Networks with Sling Orange ABC is available with Sling Blue in select markets. (1) Las Vegas Aces vs. (8) Chicago Sky Game 1: Chicago at Las Vegas, 10 p.m. ET, Wed., Sep. 13 (ESPN) Game 2: Chicago at Las Vegas, 3 p.m. ET, Sun., Sep. 17 (ABC/ ESPN3) Game 3*: Las Vegas at Chicago, tip TBD, Wed., Sep. 20 (ESPN) (2) New York Liberty vs. (7) Washington Mystics Game 1: Washington at New York, 7:30 p.m. ET, Fri., Sep. 15 (ESPN2) Game 2: Washington at New York, 7 p.m. ET, Tue., Sep. 19 (ESPN) Game 3*: New York at Washington, tip TBD, Fri., Sep. 22 (ESPN2) (3) Connecticut Sun vs. (6) Minnesota Lynx Game 1: Minnesota at Connecticut, 8 p.m. ET, Wed., Sep. 13 (ESPN2) Game 2: Minnesota at Connecticut, 1 p.m. ET, Sun., Sep. 17 (ESPN) Game 3*: Connecticut at Minnesota, tip TBD, Wed., Sep. 20 (ESPN) (4) Dallas Wings vs. (5) Atlanta Dream Game 1: Atlanta at Dallas, 9:30 p.m. ET, Fri., Sep. 15 (ESPN2) Game 2: Atlanta at Dallas, 9 p.m. ET, Tue., Sep. 19 (ESPN) Game 3*: Dallas at Atlanta, tip TBD, Fri., Sep. 22 (ESPN2) Weekly Pro Wrestling Click here for more information on how to watch Pro Wrestling on Sling. Upcoming PPV Events Order in your Sling guide under the On Demand tab in the Rentals section of the home page. Saturday, Sept. 30 - Canelo vs. Charlo ($84.99) Here's how to order and watch PPV events on Sling. https://main--sling--aemsites.aem.page/aemedge/fragments/try-sling-combo",
      "title": "Live Sports on Sling TV: Schedules, How To Watch & More Live Sports on Sling TV: Schedules, How To Watch & More Bookmark this page for weekly schedules of all the sports on Sling, including the MLB, Golf, F1, NASCAR, Soccer, Wrestling, and more! College Football on Sling Get Sling Orange + Blue w/ Sports Extras to watch the most games! MLB Baseball Time (ET) Game Channel Service Thursday, Sep. 21 1:00 PM Brewers at Cardinals or Angels at Rays MLB Network Sports Extras 7:15 PM Orioles at Guardians or Mets at Phillies FOX Sling Blue* 10:00 PM Giants at Dodgers MLB Network Sports Extras Friday, Sep. 22 2:00 PM Rockies at Cubs MLB Network Sports Extras 9:30 PM Cardinals at Padres or Tigers at A's MLB Network Sports Extras Saturday, Sep. 23 1:00 PM Diamondbacks at Yankees or Braves at Nationals MLB Network Sports Extras 4:00 PM Blue Jays at Rays or Mets at Phillies MLB Network Sports Extras 7:00 PM Mariners at Rangers or Orioles at Guardians MLB Network Sports Extras 10:00 PM Giants at Dodgers or Cardinals at Padres MLB Network Sports Extras Sunday, Sep. 24 1:00 PM Blue Jays at Rays or Mets at Phillies MLB Network Sports Extras 4:00 PM Cardinals at Padres or Tigers at A's MLB Network Sports Extras 7:00 PM Giants at Dodgers ESPN Sling Orange Monday, Sep. 25 7:30 PM Diamondbacks at White Sox MLB Network Sports Extras 9:45 PM Padres at Giants FS1 Sling Blue Tuesday, Sep. 26 3:00 PM Dodgers at Rockies MLB Network Sports Extras 7:20 PM Cubs at Braves TBS Sling Orange or Blue 9:30 PM Rangers at Angels or Padres at Giants MLB Network Sports Extras 10:05 PM Astros at Mariners TBS Sling Orange or Blue Wednesday, Sep. 27 2:00 PM Diamondbacks at White Sox MLB Network Sports Extras 9:30 PM Astros at Mariners or Padres at Giants MLB Network Sports Extras Thursday, Sep. 28 1:00 PM A's at Twins or Royals at Tigers MLB Network Sports Extras 4:00 PM Cardinals at Brewers MLB Network Sports Extras 7:00 PM Yankess at Blue or Cubs at Braves MLB Network Sports Extras Date Time (ET) Channel Bristol 300 Friday, Sept. 15 7:30 PM USA Texas 300 Saturday, Sept. 23 3:30 PM USA Charlotte Roval 200 Saturday, Oct. 7 3:00 PM NBC* Las Vegas 302 Saturday, Oct. 14 3:30 PM USA Homestead-Miami 300 Saturday, Oct. 21 3:00 PM USA Martinsville 250 Saturday, Oct. 28 3:30 PM USA Phoenix Championship Saturday, Nov. 4 7:00 PM USA Date Time (ET) Channel Bristol 200 Thursday, Sept. 14 9:00 PM FS1 Talladega 250 Saturday, Sept. 30 1:00 PM FS1 Homestead-Miami 200 Saturday, Oct. 21 12:00 PM FS1 Phoenix Championship Friday, Nov. 3 10:00 PM FS1 Date Time (ET) Channel Bristol, TN Thursday, Sept. 14 6:00 PM FS1 Salem, IN Saturday, Sept. 30 4:00 PM FS2 Toledo, OH Saturday, Oct. 7 4:00 PM FS2 Date Time (ET) Channel Grand Prix of Monterey Sunday, Sept. 10 2:30 PM NBC* Date Time (ET) Channel Reading Nationals Sunday, Sept. 17 2:00 PM FS1 Carolina Nationals Sunday, Sept. 24 2:00 PM FS1 Midwest Nationals Sunday, Oct. 1 3:00 PM FS1 Texas FallNationals Sunday, Oct. 15 3:00 PM FS1 Nevada Nationals Sunday, Oct. 29 5:00 PM FS1 Pomona Finals Sunday, Nov. 12 4:00 PM FS1 Date Time (ET) Channel IMSA Battle on the Bricks Sunday, Sept. 17 1:00 PM NBC* Motul Petit Le Mans Saturday, Oct. 14 6:30 PM USA Date Time (ET) Channel Indian Grand Prix Sunday, Sept. 24 1:30 PM NBC* Japanese Grand Prix Sunday, Oct. 1 4:00 PM CNBC Indonesian Grand Prix Sunday, Oct. 15 2:30 PM CNBC Australian Grand Prix Sunday, Oct. 22 1:30 PM CNBC Thailand Grand Prix Sunday, Oct. 29 3:00 PM CNBC Malaysian Grand Prix Sunday, Nov. 12 1:30 PM NBC* Qatar Grand Prix Sunday, Nov. 19 3:00 PM CNBC Valencia Grand Prix Sunday, Nov. 26 3:00 PM CNBC Time (ET) Matchup Channel Saturday, September 16 7:30 AM Wolves vs Liverpool USA 10:00 AM West Ham vs Man. City USA 12:30 PM Newcastle vs. Brentford NBC* Sunday, September 17 9:00 AM Bournemouth vs. Chelsea USA 11:30 AM Everton vs. Arsenal NBC* Monday, September 18 9:00 AM Nott'm Forest vs Burnley USA Time (ET) Game Channel Service Friday, Sept. 8 12:00 PM Georgia vs. Spain FS2 Sports Extras 2:45 PM Turkey vs. Armenia FS2 Sports Extras Saturday, Sept. 9 9:00 AM Azerbaijan vs. Belgium FS1 Sling Blue 12:00 PM Ukraine vs. England FS2 Sports Extras 2:45 PM Germany vs. Japan (Friendly) FS2 Sports Extras Sunday, Sept. 10 9:00 AM Kazakhstan vs. N. Ireland FS2 Sports Extras 12:00 PM Finland vs. Denmark FS2 Sports Extras 2:45 PM Albania vs. Slovenia FS1 Sling Blue Monday, Sept. 11 12:00 PM Armenia vs. Croatia FS2 Sports Extras 2:45 PM Portugal vs. Luxembourg FS2 Sports Extras 2:45 PM Slovakia vs. Liechtenstein FS2 Sports Extras Tuesday, Sept. 12 12:00 PM Azerbaijan vs. Jordan (Friendly) FS2 Sports Extras 2:45 PM Scotland vs. England (Friendly) FS2 Sports Extras Time (ET) Matchup Channel Sunday, September 17 8:30 PM Austin at Portland FS1 Event Time (ET) Channel Service Monday WWE RAW 8:00 PM USA Sling Blue Tuesday WWE NXT 8:00 PM USA Sling Blue Wednesday AEW Dynamite 8:00 PM TBS Sling Orange or Blue Friday WWE SmackDown 8:00 PM FOX* Sling Blue (Select Markets) AEW Rampage 10:00 PM TNT Sling Orange or Blue Saturday AEW Collision 8:00 PM TNT Sling Orange or Blue All games are subject to local blackout restrictions.Click here for more information on how to watch MLB Baseball on Sling. Formula 1 Watch Every Race with Sling Orange ABC is available with Sling Blue in select markets. Date Time (ET) Channel Singapore Grand Prix Sunday, Sept. 17 8:00 AM ESPN Japanese Grand Prix Sunday, Sept. 24 1:00 AM ESPN2 Qatar Grand Prix Sunday, Oct. 8 10:00 AM ESPN2 United States Grand Prix* Sunday, Oct. 22 3:00 PM ABC/ESPN3 Mexico Grand Prix Sunday, Oct. 29 4:00 PM ABC/ESPN3 Brazil Grand Prix Sunday, Nov. 5 12:00 PM ESPN2 Las Vegas Grand Prix* Sunday, Nov. 19 1:00 AM ESPN Abu Dhabi Grand Prix Sunday, Nov. 26 8:00 AM ESPN *Alternate broadcast on ESPN2 with Daniel Ricciardo & Will Arnett. Click here for more information on how to watch F1 on Sling. NASCAR Watch on USA and NBC (Select Markets) with Sling Blue Date Time (ET) Channel Bristol Night Race Saturday, Sept. 16 7:30 PM USA Texas 400 Sunday, Sept. 24 3:30 PM USA Talladega 500 Sunday, Oct. 1 2:00 PM NBC* Charlotte Roval 400 Sunday, Oct. 8 2:00 PM NBC* Las Vegas 400 Sunday, Oct. 15 2:30 PM NBC* Homestead-Miami 400 Sunday, Oct. 22 2:30 PM NBC* Martinsville 500 Sunday, Oct. 29 2:00 PM NBC* Phoenix Championship Sunday, Nov. 5 3:00 PM NBC* Click here for more information on how to watch NASCAR on Sling. NASCAR Watch on USA and NBC (Select Markets) with Sling Blue NASCAR Watch All Races on FS1 with Sling Blue ARCA Menards Series Racing Watch on FS1 (Sling Blue) and FS2 (Blue w/ Sports Extra) NTT IndyCar Series Racing on Sling Watch on NBC (Select Markets) and USA with Sling Blue Click here for more information on how to watch IndyCar on Sling. NHRA Drag Racing Watch on FS1 and FOX (Select Markets) with Sling Blue Click here for more information on how to watch NHRA Drag Racing on Sling. IMSA SportsCar Championship Racing on Sling Watch on USA and NBC (Select Markets) with Sling Blue MotoGP World Championship Watch on CNBC (Sling Blue w/ News Extra) *NBC is available with Sling Blue in select markets. Premier League Soccer Watch on USA and NBC (Select Markets) with Sling Blue FIFA Men's World Cup Qualifiers on Sling Watch on FS1 and FS2 with Sling Blue w/ Sports Extras Major League Soccer on Sling Watch on FS1 and FOX (Select Markets) with Sling Blue WNBA Playoffs Begin Sept. 13! Watch on ESPN Networks with Sling Orange ABC is available with Sling Blue in select markets. (1) Las Vegas Aces vs. (8) Chicago Sky Game 1: Chicago at Las Vegas, 10 p.m. ET, Wed., Sep. 13 (ESPN) Game 2: Chicago at Las Vegas, 3 p.m. ET, Sun., Sep. 17 (ABC/ ESPN3) Game 3*: Las Vegas at Chicago, tip TBD, Wed., Sep. 20 (ESPN) (2) New York Liberty vs. (7) Washington Mystics Game 1: Washington at New York, 7:30 p.m. ET, Fri., Sep. 15 (ESPN2) Game 2: Washington at New York, 7 p.m. ET, Tue., Sep. 19 (ESPN) Game 3*: New York at Washington, tip TBD, Fri., Sep. 22 (ESPN2) (3) Connecticut Sun vs. (6) Minnesota Lynx Game 1: Minnesota at Connecticut, 8 p.m. ET, Wed., Sep. 13 (ESPN2) Game 2: Minnesota at Connecticut, 1 p.m. ET, Sun., Sep. 17 (ESPN) Game 3*: Connecticut at Minnesota, tip TBD, Wed., Sep. 20 (ESPN) (4) Dallas Wings vs. (5) Atlanta Dream Game 1: Atlanta at Dallas, 9:30 p.m. ET, Fri., Sep. 15 (ESPN2) Game 2: Atlanta at Dallas, 9 p.m. ET, Tue., Sep. 19 (ESPN) Game 3*: Dallas at Atlanta, tip TBD, Fri., Sep. 22 (ESPN2) Weekly Pro Wrestling Click here for more information on how to watch Pro Wrestling on Sling. Upcoming PPV Events Order in your Sling guide under the On Demand tab in the Rentals section of the home page. Saturday, Sept. 30 - Canelo vs. Charlo ($84.99) Here's how to order and watch PPV events on Sling. https://main--sling--aemsites.aem.page/aemedge/fragments/try-sling-combo"
    },
    {
      "url": "https://www.eventbrite.com/d/sc--columbia/sport/",
      "content": "Sports Events in Columbia Search for something you love or check out popular events in your area. Filters Search for online events Unity on the Hardwood SC: Ridge View vs Keenan Alumni Basketball Game Sun, Mar 16, 1:00 PM Ridge View High School Unity on the Hardwood SC: Ridge View vs Keenan Alumni Basketball Game Sun, Mar 16, 1:00 PM Ridge View High School Gamecock Rugby Hall of Fame Banquet Sat, Apr 19, 6:00 PM The Campus Room at Capstone House Gamecock Rugby Hall of Fame Banquet Sat, Apr 19, 6:00 PM The Campus Room at Capstone House 5k Beer Run + Steel Hands Brewing | 2025 SC Brewery Running Series Sat, Mar 29, 11:00 AM Steel Hands Brewing 5k Beer Run + Steel Hands Brewing | 2025 SC Brewery Running Series Sat, Mar 29, 11:00 AM Steel Hands Brewing GBGA On the Course Classes with Coach Scott Parker Mon, Mar 10, 5:15 PM Linrick Golf Course GBGA On the Course Classes with Coach Scott Parker Mon, Mar 10, 5:15 PM Linrick Golf Course 2025 ACEC-SC Spring Golf Tournament Mon, Apr 21, 11:00 AM Golden Hills Golf & Country Club 2025 ACEC-SC Spring Golf Tournament Mon, Apr 21, 11:00 AM Golden Hills Golf & Country Club 2025 Gobble Til You Wobble 1M, 5K, 10K, 13.1, 26.2 Sun, Nov 16, 7:00 PM Columbia 2025 Gobble Til You Wobble 1M, 5K, 10K, 13.1, 26.2 Sun, Nov 16, 7:00 PM Columbia 2025 GBGA Ladies Golf Clinics Tomorrow at 6:30 PM + 10 more George Bryan Golf Academy 2025 GBGA Ladies Golf Clinics Tomorrow at 6:30 PM + 10 more George Bryan Golf Academy Sip & Sweat Thu, Apr 24, 6:00 PM Twelve Oak Estate Sip & Sweat Thu, Apr 24, 6:00 PM Twelve Oak Estate USC Sumter Men's Soccer | Spring 2025 ID Camp Sat, Mar 22, 9:30 AM University of South Carolina-Sumter USC Sumter Men's Soccer | Spring 2025 ID Camp Sat, Mar 22, 9:30 AM University of South Carolina-Sumter PLAYHOUSE POWER SNS CHEER CAMP Fri, Jun 13, 9:00 AM South Carolina PLAYHOUSE POWER SNS CHEER CAMP Fri, Jun 13, 9:00 AM South Carolina Sales end soon lululemon International Women's Day Workout Saturday at 9:15 AM lululemon Sales end soon lululemon International Women's Day Workout Saturday at 9:15 AM lululemon Sales end soon March lululemon Run/Walk Club Thursday at 5:30 PM lululemon Sales end soon March lululemon Run/Walk Club Thursday at 5:30 PM lululemon Sales end soon Fitness Meetup - Columbia Wednesday at 7:00 PM + 204 more Columbia Sales end soon Fitness Meetup - Columbia Wednesday at 7:00 PM + 204 more Columbia Just added Club Pilates March Matness Class Sun, Mar 30, 9:30 AM Savage Craft Ale Works Just added Club Pilates March Matness Class Sun, Mar 30, 9:30 AM Savage Craft Ale Works The FCA Athletic Combine Sat, Apr 12, 8:00 AM 7401 Monticello Rd The FCA Athletic Combine Sat, Apr 12, 8:00 AM 7401 Monticello Rd Sales end soon Freestyle fusion: fit for a king Tomorrow at 6:00 PM + 41 more Grace Life Church Sales end soon Freestyle fusion: fit for a king Tomorrow at 6:00 PM + 41 more Grace Life Church Sales end soon BATAAN Death March Saturday at 6:00 AM Bataan Death March Sales end soon BATAAN Death March Saturday at 6:00 AM Bataan Death March Sales end soon MIXXEDFIT Cardio Fitness Thursday at 6:30 PM + 3 more 730 Polo Rd Sales end soon MIXXEDFIT Cardio Fitness Thursday at 6:30 PM + 3 more 730 Polo Rd Sales end soon Barre Meetup - Columbia Saturday at 7:00 PM + 204 more Columbia Sales end soon Barre Meetup - Columbia Saturday at 7:00 PM + 204 more Columbia Things to do around Columbia Trends in Columbia 1. Valentines day events 2. Comedy 3. Free events this weekend 4. The comedy house 5. Valentines day dinner 6. Live music 7. Concerts 8. Kids events 9. Valentines day couples fun 10. Job fair 11. Singles 12. Soul line dancing Frequently asked questions about Columbia Site Navigation Use Eventbrite Plan Events Find Events Connect With Us",
      "title": "Sports Events in Columbia Search for something you love or check out popular events in your area. Filters Search for online events Unity on the Hardwood SC: Ridge View vs Keenan Alumni Basketball Game Sun, Mar 16, 1:00 PM Ridge View High School Unity on the Hardwood SC: Ridge View vs Keenan Alumni Basketball Game Sun, Mar 16, 1:00 PM Ridge View High School Gamecock Rugby Hall of Fame Banquet Sat, Apr 19, 6:00 PM The Campus Room at Capstone House Gamecock Rugby Hall of Fame Banquet Sat, Apr 19, 6:00 PM The Campus Room at Capstone House 5k Beer Run + Steel Hands Brewing | 2025 SC Brewery Running Series Sat, Mar 29, 11:00 AM Steel Hands Brewing 5k Beer Run + Steel Hands Brewing | 2025 SC Brewery Running Series Sat, Mar 29, 11:00 AM Steel Hands Brewing GBGA On the Course Classes with Coach Scott Parker Mon, Mar 10, 5:15 PM Linrick Golf Course GBGA On the Course Classes with Coach Scott Parker Mon, Mar 10, 5:15 PM Linrick Golf Course 2025 ACEC-SC Spring Golf Tournament Mon, Apr 21, 11:00 AM Golden Hills Golf & Country Club 2025 ACEC-SC Spring Golf Tournament Mon, Apr 21, 11:00 AM Golden Hills Golf & Country Club 2025 Gobble Til You Wobble 1M, 5K, 10K, 13.1, 26.2 Sun, Nov 16, 7:00 PM Columbia 2025 Gobble Til You Wobble 1M, 5K, 10K, 13.1, 26.2 Sun, Nov 16, 7:00 PM Columbia 2025 GBGA Ladies Golf Clinics Tomorrow at 6:30 PM + 10 more George Bryan Golf Academy 2025 GBGA Ladies Golf Clinics Tomorrow at 6:30 PM + 10 more George Bryan Golf Academy Sip & Sweat Thu, Apr 24, 6:00 PM Twelve Oak Estate Sip & Sweat Thu, Apr 24, 6:00 PM Twelve Oak Estate USC Sumter Men's Soccer | Spring 2025 ID Camp Sat, Mar 22, 9:30 AM University of South Carolina-Sumter USC Sumter Men's Soccer | Spring 2025 ID Camp Sat, Mar 22, 9:30 AM University of South Carolina-Sumter PLAYHOUSE POWER SNS CHEER CAMP Fri, Jun 13, 9:00 AM South Carolina PLAYHOUSE POWER SNS CHEER CAMP Fri, Jun 13, 9:00 AM South Carolina Sales end soon lululemon International Women's Day Workout Saturday at 9:15 AM lululemon Sales end soon lululemon International Women's Day Workout Saturday at 9:15 AM lululemon Sales end soon March lululemon Run/Walk Club Thursday at 5:30 PM lululemon Sales end soon March lululemon Run/Walk Club Thursday at 5:30 PM lululemon Sales end soon Fitness Meetup - Columbia Wednesday at 7:00 PM + 204 more Columbia Sales end soon Fitness Meetup - Columbia Wednesday at 7:00 PM + 204 more Columbia Just added Club Pilates March Matness Class Sun, Mar 30, 9:30 AM Savage Craft Ale Works Just added Club Pilates March Matness Class Sun, Mar 30, 9:30 AM Savage Craft Ale Works The FCA Athletic Combine Sat, Apr 12, 8:00 AM 7401 Monticello Rd The FCA Athletic Combine Sat, Apr 12, 8:00 AM 7401 Monticello Rd Sales end soon Freestyle fusion: fit for a king Tomorrow at 6:00 PM + 41 more Grace Life Church Sales end soon Freestyle fusion: fit for a king Tomorrow at 6:00 PM + 41 more Grace Life Church Sales end soon BATAAN Death March Saturday at 6:00 AM Bataan Death March Sales end soon BATAAN Death March Saturday at 6:00 AM Bataan Death March Sales end soon MIXXEDFIT Cardio Fitness Thursday at 6:30 PM + 3 more 730 Polo Rd Sales end soon MIXXEDFIT Cardio Fitness Thursday at 6:30 PM + 3 more 730 Polo Rd Sales end soon Barre Meetup - Columbia Saturday at 7:00 PM + 204 more Columbia Sales end soon Barre Meetup - Columbia Saturday at 7:00 PM + 204 more Columbia Things to do around Columbia Trends in Columbia 1. Valentines day events 2. Comedy 3. Free events this weekend 4. The comedy house 5. Valentines day dinner 6. Live music 7. Concerts 8. Kids events 9. Valentines day couples fun 10. Job fair 11. Singles 12. Soul line dancing Frequently asked questions about Columbia Site Navigation Use Eventbrite Plan Events Find Events Connect With Us"
    }
  ],
  "researchSummary": "Published Time: 2023-11-28T14:15:00.000Z 20 Great Team-Building Activities for Youth Sports [2024] Home Product About Us Resources News Blog Case Studies Request Demo Manage Reservations Login blog 20 Great Team-Building Activities for Youth Sports [2024] Jeff Porter | November 28, 2023 Table Of Contents At EventPipe, we know sports are much more than just games and competitions. They are a great opportunity to foster teamwork, unity, and personal growth. While we specialize in event housing management for sports tournaments and other events, we firmly believe that team camaraderie can play a significant role in the fantastic experience we aim to provide. Creating a unified team requires more than just practice, skill drills, endurance training and in-game experience. At the end of the day, it's important to include team-building activities that extend beyond the playing field. Such activities play an essential role in helping young athletes understand the value of collaboration, effective communication, mutual respect, and trust–all of which are integral to successful team dynamics. Every team is unique, but the goal to create an environment that nurtures growth, encourages positive interactions and ultimately drives team performance is universally the same. Let's dive in and start fostering the team spirit that every youth sports team needs to succeed. Why Team Building Activities Matter By participating in youth sports, children and young adolescents aren’t just playing a game! They’re developing physically, mentally, and socially while learning critical life skills and values. Improved Communication Team-building activities encourage open communication and better understanding among participants. They make it easier for individuals to express their thoughts, listen to others, and give and receive feedback, thus improving interactions within the team. Fun & Positive Team Culture Team-building activities also serve as a powerful tool for cultivating a fun and posi",
  "coreTopic": "The main topic of the content revolves around the importance of team-building activities in youth sports. It emphasizes how these activities contribute to fostering teamwork, communication, mutual respect, and personal growth among young athletes, highlighting that sports are not just about competition but also about developing essential life skills and creating a positive team culture.",
  "brandInfo": "\n      Website: https://playpickups.app/\n      Brand: playpickups\n      Products: No product images\n      Description: Besides work, you're not able to socialise much. Maybe you'd like to play tennis over the weekend but don't have a consistent group of players to play with.\n\n\n      Documents: No documents\n      Logo: No logo\n      Posts/Videos: No posts/videos\n      Taglines: None\n      Colours: playpickups\n      Country: global\n    ",
  "youtubeVideo": null,
  "internalLinks": [
    "/blog/tips-for-growth",
    "/resources/ecommerce-guide"
  ],
  "references": [
    "https://playpickups.app/",
    "https://eventpipe.com/blog/team-building-activities-youth-sports",
    "https://www.goodrec.com/",
    "https://www.yapsody.com/ticketing/blog/best-sporting-event-ideas/",
    "https://www.experiencecolumbiasc.com/things-to-do/sports/",
    "https://www.groupon.com/local/sporting-events?srsltid=AfmBOooI-5JpERwap4bsGmu8mP-Sy_4RIdXWXPB9b-hB8RGLnf7P3KE-",
    "https://www.ticketmaster.com/discover/sports",
    "https://www.sling.com/programming/sports/schedules",
    "https://www.eventbrite.com/d/sc--columbia/sport/"
  ],
  "existingPosts": "# 2025 Sports Spectacle: Celebrating Senior Athletes & Active Living!\n\nHey there! So, you know how the world of sports keeps changing, right? Well, as we peep into 2025, it’s looking like a jam-packed year full of events that celebrate athleticism, competition, and good vibes. We’re not just talking about the big-name stuff like the Rose Bowl and the Australian Open; there's also a cool shift towards active aging initiatives for seniors. Let’s dive into this vibrant scene of competitive sports for older adults and share some practical tips for keeping that active lifestyle alive.\n\n## Major Sporting Events in 2025\n\nGet ready for a thrilling lineup in 2025! Here are some highlights you won’t want to miss:\n\n- Rose Bowl: Kicking off the New Year on January 1st, the Rose Bowl is a legendary college football game that draws fans from all over the country. It’s got history, rivalry, and all that great stuff—totally a must-watch!\n\n- Australian Open: From January 12 to January 26, tennis lovers can gear up for one of the four Grand Slam tournaments. The Australian Open isn’t just about the fierce competition; it’s got a buzz and vibe that’s hard to resist.\n\n- UFC 311: Mark your calendars for January 18! This mixed martial arts event is set to deliver some intense matchups with the fiercest fighters in the arena.\n\nThese events aren’t just about the game; they also spark fun social interactions and healthy competition, bringing communities together.\n\n## Embracing Active Aging: The Role of the National Senior Games Association\n\nNow, here’s something really cool: as sports keep evolving, there’s a growing appreciation for fitness among older adults. The National Senior Games Association (NSGA) is at the forefront of this movement, gearing up some awesome athletic competitions for seniors across the country. Their goal? To keep older adults active and engaged through structured events.\n\n- Physical Activity: The NSGA knows that staying active is a game-changer for healthy aging. S",
  "targetKeywords": [],
  "timestamp": "2025-03-04",
  "nudge": "jo8u5"
}