{
  "initialUrl": "https://playpickups.app/",
  "initialResearchSummary": "Alright, so here we go. Based on that URL, playpickups.app, you can kind of vibe with the idea that this site is all about some play and pick-up culture, right? It seems like it’s geared towards gaming or some kind of playful interactions, maybe even sports-related. The way it rolls off the tongue, it gives off a friendly, social atmosphere where people can connect over shared interests. Imagine a platform where folks can get together, swap tips, and maybe even challenge each other to games or competitions. It could be a space for fantasy sports, where you’re drafting players and managing your line-ups, or even something like a social gaming app where you can pick up new games to play with your friends or meet new people. You know, the kind of place where you can casually scroll through and find something fun to dive into. Also, there's a chance it's got some community flair to it—like forums or chat features where users can talk shop about their latest wins or losses. You might find articles, videos, or streams showcasing the hottest picks or the latest trends in gaming sports, like which players to draft or which games are hot this season. It's like a hangout for gamers or sports enthusiasts looking to share the hype and excitement of it all. If it’s more on the app side, maybe it’s a mobile-friendly space where you can quickly jump into games, set up challenges, or join in on league play with just a few taps. You know how some apps are all about quick interactions and getting you hyped up to play? Could be that vibe. Another angle to consider is that it might be layered with some gamification elements itself. Like, you pick up certain activities or tasks, earn points, unlock achievements, and maybe even compete on leaderboards. It could provide a fun way to motivate people to stay engaged, whether that’s in a casual environment or more competitive settings. Overall, playpickups.app sounds like a chill spot where you can connect with your crew, challenge each other, and maybe even discover new games or sports to enjoy together. It’s that blend of social engagement and playful competition that keeps things fresh and exciting. You know, just a laid-back place to pick up some fun and share a few laughs with fellow gamers or sports fans. That's the vibe I'm getting from that URL—simple, fun, and definitely something worth exploring if you're into all that good stuff. So, whether you're looking to score some wins, discover the next big thing in gaming, or just connect with some like-minded folks, it seems like this site might just be your playground. Cheers to that!",
  "researchResults": [
    {
      "url": "https://ignitestudentlife.com/4-ways-to-make-friends-without-feeling-socially-awkward/",
      "content": "Published Time: 2022-12-14T16:26:08+00:00 4 ways to make friends without feeling socially awkward | IGNITE Sorry, there has been error and we cannot log you in at this time. ERROR: Unable to confirm current student status. Terminate session Hello Log Out Log In IGNITE About IGNITE Impact Report Board of Directors Staff Directory Media Interview Requests Services Health & Dental Insurance Plan Soupbar Sleep Lounge Zen Zone Menstrual Products Tax Clinic Posting and Student Centre Requests Financial Support Learning Essentials Support Bursaries & Financial Relief Program GLOW Bursary Skills Bundle Equity Scholarships Black Excellence Scholarship Indigenous Scholarship Pride Scholarship Get Involved Events & Contests Clubs Election Work at IGNITE Advocacy Student Advocates Academic Program Reps Equity & Inclusion Indigenous Resources Black Excellence Resources 2SLGBTQ+ Resources News Search for: Search Submit Please log in using your Humber ID. Don’t forget to include ‘@humber.ca’ in your username. UofGH students, to locate your Humber ID and password, please use this form. You can also search your ‘@guelphhumber.ca’ email account for “Humber login credential”. If you continue to have issues locating or using your @humber.ca ID, please contact the Humber IT Service Desk: Visit Humber IT Support Centre (Live Chat available during business hours.) Email servicedesk@humber.ca Call 416-675-6622 ext. 4357 4 Ways to make friends without feeling socially awkward It's time to socialize By: Jeneen Richards On: December 14, 2022 Don’t be afraid to start a conversation Raise of hands if you’re struggling to make friends right now. Navigating online classes for two years has made it difficult to get back out there socially. We’re accustomed to attending classes in our pyjamas or using WhatsApp for most group assignments and we’ve missed out on interacting with our peers face-to-face. Now that we’re back in person, it’s time to shake things up. So, here are four ways you can make friends on campus without feeling socially awkward. And you may never know, you might just meet your next best friend! So, let’s see how we can spruce up our social lives. Visit Humber fitness centres via Giphy You might be wondering how going to the Humber gym leads to friendships. Here’s how. You might consider attending a Zumba class or another fun fitness class. During the workout, you have a strong chance of meeting someone. And who knows, you might become close friends. Or even better, gym buddies. Join a club via Giphy Are you aware of the different clubs on campus? If not, you’re missing out. With so many clubs to join, you can interact with people who have similar interests to you. And form friendships too! So join a club that interests you or start your own! Attend social events via Giphy Now, who doesn’t like fun events? It’s the best time to socialize and unwind. And social events are the perfect way to meet new people and make friends. Whether you attend a cultural gathering, a concert or some other type of event, we’re sure you’ll have a good time! So what are you waiting for? Register for a social event on campus! There’s always so many options to choose from! Attend IGNITE’s Speed Friending event via Giphy What’s the best way to get to know someone? Through conversations, of course. Speed friending is similar to speed dating, but you make new connections and friendships. If you’d like to attend, here’s everything you need to know. Speed friending sessions will be from Tuesday, Jan. 10, to Friday, Jan. 13. You will have the opportunity to meet new people between 11 a.m. and 3:30 p.m. And guess what? Games will be available for you to play and win prizes. Sounds like a good opportunity to you? Register for a session today! We know it hasn’t been easy, making friends post-pandemic. But it doesn’t have to remain that way. There are so many ways to form friendships on campus. Even though you might feel socially awkward trying to make friends. But what’s better than knowing you can grab coffee with a friend? So start a conversation today. It will be worth it in the end. Are you looking for fantastic food spots to visit with friends? Here are some best local places. Follow IGNITE on Facebook, Instagram and Twitter for all things student life. RELATED ARTICLES Women empowerment club Here’s why striking a balance is important Benefits of joining an IGNITE club Why attending IGNITE’s Special Meeting of the Members is essential for your student life Celebrating love and friendship Open Modal Name* Email Address* Subject Message + Student Number* Name This field is for validation purposes and should be left unchanged. Newsletter Events Accessibility Privacy Policy Work at IGNITE – we’re hiring Contact Us Contact info@ignitestudentlife.com Facebook Instagram YouTube Twitter Terms of Use | IGNITE General Contest Terms and Conditions | © 2025 IGNITE All Rights Reserved Close Survey Welcome to the beginning of your IGNITE experienceIGNITE offers a variety of services, events and opportunities to make your student experience the best it can be. Please take a few minutes to tell us about yourself by filling out this short survey. Not only will it help us provide you with initiatives that you want to see, but you’ll be entered into a draw with a chance to win $1,000! Start Now Tell us a bit about yourself Student ID Student First Name Student Last Name Student Email 1.What is your age? 18 or under 19-20 21-22 23-25 26-29 30+ 2. Where are you currently living? In the Greater Toronto Area In Ontario, outside the GTA In Canada, outside of Ontario Outside of Canada Please Specify 3. In what year of your current program are you? 1st year 2nd year 3rd year 4th year 5th year Other year Please Specify Year * PrevNext Step 4. Do you plan on graduating during the 2020-21 academic year? Yes No Not Sure 5. How do you primarily plan to get to campus for this semester? Car Public Transit Walk Bike Carpool Ride share / Taxi All my classes will be delivered virtually PrevNext Step 6. On which topics would you be interested in receiving more information or attending related events? Please choose up to five options, and rank your choices from most to least interested. Virtual events (social meet-ups, dance parties, escape rooms, etc) Virtual conferences (i.e. Vidcon and Comic Con) Anti-racism Leadership Cultural events (Black Excellence Conference, Diwali celebration, etc) Mindfulness and meditation Nutrition Peer-to-Peer coaching programs (wellness, fitness, etc) Finding internships/placements Personal financing strategies & future investments Professional mentorship/advice Entrepreneurship and personal branding techniques 7. What interests and activities do you enjoy? Please choose up to five options. Movies & TV Music Food & Cooking Technology Environmental Sustainability Health & Fitness Sports eSports & Gaming Entrepreneurship Social Justice Current Events PrevNext Step What is the hardest part of being a student? Please rank up to three options. Not having enough time Strongly disagree Disagree Neutral Agree Strongly agree Not being able to afford school Strongly disagree Disagree Neutral Agree Strongly agree Not being able to afford other expenses Strongly disagree Disagree Neutral Agree Strongly agree PrevNext Step Meeting new people and making new friends Strongly disagree Disagree Neutral Agree Strongly agree Balancing multiple priorities (family, work, school, etc) Strongly disagree Disagree Neutral Agree Strongly agree PrevNext Step Learning in an online environment Strongly disagree Disagree Neutral Agree Strongly agree Keeping up with school work and assignments Strongly disagree Disagree Neutral Agree Strongly agree PrevNext Step How would you like IGNITE to communicate with you? (Please check all that apply) Instagram Twitter Facebook LinkedIn TikTok YouTube Email Text message ignitestudentlife.com Go BackSubmit Some Text Thank you for taking the Survey!We look forward to providing you with great experiences throughout this school year. Close Survey",
      "title": "Published Time: 2022-12-14T16:26:08+00:00 4 ways to make friends without feeling socially awkward | IGNITE Sorry, there has been error and we cannot log you in at this time. ERROR: Unable to confirm current student status. Terminate session Hello Log Out Log In IGNITE About IGNITE Impact Report Board of Directors Staff Directory Media Interview Requests Services Health & Dental Insurance Plan Soupbar Sleep Lounge Zen Zone Menstrual Products Tax Clinic Posting and Student Centre Requests Financial Support Learning Essentials Support Bursaries & Financial Relief Program GLOW Bursary Skills Bundle Equity Scholarships Black Excellence Scholarship Indigenous Scholarship Pride Scholarship Get Involved Events & Contests Clubs Election Work at IGNITE Advocacy Student Advocates Academic Program Reps Equity & Inclusion Indigenous Resources Black Excellence Resources 2SLGBTQ+ Resources News Search for: Search Submit Please log in using your Humber ID. Don’t forget to include ‘@humber.ca’ in your username. UofGH students, to locate your Humber ID and password, please use this form. You can also search your ‘@guelphhumber.ca’ email account for “Humber login credential”. If you continue to have issues locating or using your @humber.ca ID, please contact the Humber IT Service Desk: Visit Humber IT Support Centre (Live Chat available during business hours.) Email servicedesk@humber.ca Call 416-675-6622 ext. 4357 4 Ways to make friends without feeling socially awkward It's time to socialize By: Jeneen Richards On: December 14, 2022 Don’t be afraid to start a conversation Raise of hands if you’re struggling to make friends right now. Navigating online classes for two years has made it difficult to get back out there socially. We’re accustomed to attending classes in our pyjamas or using WhatsApp for most group assignments and we’ve missed out on interacting with our peers face-to-face. Now that we’re back in person, it’s time to shake things up. So, here are four ways you can make friends on campus without feeling socially awkward. And you may never know, you might just meet your next best friend! So, let’s see how we can spruce up our social lives. Visit Humber fitness centres via Giphy You might be wondering how going to the Humber gym leads to friendships. Here’s how. You might consider attending a Zumba class or another fun fitness class. During the workout, you have a strong chance of meeting someone. And who knows, you might become close friends. Or even better, gym buddies. Join a club via Giphy Are you aware of the different clubs on campus? If not, you’re missing out. With so many clubs to join, you can interact with people who have similar interests to you. And form friendships too! So join a club that interests you or start your own! Attend social events via Giphy Now, who doesn’t like fun events? It’s the best time to socialize and unwind. And social events are the perfect way to meet new people and make friends. Whether you attend a cultural gathering, a concert or some other type of event, we’re sure you’ll have a good time! So what are you waiting for? Register for a social event on campus! There’s always so many options to choose from! Attend IGNITE’s Speed Friending event via Giphy What’s the best way to get to know someone? Through conversations, of course. Speed friending is similar to speed dating, but you make new connections and friendships. If you’d like to attend, here’s everything you need to know. Speed friending sessions will be from Tuesday, Jan. 10, to Friday, Jan. 13. You will have the opportunity to meet new people between 11 a.m. and 3:30 p.m. And guess what? Games will be available for you to play and win prizes. Sounds like a good opportunity to you? Register for a session today! We know it hasn’t been easy, making friends post-pandemic. But it doesn’t have to remain that way. There are so many ways to form friendships on campus. Even though you might feel socially awkward trying to make friends. But what’s better than knowing you can grab coffee with a friend? So start a conversation today. It will be worth it in the end. Are you looking for fantastic food spots to visit with friends? Here are some best local places. Follow IGNITE on Facebook, Instagram and Twitter for all things student life. RELATED ARTICLES Women empowerment club Here’s why striking a balance is important Benefits of joining an IGNITE club Why attending IGNITE’s Special Meeting of the Members is essential for your student life Celebrating love and friendship Open Modal Name* Email Address* Subject Message + Student Number* Name This field is for validation purposes and should be left unchanged. Newsletter Events Accessibility Privacy Policy Work at IGNITE – we’re hiring Contact Us Contact info@ignitestudentlife.com Facebook Instagram YouTube Twitter Terms of Use | IGNITE General Contest Terms and Conditions | © 2025 IGNITE All Rights Reserved Close Survey Welcome to the beginning of your IGNITE experienceIGNITE offers a variety of services, events and opportunities to make your student experience the best it can be. Please take a few minutes to tell us about yourself by filling out this short survey. Not only will it help us provide you with initiatives that you want to see, but you’ll be entered into a draw with a chance to win $1,000! Start Now Tell us a bit about yourself Student ID Student First Name Student Last Name Student Email 1.What is your age? 18 or under 19-20 21-22 23-25 26-29 30+ 2. Where are you currently living? In the Greater Toronto Area In Ontario, outside the GTA In Canada, outside of Ontario Outside of Canada Please Specify 3. In what year of your current program are you? 1st year 2nd year 3rd year 4th year 5th year Other year Please Specify Year * PrevNext Step 4. Do you plan on graduating during the 2020-21 academic year? Yes No Not Sure 5. How do you primarily plan to get to campus for this semester? Car Public Transit Walk Bike Carpool Ride share / Taxi All my classes will be delivered virtually PrevNext Step 6. On which topics would you be interested in receiving more information or attending related events? Please choose up to five options, and rank your choices from most to least interested. Virtual events (social meet-ups, dance parties, escape rooms, etc) Virtual conferences (i.e. Vidcon and Comic Con) Anti-racism Leadership Cultural events (Black Excellence Conference, Diwali celebration, etc) Mindfulness and meditation Nutrition Peer-to-Peer coaching programs (wellness, fitness, etc) Finding internships/placements Personal financing strategies & future investments Professional mentorship/advice Entrepreneurship and personal branding techniques 7. What interests and activities do you enjoy? Please choose up to five options. Movies & TV Music Food & Cooking Technology Environmental Sustainability Health & Fitness Sports eSports & Gaming Entrepreneurship Social Justice Current Events PrevNext Step What is the hardest part of being a student? Please rank up to three options. Not having enough time Strongly disagree Disagree Neutral Agree Strongly agree Not being able to afford school Strongly disagree Disagree Neutral Agree Strongly agree Not being able to afford other expenses Strongly disagree Disagree Neutral Agree Strongly agree PrevNext Step Meeting new people and making new friends Strongly disagree Disagree Neutral Agree Strongly agree Balancing multiple priorities (family, work, school, etc) Strongly disagree Disagree Neutral Agree Strongly agree PrevNext Step Learning in an online environment Strongly disagree Disagree Neutral Agree Strongly agree Keeping up with school work and assignments Strongly disagree Disagree Neutral Agree Strongly agree PrevNext Step How would you like IGNITE to communicate with you? (Please check all that apply) Instagram Twitter Facebook LinkedIn TikTok YouTube Email Text message ignitestudentlife.com Go BackSubmit Some Text Thank you for taking the Survey!We look forward to providing you with great experiences throughout this school year. Close Survey"
    },
    {
      "url": "https://www.reddit.com/r/Games/comments/1udemc/what_the_best_way_to_make_friends_in_online_games/",
      "content": "Reddit - Dive into anything Skip to main content Open menu Open navigation Go to Reddit Home r/Games A chip A close button Get App Get the Reddit app Log In Log in to Reddit Expand user menu Open settings menu Go to Games r/Games r/Games The goal of /r/Games is to provide a place for informative and interesting gaming content and discussions. Submissions should be for the purpose of informing or initiating a discussion, not just with the goal of entertaining viewers. Memes, comics, funny screenshots, arts-and-crafts, etc. will be removed. Members Online • Axiom55 What the best way to make friends in online games? Hey there reddit. I think we can all agree one of the most important factors in having fun in a game is playing it wit friends. This doesn't hold true for every game out there. I highly doubt you want to play mass effect with 5 of your buddies around you, but I digress. Finding friends in game can be a challenge for some games though. If you don't join a guild or the games equivalent of a guild then you can spend hours on a game without ever finding a solid group of friends. So what is your favorite way to make new friends on new games? I remember someone recommending a website a while back, something you could use to find new friends who are playing the same game as you and want someone to partner up with. There is also the method of just being friendly in every social contact with other players, and adding them after you get to know them a little bit. But this thread isnt about my ideas, its about yours. So what is the best way to make friends in online games? Read more Archived post. New comments cannot be posted and votes cannot be cast. New to Reddit?Create your account and connect with a world of communities. Continue with Email Continue With Phone Number By continuing, you agree to our User Agreement and acknowledge that you understand the Privacy Policy. Top 1% Rank by size Public Anyone can view, post, and comment to this community Top Posts Reddit reReddit: Top posts of January 4, 2014 * * * Reddit reReddit: Top posts of January 2014 * * * Reddit reReddit: Top posts of 2014 * * * Reddit Rules Privacy Policy User Agreement Reddit, Inc. © 2025. All rights reserved. Expand Navigation Collapse Navigation TOPICS Internet Culture (Viral) Amazing Animals & Pets Cringe & Facepalm Funny Interesting Memes Oddly Satisfying Reddit Meta Wholesome & Heartwarming Games Action Games Adventure Games Esports Gaming Consoles & Gear Gaming News & Discussion Mobile Games Other Games Role-Playing Games Simulation Games Sports & Racing Games Strategy Games* Tabletop Games Q&As Q&As* Stories & Confessions Technology 3D Printing Artificial Intelligence & Machine Learning Computers & Hardware Consumer Electronics DIY Electronics Programming Software & Apps Streaming Services Tech News & Discussion* Virtual & Augmented Reality Pop Culture Celebrities Creators & Influencers Generations & Nostalgia Podcasts Streamers* Tarot & Astrology Movies & TV Action Movies & Series Animated Movies & Series Comedy Movies & Series Crime, Mystery, & Thriller Movies & Series Documentary Movies & Series Drama Movies & Series Fantasy Movies & Series Horror Movies & Series Movie News & Discussion Reality TV Romance Movies & Series Sci-Fi Movies & Series Superhero Movies & Series* TV News & Discussion RESOURCES About Reddit Advertise Help Blog Careers* Press Communities Best of Reddit Topics differinus • Promoted Unlock clearer skin with Differin's acne-fighting solutions. Shop Now walmart.com TradeStation • Official • Promoted Harness the power of proprietary technology with TradeStation. Customize and automate your trading experience with TradeStation's robust platform suite. Learn More tradestation.com",
      "title": "Reddit - Dive into anything Skip to main content Open menu Open navigation Go to Reddit Home r/Games A chip A close button Get App Get the Reddit app Log In Log in to Reddit Expand user menu Open settings menu Go to Games r/Games r/Games The goal of /r/Games is to provide a place for informative and interesting gaming content and discussions. Submissions should be for the purpose of informing or initiating a discussion, not just with the goal of entertaining viewers. Memes, comics, funny screenshots, arts-and-crafts, etc. will be removed. Members Online • Axiom55 What the best way to make friends in online games? Hey there reddit. I think we can all agree one of the most important factors in having fun in a game is playing it wit friends. This doesn't hold true for every game out there. I highly doubt you want to play mass effect with 5 of your buddies around you, but I digress. Finding friends in game can be a challenge for some games though. If you don't join a guild or the games equivalent of a guild then you can spend hours on a game without ever finding a solid group of friends. So what is your favorite way to make new friends on new games? I remember someone recommending a website a while back, something you could use to find new friends who are playing the same game as you and want someone to partner up with. There is also the method of just being friendly in every social contact with other players, and adding them after you get to know them a little bit. But this thread isnt about my ideas, its about yours. So what is the best way to make friends in online games? Read more Archived post. New comments cannot be posted and votes cannot be cast. New to Reddit?Create your account and connect with a world of communities. Continue with Email Continue With Phone Number By continuing, you agree to our User Agreement and acknowledge that you understand the Privacy Policy. Top 1% Rank by size Public Anyone can view, post, and comment to this community Top Posts Reddit reReddit: Top posts of January 4, 2014 * * * Reddit reReddit: Top posts of January 2014 * * * Reddit reReddit: Top posts of 2014 * * * Reddit Rules Privacy Policy User Agreement Reddit, Inc. © 2025. All rights reserved. Expand Navigation Collapse Navigation TOPICS Internet Culture (Viral) Amazing Animals & Pets Cringe & Facepalm Funny Interesting Memes Oddly Satisfying Reddit Meta Wholesome & Heartwarming Games Action Games Adventure Games Esports Gaming Consoles & Gear Gaming News & Discussion Mobile Games Other Games Role-Playing Games Simulation Games Sports & Racing Games Strategy Games* Tabletop Games Q&As Q&As* Stories & Confessions Technology 3D Printing Artificial Intelligence & Machine Learning Computers & Hardware Consumer Electronics DIY Electronics Programming Software & Apps Streaming Services Tech News & Discussion* Virtual & Augmented Reality Pop Culture Celebrities Creators & Influencers Generations & Nostalgia Podcasts Streamers* Tarot & Astrology Movies & TV Action Movies & Series Animated Movies & Series Comedy Movies & Series Crime, Mystery, & Thriller Movies & Series Documentary Movies & Series Drama Movies & Series Fantasy Movies & Series Horror Movies & Series Movie News & Discussion Reality TV Romance Movies & Series Sci-Fi Movies & Series Superhero Movies & Series* TV News & Discussion RESOURCES About Reddit Advertise Help Blog Careers* Press Communities Best of Reddit Topics differinus • Promoted Unlock clearer skin with Differin's acne-fighting solutions. Shop Now walmart.com TradeStation • Official • Promoted Harness the power of proprietary technology with TradeStation. Customize and automate your trading experience with TradeStation's robust platform suite. Learn More tradestation.com"
    },
    {
      "url": "https://ocremix.org/community/topic/44249-lonely-gamer-doesnt-know-how-to-make-friends-anymore/",
      "content": "Published Time: 2016-08-31T02:43:07+0000 Lonely gamer doesn't know how to make friends anymore. - General Discussion - OC ReMix Community Jump to content Existing user? Sign In Sign In Remember me Not recommended on shared computers Sign InForgot your password? Or sign in with one of these services Sign in with Facebook Sign in with Google Sign Up Browse Forums Events Guidelines Staff Online Users More ReMix Submissions Submissions Tracking Currently in the Judging Process Judges Decisions More Activity All Activity My Activity Streams Unread Content Content I Started Search More Leaderboard Clubs More More Everywhere This Forum This Topic Status Updates Topics Pages Articles Events Members General Discussion All Activity Home Community General Discussion Lonely gamer doesn't know how to make friends anymore. Lonely gamer doesn't know how to make friends anymore. By duskvstweak, August 31, 2016 in General Discussion Share https://ocremix.org/community/topic/44249-lonely-gamer-doesnt-know-how-to-make-friends-anymore/ More sharing options... Followers 3 Reply new topic Prev 1 2 Next Page 1 of 2 Recommended Posts duskvstweak Posted August 31, 2016 duskvstweak Members 248 Posted August 31, 2016 I don't have any gamer friends where I live and my wife, bless her, isn't a gamer either. But I play a lot and don't feel like I have anyone to talk to about those games. I think the loneliness connected to one of my favorite hobbies is really starting to have an effect on me. I used to have friends where I lived before who played with and talked about them with me, but I've moved a bunch since and at 30, making new friends feels impossible. College really spoiled me and now adulthood seems so empty as a gamer, even though I still love playing! My Steam friends list is my two uncles and one friend from home, an they're never on. I tend to be a bit more depressed than most, but it just seems different with this. No one to relate to, or talk to. Is there a site/forum/game I should be spending time in? I've tried twitch, but it just seems to enhance the loneliness (does that make sense?Maybe I don't twitch right!) Am I just whining about nothing and should just shut up and play. I'm not trying to sound like a cry baby or throw a pity party. I just live far out in rural country and can't shake this loneliness and don't know how to fix it. Quote Meteo Xavier Posted August 31, 2016 Meteo Xavier Members 6.3k OC ReMix Artist Profile Posted August 31, 2016 It happens in your 30s. You just keep looking around local and online as best you can and fill it up where you can. Get outside the box and try things you probably wouldn't have tried before. Pretty hard to be more specific as to what things those are from there, but with the will to move can inevitably reveal the path to get there. k-wix, duskvstweak, TheChargingRhino and 1 other 4 Quote DarkeSword Posted August 31, 2016 DarkeSword Administrators 9.4k OC ReMix Artist Profile Posted August 31, 2016 Making new friends as an adult after high school/college is actually really difficult. You're not put into situations where you're forced to interact with peers on a regular basis. For gaming friends though, I would suggest meetup.com. There always seems to be some kind of local board game group set up where you can go hang out with people and play board games. This can translate pretty easily into video games. You can also try to create your own gaming group. Maybe contact a local library and see if you can reserve a room with some TVs and set up a weekly gaming thing where folks can drop by and play some Halo. Also, and this is kind of obvious, but there's OC ReMix too. We're a pretty solid community of gamers. Lots of people are real-life friends because of OC ReMix. Not necessarily local, but I know I see my OCR friends almost monthly nowadays due to get-togethers and conventions. Plenty of folks in the community are playing games online like Overwatch, Hearthstone, Final Fantasy XIV, World of Warcraft, etc. We had a pretty active Team Fortress 2 community a few years ago, though I'm not sure how much people play that anymore. Your location says \"nomadic.\" Where are you actually located? Maybe there's some OCR folks out near you. TheChargingRhino, Geoffrey Taucer, Garpocalypse and 2 others 5 Quote duskvstweak Posted August 31, 2016 duskvstweak Members 248 Author Posted August 31, 2016 26 minutes ago, DarkeSword said: Making new friends as an adult after high school/college is actually really difficult. You're not put into situations where you're forced to interact with peers on a regular basis. For gaming friends though, I would suggest meetup.com. There always seems to be some kind of local board game group set up where you can go hang out with people and play board games. This can translate pretty easily into video games. You can also try to create your own gaming group. Maybe contact a local library and see if you can reserve a room with some TVs and set up a weekly gaming thing where folks can drop by and play some Halo. Also, and this is kind of obvious, but there's OC ReMix too. We're a pretty solid community of gamers. Lots of people are real-life friends because of OC ReMix. Not necessarily local, but I know I see my OCR friends almost monthly nowadays due to get-togethers and conventions. Plenty of folks in the community are playing games online like Overwatch, Hearthstone, Final Fantasy XIV, World of Warcraft, etc. We had a pretty active Team Fortress 2 community a few years ago, though I'm not sure how much people play that anymore. Your location says \"nomadic.\" Where are you actually located? Maybe there's some OCR folks out near you. I'm in the rural, lost parts of Western, NY, 90 minutes out of Buffalo, Rochester and Erie, PA. Moved here for my job (teen librarian) but haven't really settled in the year I've been here. You're probably right about meetup. I've gone on it before and there's been nothing happening near me, but like Meteo Xavier said, I'm probably going to have get out of my comfort zone and make it happen. No reason I can't start the meetup. And I really should check into the big multiplayers. Outside of League, I don't play too many MMO-types. Maybe it's time to suck it up and play them. Also, thanks for confirming 30+ isn't an easy time to make friends. Its nice knowing it's not just me. Quote DarkeSword Posted August 31, 2016 DarkeSword Administrators 9.4k OC ReMix Artist Profile Posted August 31, 2016 Plenty of folks on OCR playing LoL too. We really need to get some kind of OCR gaming league going with game nights and guilds and stuff. Kat, Salluz, Drawn by Dai and 1 other 4 Quote prophetik music Posted August 31, 2016 prophetik music Judges 9.2k OC ReMix Artist Profile Posted August 31, 2016 i've bounced around a lot since college, and honestly the only place i consistently met a few people i could be friends with was at our church, which we're pretty involved with. we've been in rochester for probably 3.5 years now but i don't think i'd say i have more than maybe four friends total that i'm really into spending time with consistently who are local, and the age ranges are from 24-33 as a 30yo guy, and they're all from church. i've got coworkers my age but they're no more than acquaintences. i've found i don't have as much time for friends as i used to thanks to kids, so i value more spending time with people i care about rather than tons of shallow interactions. we'll meet a couple and have dinner together once or twice, but to be honest we're pretty picky with who we care to spend our time with at this point i just would rather spend time with my wife than most other people. imo, playing games isn't a great way to get to know someone. a mutual interest in games is definitely a foundation for a friendship, but it's hard to get to know someone during a mentally intense game. if you don't mind me asking, where in western ny are you? we've lived in a lot of areas in W/CNY over the last eight years so i bet we were near you at some point. send me a pm if you don't want to say it here, i browsed your website but didn't see a town name. bardicknowledge, oa, and a few others play league several nights a week. you can add me when you get a chance, my current name is \"i buy movespeed\". we just use skype to talk during games. there's an ocr clan too but no one's ever online who's in it. Quote MindWanderer Posted August 31, 2016 MindWanderer Members 2.9k Posted August 31, 2016 Could be worse, you could be married with children. It's crazy difficult to make friends at that point, especially ones that have anything in common with you except that they also have kids around the same age. And of course making time for anything other than childcare is difficult to begin with. I could probably never buy another game again and still not get through my backlog--and that's just counting the really amazing games on the top of my list, and not the random stuff I got through Humble Bundles and the like. duskvstweak and TheChargingRhino 2 Quote The Nikanoru Posted August 31, 2016 The Nikanoru Members 452 OC ReMix Artist Profile Posted August 31, 2016 17 hours ago, duskvstweak said: Am I just whining about nothing and should just shut up and play. I'm not trying to sound like a cry baby or throw a pity party. I just live far out in rural country and can't shake this loneliness and don't know how to fix it. I've been feeling very similar lately myself, and to be honest, this is one of the reasons I joined OCR. I can't even call myself a true gamer anymore; I don't have the time or money for a lot of the new stuff coming out (PS4 is still over $400 new here in Canada), and I can only play so many remakes of first-person shooters or GoW-style action/adventure before it feels like I'm playing the same game over and over again. I now call myself a retro gamer - and having a wide-spanning, intricate knowledge of a lot of games 10 years old or older does not make for very interesting conversation in many places anymore. Like you, I just stopped mentioning it because it feels like no one cares - and like you, I keep playing because I still really enjoy it. I'm a big fan of storylines and immersive plots, or games where you have to piece together the setting over two or three games, as the developers established the canon. For example, Castlevania is not what you would call immersive plot-wise in each game - maybe one or three lines of text - but piece it together over the series, and you have a pretty engaging plot. Now try talking about that to someone who's never heard of Castlevania! prophetik and Mind Wanderer are telling my biography. I'm married with children as well, don't have much time to get out, very picky over who I spend my time with, long list of games I want that I may never play. The best part is whenever I get used to something or get a good rhythm going, everything changes again. It's a tough thing to plan around, much less build any sort of schedule with others around. As for solutions to this, I think Meteo Xavier has it right in the first step being breaking out of the comfort zone. The whole idea of making friends starts by showing up, right? As Darkesword said, OCR is a good place to start, but not the only place you can go. Maybe joining an online league will help too. One other thing I have found to be somewhat cathartic to me is writing. It doesn't have to be about anything in particular; just the act of writing SOMETHING is a release for me. Not a cure, by any means, but for me, it helps. If you're not into writing, perhaps something expressive in another form like art or maybe MUSIC would be somewhat more up your alley. Just a suggestion. Anyway, you are obviously not alone in how you feel here. I hope one of us is helpful to you. Feel free to drop me a line through the forum here if you ever want to chat. Quote duskvstweak Posted September 1, 2016 duskvstweak Members 248 Author Posted September 1, 2016 5 hours ago, MindWanderer said: Could be worse, you could be married with children. It's crazy difficult to make friends at that point, especially ones that have anything in common with you except that they also have kids around the same age. And of course making time for anything other than childcare is difficult to begin with. I could probably never buy another game again and still not get through my backlog--and that's just counting the really amazing games on the top of my list, and not the random stuff I got through Humble Bundles and the like. Actually, one of my friends I have around here is a recent parent, which means hanging out with him has been almost a no-go too! Kids to make it busy (like you needed me to confirm that for you). Quote duskvstweak Posted September 1, 2016 duskvstweak Members 248 Author Posted September 1, 2016 4 hours ago, The Nikanoru said: I've been feeling very similar lately myself, and to be honest, this is one of the reasons I joined OCR. I can't even call myself a true gamer anymore; I don't have the time or money for a lot of the new stuff coming out (PS4 is still over $400 new here in Canada), and I can only play so many remakes of first-person shooters or GoW-style action/adventure before it feels like I'm playing the same game over and over again. I now call myself a retro gamer - and having a wide-spanning, intricate knowledge of a lot of games 10 years old or older does not make for very interesting conversation in many places anymore. Like you, I just stopped mentioning it because it feels like no one cares - and like you, I keep playing because I still really enjoy it. I'm a big fan of storylines and immersive plots, or games where you have to piece together the setting over two or three games, as the developers established the canon. For example, Castlevania is not what you would call immersive plot-wise in each game - maybe one or three lines of text - but piece it together over the series, and you have a pretty engaging plot. Now try talking about that to someone who's never heard of Castlevania! prophetik and Mind Wanderer are telling my biography. I'm married with children as well, don't have much time to get out, very picky over who I spend my time with, long list of games I want that I may never play. The best part is whenever I get used to something or get a good rhythm going, everything changes again. It's a tough thing to plan around, much less build any sort of schedule with others around. As for solutions to this, I think Meteo Xavier has it right in the first step being breaking out of the comfort zone. The whole idea of making friends starts by showing up, right? As Darkesword said, OCR is a good place to start, but not the only place you can go. Maybe joining an online league will help too. One other thing I have found to be somewhat cathartic to me is writing. It doesn't have to be about anything in particular; just the act of writing SOMETHING is a release for me. Not a cure, by any means, but for me, it helps. If you're not into writing, perhaps something expressive in another form like art or maybe MUSIC would be somewhat more up your alley. Just a suggestion. Anyway, you are obviously not alone in how you feel here. I hope one of us is helpful to you. Feel free to drop me a line through the forum here if you ever want to chat. You're not wrong about the writing, which is a big reason I even started this post. And it's been extremely encouraging hearing that this isn't an isolated experience. I guess this is just part of life. Also, you're in the right for wanting to talk about Castlevania! Thanks for the advice and encouragement. This whole thread has been very helpful too me today. Quote duskvstweak Posted September 1, 2016 duskvstweak Members 248 Author Posted September 1, 2016 7 hours ago, DarkeSword said: Plenty of folks on OCR playing LoL too. We really need to get some kind of OCR gaming league going with game nights and guilds and stuff. I'm honestly surprised this isn't a thing. How is that true? Quote Newt Posted September 1, 2016 Newt Members 177 Posted September 1, 2016 11 minutes ago, duskvstweak said: I'm honestly surprised this isn't a thing. How is that true? Because right now it's not organized. There's a regular group for a couple games, but we just make a habit of inviting each other if we're on. Quote Meteo Xavier Posted September 1, 2016 Meteo Xavier Members 6.3k OC ReMix Artist Profile Posted September 1, 2016 7 hours ago, MindWanderer said: Could be worse, you could be married with children. It's crazy difficult to make friends at that point, especially ones that have anything in common with you except that they also have kids around the same age. And of course making time for anything other than childcare is difficult to begin with. I could probably never buy another game again and still not get through my backlog--and that's just counting the really amazing games on the top of my list, and not the random stuff I got through Humble Bundles and the like. On the other hand, children are potential gaming buddies you literally make. Kids still like to game, don't they? Throwing this out there because the subject of being a parent on OCR tends to skew towards \"Ugh, don't have kids, they always take time away from games/hobbies.\" - It's not that bad. Parents find time to play games too, they just have to sacrifice some of it and work-around it so they can also have the deeply life-enriching experience of building a family. Certainly your parents still had hobbies when you were growing up, right? They didn't just split all their time between working and taking care of you. Quote Neifion Posted September 1, 2016 Neifion Members 409 Posted September 1, 2016 If some people want to get an Overwatch competitive team going, I'd be all for it. Season 2 is coming up and I always had fun the few times I played with full teams. Would be nice to have a regular list of people to queue up with. TheChargingRhino and Garpocalypse 2 Quote duskvstweak Posted September 1, 2016 duskvstweak Members 248 Author Posted September 1, 2016 37 minutes ago, Meteo Xavier said: On the other hand, children are potential gaming buddies you literally make. Kids still like to game, don't they? Throwing this out there because the subject of being a parent on OCR tends to skew towards \"Ugh, don't have kids, they always take time away from games/hobbies.\" - It's not that bad. Parents find time to play games too, they just have to sacrifice some of it and work-around it so they can also have the deeply life-enriching experience of building a family. Certainly your parents still had hobbies when you were growing up, right? They didn't just split all their time between working and taking care of you. I did play a lot of Donkey Kong Country, Mario Kart and Street Fighter II with my mom as a 7 year old... The Nikanoru and TheChargingRhino 2 Quote prophetik music Posted September 1, 2016 prophetik music Judges 9.2k OC ReMix Artist Profile Posted September 1, 2016 my kids are in bed by 7pm every night. i usually hang out with my wife till 9ish, and then play games until 1130. it's not six hours in a row like college...but i haven't done that since i was married, since i like my wife and would prefer she stay my wife. i never really gamed during the day while my wife was awake anyways, so it's not like i lost much. kids hamper social outings, since you've got less time that they're awake to do things during the week. they don't hamper tend to my gaming much. Quote OceansAndrew Posted September 1, 2016 OceansAndrew Members 7k OC ReMix Artist Profile Posted September 1, 2016 it was fun last night playing league - i'd definitely do some more of that. TheChargingRhino, duskvstweak and prophetik music 3 Quote k-wix Posted September 1, 2016 k-wix Members 414 OC ReMix Artist Profile Posted September 1, 2016 I play league almost daily - and am always looking for new people to play with. Feel free to drop me an invite anytime you see me on. And totally agree on the whole friends thing, I'll be hitting 33 this year, and our friendship circle is like..non-existent. I need to make some new friends soon. Quote duskvstweak Posted September 1, 2016 duskvstweak Members 248 Author Posted September 1, 2016 26 minutes ago, k-wix said: I play league almost daily - and am always looking for new people to play with. Feel free to drop me an invite anytime you see me on. And totally agree on the whole friends thing, I'll be hitting 33 this year, and our friendship circle is like..non-existent. I need to make some new friends soon. Yeah, the more I moved around during and post-college, the smaller my friends group got, especially locally. And I'll look for you next time I'm on. 19 hours ago, prophetik music said: mo, playing games isn't a great way to get to know someone. a mutual interest in games is definitely a foundation for a friendship, but it's hard to get to know someone during a mentally intense game. You're right, and it's part of the reason I've had a hard time going to game stores and joining in. I get to play the games, sure, but I've made almost zero connections. So much time is spent learning game and playing, I don't have time to even ask questions. Quote Garpocalypse Posted September 1, 2016 Garpocalypse Members 2.2k OC ReMix Artist Profile Posted September 1, 2016 I know what you're feeling. My best gaming buddy from elementary school onward gave up the hobby two months after he got married just over a year ago. It was an awkward day when he gave me his giant Crate o' Games and said \"I'm done.\" It's sad but I don't think it's possible to have gaming friends after college outside of OCR and other VG/VGM communities of course. For a lot of people, life and survival becomes their game once they fall from their parents nest. Some of the best friends i've made in my thirties didn't ever want to play games when we got together, and that goes for former gamers too. There is definitely a \"this person just wastes time\" stigma to people finding out that you like to spend your free time gaming. Honestly, I don't understand why it's more socially favorable to read a book, watch a movie or engage in some other non-productive non-gaming activity. This is why i'm glad to be a part of this community because for the most part we are all very like minded toward the hobby/art. ..on the plus side I did turn that Crate o' Games into a few hundred bucks on Amazon. TheChargingRhino and duskvstweak 2 Quote The Nikanoru Posted September 1, 2016 The Nikanoru Members 452 OC ReMix Artist Profile Posted September 1, 2016 3 hours ago, Garpocalypse said: This is why i'm glad to be a part of this community because for the most part we are all very like minded toward the hobby/art. Hear hear! TheChargingRhino and Garpocalypse 2 Quote BardicKnowledge Posted September 1, 2016 BardicKnowledge Members 2.8k OC ReMix Artist Profile Posted September 1, 2016 Tangentially related: I am the OC ReMix clan leader for League of Legends -- I am RTBardic there, and I am on usually 4x a week (almost always with one of prophetik, OA, or newt). I know I added the OP to the clan, but anyone else should feel free to ask for a clan invite. It's a good way to find people who are online -- and there are a lot of us here who play League. Quote prophetik music Posted September 2, 2016 prophetik music Judges 9.2k OC ReMix Artist Profile Posted September 2, 2016 wait, kwix, you still play? haven't seen you on in ages. i guess we play at different times. Quote MindWanderer Posted September 2, 2016 MindWanderer Members 2.9k Posted September 2, 2016 On 8/31/2016 at 8:10 PM, Meteo Xavier said: On the other hand, children are potential gaming buddies you literally make. Kids still like to game, don't they? Throwing this out there because the subject of being a parent on OCR tends to skew towards \"Ugh, don't have kids, they always take time away from games/hobbies.\" - It's not that bad. Parents find time to play games too, they just have to sacrifice some of it and work-around it so they can also have the deeply life-enriching experience of building a family. Certainly your parents still had hobbies when you were growing up, right? They didn't just split all their time between working and taking care of you. Oh, yeah. A friend who moved to another state made me very jealous by playing Portal 2 with his daughter. But my daughter just turned 2 years old, and all our current friends' kids are no older than 4, so it's gonna be a while. Believe me, I'm constantly evaluating them to see when they might be able to handle even something as simple as a LEGO game. I have a long list of co-op games I want to try with my daughter when she's old enough, and hope she'll be interested. TheChargingRhino and duskvstweak 2 Quote k-wix Posted September 4, 2016 k-wix Members 414 OC ReMix Artist Profile Posted September 4, 2016 On 9/2/2016 at 9:17 AM, prophetik music said: wait, kwix, you still play? haven't seen you on in ages. i guess we play at different times. Yes! I generally work in the mornings, so I play in the mid-day when I get off, before my wife gets home. I play some nights too, but usually I'm in bed fairly early, because I'm old and sleeping is the best. Not sure if I have your summoner name or not. Summoner name is k wìx Also, if anyone is curious about getting into the game, I love teaching it to newer players. There is a ton to learn. Quote Prev 1 2 Next Page 1 of 2 Join the conversation You can post now and register later. If you have an account, sign in now to post with your account. Reply × Pasted as rich text. Paste as plain text instead Only 75 emoji are allowed. × Your link has been automatically embedded. Display as a link instead × Your previous content has been restored. Clear editor × You cannot paste images directly. Upload or insert images from URL. Insert image from URL × Desktop Tablet Phone Submit Reply Share https://ocremix.org/community/topic/44249-lonely-gamer-doesnt-know-how-to-make-friends-anymore/ More sharing options... Followers 3 Go to topic listing All Activity Home Community General Discussion Lonely gamer doesn't know how to make friends anymore. Theme Default OC ReMix (Default) Privacy Policy Cookies Powered by Invision Community × Existing user? Sign In Sign Up Browse Back Forums Events Guidelines Staff Online Users ReMix Submissions Back Submissions Tracking Currently in the Judging Process Judges Decisions Activity Back All Activity My Activity Streams Unread Content Content I Started Search Leaderboard Clubs × Create New... home | donate | interviews | links | store | submit | torrents about OverClocked ReMix... About OC ReMix Contact Us FAQ Press Staff Translated Materials es fr jp community Forums Account Settings Login / Register Rules Search Forums Home Community Workshop Comments/Reviews Chat OC ReMix Discord Chat Server (come join us, it's fun!) Social Networking & RSS games Games List All Games: Alphabetically - Newest - Most ReMixes Systems Arcade/Coin-op DS Game Boy / Color Game Boy Advance GameCube N64 NES SNES Wii Dreamcast Game Gear Genesis Master System Saturn Sega CD DOS MSX Windows Xbox Xbox 360 PlayStation PlayStation 2 PlayStation 3 PSP Other: Amiga Atari ST Commodore 64 Neo Geo TurboGrafx-16 ...More music ReMixes List All ReMixes: Alphabetically - Newest Albums List All Albums: Alphabetically - Newest Songs List All Songs: Alphabetically - Most ReMixes Torrents Download everything & help save our bandwidth using the OC ReMix BitTorrent Tracker people Artists List All Artists: Alphabetically Interviews Check out the latest interviews! Organizations List All Organizations: Alphabetically Other... Staff workshop",
      "title": "Published Time: 2016-08-31T02:43:07+0000 Lonely gamer doesn't know how to make friends anymore. - General Discussion - OC ReMix Community Jump to content Existing user? Sign In Sign In Remember me Not recommended on shared computers Sign InForgot your password? Or sign in with one of these services Sign in with Facebook Sign in with Google Sign Up Browse Forums Events Guidelines Staff Online Users More ReMix Submissions Submissions Tracking Currently in the Judging Process Judges Decisions More Activity All Activity My Activity Streams Unread Content Content I Started Search More Leaderboard Clubs More More Everywhere This Forum This Topic Status Updates Topics Pages Articles Events Members General Discussion All Activity Home Community General Discussion Lonely gamer doesn't know how to make friends anymore. Lonely gamer doesn't know how to make friends anymore. By duskvstweak, August 31, 2016 in General Discussion Share https://ocremix.org/community/topic/44249-lonely-gamer-doesnt-know-how-to-make-friends-anymore/ More sharing options... Followers 3 Reply new topic Prev 1 2 Next Page 1 of 2 Recommended Posts duskvstweak Posted August 31, 2016 duskvstweak Members 248 Posted August 31, 2016 I don't have any gamer friends where I live and my wife, bless her, isn't a gamer either. But I play a lot and don't feel like I have anyone to talk to about those games. I think the loneliness connected to one of my favorite hobbies is really starting to have an effect on me. I used to have friends where I lived before who played with and talked about them with me, but I've moved a bunch since and at 30, making new friends feels impossible. College really spoiled me and now adulthood seems so empty as a gamer, even though I still love playing! My Steam friends list is my two uncles and one friend from home, an they're never on. I tend to be a bit more depressed than most, but it just seems different with this. No one to relate to, or talk to. Is there a site/forum/game I should be spending time in? I've tried twitch, but it just seems to enhance the loneliness (does that make sense?Maybe I don't twitch right!) Am I just whining about nothing and should just shut up and play. I'm not trying to sound like a cry baby or throw a pity party. I just live far out in rural country and can't shake this loneliness and don't know how to fix it. Quote Meteo Xavier Posted August 31, 2016 Meteo Xavier Members 6.3k OC ReMix Artist Profile Posted August 31, 2016 It happens in your 30s. You just keep looking around local and online as best you can and fill it up where you can. Get outside the box and try things you probably wouldn't have tried before. Pretty hard to be more specific as to what things those are from there, but with the will to move can inevitably reveal the path to get there. k-wix, duskvstweak, TheChargingRhino and 1 other 4 Quote DarkeSword Posted August 31, 2016 DarkeSword Administrators 9.4k OC ReMix Artist Profile Posted August 31, 2016 Making new friends as an adult after high school/college is actually really difficult. You're not put into situations where you're forced to interact with peers on a regular basis. For gaming friends though, I would suggest meetup.com. There always seems to be some kind of local board game group set up where you can go hang out with people and play board games. This can translate pretty easily into video games. You can also try to create your own gaming group. Maybe contact a local library and see if you can reserve a room with some TVs and set up a weekly gaming thing where folks can drop by and play some Halo. Also, and this is kind of obvious, but there's OC ReMix too. We're a pretty solid community of gamers. Lots of people are real-life friends because of OC ReMix. Not necessarily local, but I know I see my OCR friends almost monthly nowadays due to get-togethers and conventions. Plenty of folks in the community are playing games online like Overwatch, Hearthstone, Final Fantasy XIV, World of Warcraft, etc. We had a pretty active Team Fortress 2 community a few years ago, though I'm not sure how much people play that anymore. Your location says \"nomadic.\" Where are you actually located? Maybe there's some OCR folks out near you. TheChargingRhino, Geoffrey Taucer, Garpocalypse and 2 others 5 Quote duskvstweak Posted August 31, 2016 duskvstweak Members 248 Author Posted August 31, 2016 26 minutes ago, DarkeSword said: Making new friends as an adult after high school/college is actually really difficult. You're not put into situations where you're forced to interact with peers on a regular basis. For gaming friends though, I would suggest meetup.com. There always seems to be some kind of local board game group set up where you can go hang out with people and play board games. This can translate pretty easily into video games. You can also try to create your own gaming group. Maybe contact a local library and see if you can reserve a room with some TVs and set up a weekly gaming thing where folks can drop by and play some Halo. Also, and this is kind of obvious, but there's OC ReMix too. We're a pretty solid community of gamers. Lots of people are real-life friends because of OC ReMix. Not necessarily local, but I know I see my OCR friends almost monthly nowadays due to get-togethers and conventions. Plenty of folks in the community are playing games online like Overwatch, Hearthstone, Final Fantasy XIV, World of Warcraft, etc. We had a pretty active Team Fortress 2 community a few years ago, though I'm not sure how much people play that anymore. Your location says \"nomadic.\" Where are you actually located? Maybe there's some OCR folks out near you. I'm in the rural, lost parts of Western, NY, 90 minutes out of Buffalo, Rochester and Erie, PA. Moved here for my job (teen librarian) but haven't really settled in the year I've been here. You're probably right about meetup. I've gone on it before and there's been nothing happening near me, but like Meteo Xavier said, I'm probably going to have get out of my comfort zone and make it happen. No reason I can't start the meetup. And I really should check into the big multiplayers. Outside of League, I don't play too many MMO-types. Maybe it's time to suck it up and play them. Also, thanks for confirming 30+ isn't an easy time to make friends. Its nice knowing it's not just me. Quote DarkeSword Posted August 31, 2016 DarkeSword Administrators 9.4k OC ReMix Artist Profile Posted August 31, 2016 Plenty of folks on OCR playing LoL too. We really need to get some kind of OCR gaming league going with game nights and guilds and stuff. Kat, Salluz, Drawn by Dai and 1 other 4 Quote prophetik music Posted August 31, 2016 prophetik music Judges 9.2k OC ReMix Artist Profile Posted August 31, 2016 i've bounced around a lot since college, and honestly the only place i consistently met a few people i could be friends with was at our church, which we're pretty involved with. we've been in rochester for probably 3.5 years now but i don't think i'd say i have more than maybe four friends total that i'm really into spending time with consistently who are local, and the age ranges are from 24-33 as a 30yo guy, and they're all from church. i've got coworkers my age but they're no more than acquaintences. i've found i don't have as much time for friends as i used to thanks to kids, so i value more spending time with people i care about rather than tons of shallow interactions. we'll meet a couple and have dinner together once or twice, but to be honest we're pretty picky with who we care to spend our time with at this point i just would rather spend time with my wife than most other people. imo, playing games isn't a great way to get to know someone. a mutual interest in games is definitely a foundation for a friendship, but it's hard to get to know someone during a mentally intense game. if you don't mind me asking, where in western ny are you? we've lived in a lot of areas in W/CNY over the last eight years so i bet we were near you at some point. send me a pm if you don't want to say it here, i browsed your website but didn't see a town name. bardicknowledge, oa, and a few others play league several nights a week. you can add me when you get a chance, my current name is \"i buy movespeed\". we just use skype to talk during games. there's an ocr clan too but no one's ever online who's in it. Quote MindWanderer Posted August 31, 2016 MindWanderer Members 2.9k Posted August 31, 2016 Could be worse, you could be married with children. It's crazy difficult to make friends at that point, especially ones that have anything in common with you except that they also have kids around the same age. And of course making time for anything other than childcare is difficult to begin with. I could probably never buy another game again and still not get through my backlog--and that's just counting the really amazing games on the top of my list, and not the random stuff I got through Humble Bundles and the like. duskvstweak and TheChargingRhino 2 Quote The Nikanoru Posted August 31, 2016 The Nikanoru Members 452 OC ReMix Artist Profile Posted August 31, 2016 17 hours ago, duskvstweak said: Am I just whining about nothing and should just shut up and play. I'm not trying to sound like a cry baby or throw a pity party. I just live far out in rural country and can't shake this loneliness and don't know how to fix it. I've been feeling very similar lately myself, and to be honest, this is one of the reasons I joined OCR. I can't even call myself a true gamer anymore; I don't have the time or money for a lot of the new stuff coming out (PS4 is still over $400 new here in Canada), and I can only play so many remakes of first-person shooters or GoW-style action/adventure before it feels like I'm playing the same game over and over again. I now call myself a retro gamer - and having a wide-spanning, intricate knowledge of a lot of games 10 years old or older does not make for very interesting conversation in many places anymore. Like you, I just stopped mentioning it because it feels like no one cares - and like you, I keep playing because I still really enjoy it. I'm a big fan of storylines and immersive plots, or games where you have to piece together the setting over two or three games, as the developers established the canon. For example, Castlevania is not what you would call immersive plot-wise in each game - maybe one or three lines of text - but piece it together over the series, and you have a pretty engaging plot. Now try talking about that to someone who's never heard of Castlevania! prophetik and Mind Wanderer are telling my biography. I'm married with children as well, don't have much time to get out, very picky over who I spend my time with, long list of games I want that I may never play. The best part is whenever I get used to something or get a good rhythm going, everything changes again. It's a tough thing to plan around, much less build any sort of schedule with others around. As for solutions to this, I think Meteo Xavier has it right in the first step being breaking out of the comfort zone. The whole idea of making friends starts by showing up, right? As Darkesword said, OCR is a good place to start, but not the only place you can go. Maybe joining an online league will help too. One other thing I have found to be somewhat cathartic to me is writing. It doesn't have to be about anything in particular; just the act of writing SOMETHING is a release for me. Not a cure, by any means, but for me, it helps. If you're not into writing, perhaps something expressive in another form like art or maybe MUSIC would be somewhat more up your alley. Just a suggestion. Anyway, you are obviously not alone in how you feel here. I hope one of us is helpful to you. Feel free to drop me a line through the forum here if you ever want to chat. Quote duskvstweak Posted September 1, 2016 duskvstweak Members 248 Author Posted September 1, 2016 5 hours ago, MindWanderer said: Could be worse, you could be married with children. It's crazy difficult to make friends at that point, especially ones that have anything in common with you except that they also have kids around the same age. And of course making time for anything other than childcare is difficult to begin with. I could probably never buy another game again and still not get through my backlog--and that's just counting the really amazing games on the top of my list, and not the random stuff I got through Humble Bundles and the like. Actually, one of my friends I have around here is a recent parent, which means hanging out with him has been almost a no-go too! Kids to make it busy (like you needed me to confirm that for you). Quote duskvstweak Posted September 1, 2016 duskvstweak Members 248 Author Posted September 1, 2016 4 hours ago, The Nikanoru said: I've been feeling very similar lately myself, and to be honest, this is one of the reasons I joined OCR. I can't even call myself a true gamer anymore; I don't have the time or money for a lot of the new stuff coming out (PS4 is still over $400 new here in Canada), and I can only play so many remakes of first-person shooters or GoW-style action/adventure before it feels like I'm playing the same game over and over again. I now call myself a retro gamer - and having a wide-spanning, intricate knowledge of a lot of games 10 years old or older does not make for very interesting conversation in many places anymore. Like you, I just stopped mentioning it because it feels like no one cares - and like you, I keep playing because I still really enjoy it. I'm a big fan of storylines and immersive plots, or games where you have to piece together the setting over two or three games, as the developers established the canon. For example, Castlevania is not what you would call immersive plot-wise in each game - maybe one or three lines of text - but piece it together over the series, and you have a pretty engaging plot. Now try talking about that to someone who's never heard of Castlevania! prophetik and Mind Wanderer are telling my biography. I'm married with children as well, don't have much time to get out, very picky over who I spend my time with, long list of games I want that I may never play. The best part is whenever I get used to something or get a good rhythm going, everything changes again. It's a tough thing to plan around, much less build any sort of schedule with others around. As for solutions to this, I think Meteo Xavier has it right in the first step being breaking out of the comfort zone. The whole idea of making friends starts by showing up, right? As Darkesword said, OCR is a good place to start, but not the only place you can go. Maybe joining an online league will help too. One other thing I have found to be somewhat cathartic to me is writing. It doesn't have to be about anything in particular; just the act of writing SOMETHING is a release for me. Not a cure, by any means, but for me, it helps. If you're not into writing, perhaps something expressive in another form like art or maybe MUSIC would be somewhat more up your alley. Just a suggestion. Anyway, you are obviously not alone in how you feel here. I hope one of us is helpful to you. Feel free to drop me a line through the forum here if you ever want to chat. You're not wrong about the writing, which is a big reason I even started this post. And it's been extremely encouraging hearing that this isn't an isolated experience. I guess this is just part of life. Also, you're in the right for wanting to talk about Castlevania! Thanks for the advice and encouragement. This whole thread has been very helpful too me today. Quote duskvstweak Posted September 1, 2016 duskvstweak Members 248 Author Posted September 1, 2016 7 hours ago, DarkeSword said: Plenty of folks on OCR playing LoL too. We really need to get some kind of OCR gaming league going with game nights and guilds and stuff. I'm honestly surprised this isn't a thing. How is that true? Quote Newt Posted September 1, 2016 Newt Members 177 Posted September 1, 2016 11 minutes ago, duskvstweak said: I'm honestly surprised this isn't a thing. How is that true? Because right now it's not organized. There's a regular group for a couple games, but we just make a habit of inviting each other if we're on. Quote Meteo Xavier Posted September 1, 2016 Meteo Xavier Members 6.3k OC ReMix Artist Profile Posted September 1, 2016 7 hours ago, MindWanderer said: Could be worse, you could be married with children. It's crazy difficult to make friends at that point, especially ones that have anything in common with you except that they also have kids around the same age. And of course making time for anything other than childcare is difficult to begin with. I could probably never buy another game again and still not get through my backlog--and that's just counting the really amazing games on the top of my list, and not the random stuff I got through Humble Bundles and the like. On the other hand, children are potential gaming buddies you literally make. Kids still like to game, don't they? Throwing this out there because the subject of being a parent on OCR tends to skew towards \"Ugh, don't have kids, they always take time away from games/hobbies.\" - It's not that bad. Parents find time to play games too, they just have to sacrifice some of it and work-around it so they can also have the deeply life-enriching experience of building a family. Certainly your parents still had hobbies when you were growing up, right? They didn't just split all their time between working and taking care of you. Quote Neifion Posted September 1, 2016 Neifion Members 409 Posted September 1, 2016 If some people want to get an Overwatch competitive team going, I'd be all for it. Season 2 is coming up and I always had fun the few times I played with full teams. Would be nice to have a regular list of people to queue up with. TheChargingRhino and Garpocalypse 2 Quote duskvstweak Posted September 1, 2016 duskvstweak Members 248 Author Posted September 1, 2016 37 minutes ago, Meteo Xavier said: On the other hand, children are potential gaming buddies you literally make. Kids still like to game, don't they? Throwing this out there because the subject of being a parent on OCR tends to skew towards \"Ugh, don't have kids, they always take time away from games/hobbies.\" - It's not that bad. Parents find time to play games too, they just have to sacrifice some of it and work-around it so they can also have the deeply life-enriching experience of building a family. Certainly your parents still had hobbies when you were growing up, right? They didn't just split all their time between working and taking care of you. I did play a lot of Donkey Kong Country, Mario Kart and Street Fighter II with my mom as a 7 year old... The Nikanoru and TheChargingRhino 2 Quote prophetik music Posted September 1, 2016 prophetik music Judges 9.2k OC ReMix Artist Profile Posted September 1, 2016 my kids are in bed by 7pm every night. i usually hang out with my wife till 9ish, and then play games until 1130. it's not six hours in a row like college...but i haven't done that since i was married, since i like my wife and would prefer she stay my wife. i never really gamed during the day while my wife was awake anyways, so it's not like i lost much. kids hamper social outings, since you've got less time that they're awake to do things during the week. they don't hamper tend to my gaming much. Quote OceansAndrew Posted September 1, 2016 OceansAndrew Members 7k OC ReMix Artist Profile Posted September 1, 2016 it was fun last night playing league - i'd definitely do some more of that. TheChargingRhino, duskvstweak and prophetik music 3 Quote k-wix Posted September 1, 2016 k-wix Members 414 OC ReMix Artist Profile Posted September 1, 2016 I play league almost daily - and am always looking for new people to play with. Feel free to drop me an invite anytime you see me on. And totally agree on the whole friends thing, I'll be hitting 33 this year, and our friendship circle is like..non-existent. I need to make some new friends soon. Quote duskvstweak Posted September 1, 2016 duskvstweak Members 248 Author Posted September 1, 2016 26 minutes ago, k-wix said: I play league almost daily - and am always looking for new people to play with. Feel free to drop me an invite anytime you see me on. And totally agree on the whole friends thing, I'll be hitting 33 this year, and our friendship circle is like..non-existent. I need to make some new friends soon. Yeah, the more I moved around during and post-college, the smaller my friends group got, especially locally. And I'll look for you next time I'm on. 19 hours ago, prophetik music said: mo, playing games isn't a great way to get to know someone. a mutual interest in games is definitely a foundation for a friendship, but it's hard to get to know someone during a mentally intense game. You're right, and it's part of the reason I've had a hard time going to game stores and joining in. I get to play the games, sure, but I've made almost zero connections. So much time is spent learning game and playing, I don't have time to even ask questions. Quote Garpocalypse Posted September 1, 2016 Garpocalypse Members 2.2k OC ReMix Artist Profile Posted September 1, 2016 I know what you're feeling. My best gaming buddy from elementary school onward gave up the hobby two months after he got married just over a year ago. It was an awkward day when he gave me his giant Crate o' Games and said \"I'm done.\" It's sad but I don't think it's possible to have gaming friends after college outside of OCR and other VG/VGM communities of course. For a lot of people, life and survival becomes their game once they fall from their parents nest. Some of the best friends i've made in my thirties didn't ever want to play games when we got together, and that goes for former gamers too. There is definitely a \"this person just wastes time\" stigma to people finding out that you like to spend your free time gaming. Honestly, I don't understand why it's more socially favorable to read a book, watch a movie or engage in some other non-productive non-gaming activity. This is why i'm glad to be a part of this community because for the most part we are all very like minded toward the hobby/art. ..on the plus side I did turn that Crate o' Games into a few hundred bucks on Amazon. TheChargingRhino and duskvstweak 2 Quote The Nikanoru Posted September 1, 2016 The Nikanoru Members 452 OC ReMix Artist Profile Posted September 1, 2016 3 hours ago, Garpocalypse said: This is why i'm glad to be a part of this community because for the most part we are all very like minded toward the hobby/art. Hear hear! TheChargingRhino and Garpocalypse 2 Quote BardicKnowledge Posted September 1, 2016 BardicKnowledge Members 2.8k OC ReMix Artist Profile Posted September 1, 2016 Tangentially related: I am the OC ReMix clan leader for League of Legends -- I am RTBardic there, and I am on usually 4x a week (almost always with one of prophetik, OA, or newt). I know I added the OP to the clan, but anyone else should feel free to ask for a clan invite. It's a good way to find people who are online -- and there are a lot of us here who play League. Quote prophetik music Posted September 2, 2016 prophetik music Judges 9.2k OC ReMix Artist Profile Posted September 2, 2016 wait, kwix, you still play? haven't seen you on in ages. i guess we play at different times. Quote MindWanderer Posted September 2, 2016 MindWanderer Members 2.9k Posted September 2, 2016 On 8/31/2016 at 8:10 PM, Meteo Xavier said: On the other hand, children are potential gaming buddies you literally make. Kids still like to game, don't they? Throwing this out there because the subject of being a parent on OCR tends to skew towards \"Ugh, don't have kids, they always take time away from games/hobbies.\" - It's not that bad. Parents find time to play games too, they just have to sacrifice some of it and work-around it so they can also have the deeply life-enriching experience of building a family. Certainly your parents still had hobbies when you were growing up, right? They didn't just split all their time between working and taking care of you. Oh, yeah. A friend who moved to another state made me very jealous by playing Portal 2 with his daughter. But my daughter just turned 2 years old, and all our current friends' kids are no older than 4, so it's gonna be a while. Believe me, I'm constantly evaluating them to see when they might be able to handle even something as simple as a LEGO game. I have a long list of co-op games I want to try with my daughter when she's old enough, and hope she'll be interested. TheChargingRhino and duskvstweak 2 Quote k-wix Posted September 4, 2016 k-wix Members 414 OC ReMix Artist Profile Posted September 4, 2016 On 9/2/2016 at 9:17 AM, prophetik music said: wait, kwix, you still play? haven't seen you on in ages. i guess we play at different times. Yes! I generally work in the mornings, so I play in the mid-day when I get off, before my wife gets home. I play some nights too, but usually I'm in bed fairly early, because I'm old and sleeping is the best. Not sure if I have your summoner name or not. Summoner name is k wìx Also, if anyone is curious about getting into the game, I love teaching it to newer players. There is a ton to learn. Quote Prev 1 2 Next Page 1 of 2 Join the conversation You can post now and register later. If you have an account, sign in now to post with your account. Reply × Pasted as rich text. Paste as plain text instead Only 75 emoji are allowed. × Your link has been automatically embedded. Display as a link instead × Your previous content has been restored. Clear editor × You cannot paste images directly. Upload or insert images from URL. Insert image from URL × Desktop Tablet Phone Submit Reply Share https://ocremix.org/community/topic/44249-lonely-gamer-doesnt-know-how-to-make-friends-anymore/ More sharing options... Followers 3 Go to topic listing All Activity Home Community General Discussion Lonely gamer doesn't know how to make friends anymore. Theme Default OC ReMix (Default) Privacy Policy Cookies Powered by Invision Community × Existing user? Sign In Sign Up Browse Back Forums Events Guidelines Staff Online Users ReMix Submissions Back Submissions Tracking Currently in the Judging Process Judges Decisions Activity Back All Activity My Activity Streams Unread Content Content I Started Search Leaderboard Clubs × Create New... home | donate | interviews | links | store | submit | torrents about OverClocked ReMix... About OC ReMix Contact Us FAQ Press Staff Translated Materials es fr jp community Forums Account Settings Login / Register Rules Search Forums Home Community Workshop Comments/Reviews Chat OC ReMix Discord Chat Server (come join us, it's fun!) Social Networking & RSS games Games List All Games: Alphabetically - Newest - Most ReMixes Systems Arcade/Coin-op DS Game Boy / Color Game Boy Advance GameCube N64 NES SNES Wii Dreamcast Game Gear Genesis Master System Saturn Sega CD DOS MSX Windows Xbox Xbox 360 PlayStation PlayStation 2 PlayStation 3 PSP Other: Amiga Atari ST Commodore 64 Neo Geo TurboGrafx-16 ...More music ReMixes List All ReMixes: Alphabetically - Newest Albums List All Albums: Alphabetically - Newest Songs List All Songs: Alphabetically - Most ReMixes Torrents Download everything & help save our bandwidth using the OC ReMix BitTorrent Tracker people Artists List All Artists: Alphabetically Interviews Check out the latest interviews! Organizations List All Organizations: Alphabetically Other... Staff workshop"
    },
    {
      "url": "https://www.quora.com/Why-is-it-so-hard-to-make-friends-in-person-as-a-gamer",
      "content": "Why do gamers have trouble approaching people in real life? - Quora Something went wrong. Wait a moment and try again. Try again Skip to content Skip to search Sign In Why do gamers have trouble approaching people in real life? All related (38) Sort Recommended Emma Kleis Freelancer at Upwork (2021–present) · Author has 1.5K answers and 11.9M answer views · 3y Elaborate answer to a simple question coming up. Gamers make friends through a screen. That’s what they have always done, and it works for them. They are anonymous; they can pick and choose who they want to continue talking to and who they never want to speak to again. If they do or say something embarrassing, it’s not that bad. If they act themselves from the get-go, they don’t need to worry about that physical pressure, they can just be them, decide who they like and dislike and that’s it. Oh, and they don’t need to put clothes on to meet new people… or get out. In real life, I see several pro Continue Reading Elaborate answer to a simple question coming up. Gamers make friends through a screen. That’s what they have always done, and it works for them. They are anonymous; they can pick and choose who they want to continue talking to and who they never want to speak to again. If they do or say something embarrassing, it’s not that bad. If they act themselves from the get-go, they don’t need to worry about that physical pressure, they can just be them, decide who they like and dislike and that’s it. Oh, and they don’t need to put clothes on to meet new people… or get out. In real life, I see several problems if you can call them that: Once they have met someone new, ghosting them is not possible because now you have some kind of responsibility to that other person to at least let them down slowly. That sucks! Now you can no longer pick and choose who you want to be friends with. You can’t be yourself from the get-go. Some people can, that’s great, but not everyone is confident enough to just go out there and be a ‘take-me-as-I-am-or-leave-me’ type of person. So, you have to go through this awkward phase of getting to know each other and that can be a real pain. They feel social pressure talking to new people because you actually have to look them in the eye, feel their energy (not a spiritual post, I swear), read their body language. You can’t just leave them on read and wait to reply until the next day. You need to reply on the fly. You don’t speak the same language. As a gamer, this is something I relate to hard. Sometimes, I almost say pog or pepega in real life before I catch myself. In order to rephrase that, I spend like 10 seconds in my head thinking about how to convey a sentence with the proper emotions I wanted to display. It sounds ridiculous, but it’s true. You don’t get the same references. They’re talking about some new show on Netflix, and I’m over here wanting to share the fact that I literally RNGd 2 leggos in one lootbox. You know what I mean? A lot of gamers are introverted, reserved people as well. Some aren’t, but a lot are. Those who aren’t know how to socialize, and then you don’t realize they’re gamers, but they are, they just don’t go around announcing it. They don’t need to put effort into their appearance online either, so it’s just a bother to get up and out. Haha. Upvote · 96 Promoted by Savings Pro Mark Bradley Economist · Updated Dec 1 What are the stupidest money mistakes most people make? Where do I start? I’m a huge financial nerd, and have spent an embarrassing amount of time talking to people about their money habits. Here are the biggest mistakes people are making and how to fix them: Not having a separate high interest savings account Having a separate account allows you to see the results of all your hard work and keep your money separate so you're less tempted to spend it. Plus with rates above 5.00%, the interest you can earn compared to most banks really adds up. Here is a list of the top savings accounts available today. Deposit $5 before moving on because this is one of th Continue Reading Where do I start? I’m a huge financial nerd, and have spent an embarrassing amount of time talking to people about their money habits. Here are the biggest mistakes people are making and how to fix them: Not having a separate high interest savings account Having a separate account allows you to see the results of all your hard work and keep your money separate so you're less tempted to spend it. Plus with rates above 5.00%, the interest you can earn compared to most banks really adds up. Here is a list of the top savings accounts available today. Deposit $5 before moving on because this is one of the biggest mistakes and easiest ones to fix. Overpaying on car insurance You’ve heard it a million times before, but the average American family still overspends by $417/year on car insurance. If you’ve been with the same insurer for years, chances are you are one of them. Pull up Coverage.com, a free site that will compare prices for you, answer the questions on the page, and it will show you how much you could be saving. That’s it. You’ll likely be saving a bunch of money. Here’s a link to give it a try. Consistently being in debt If you’ve got $10K+ in debt (credit cards…medical bills…anything really) you could use a debt relief program and potentially reduce by over 20%. Here’s how to see if you qualify: Head over to this Debt Relief comparison website here, then simply answer the questions to see if you qualify. It’s as simple as that. You’ll likely end up paying less than you owed before and you could be debt free in as little as 2 years. Missing out on free money to invest It’s no secret that millionaires love investing, but for the rest of us, it can seem out of reach. Times have changed. There are a number of investing platforms that will give you a bonus to open an account and get started. All you have to do is open the account and invest at least $25, and you could get up to $1000 in bonus. Pretty sweet deal right? Here is a link to some of the best options. Having bad credit A low credit score can come back to bite you in so many ways in the future. From that next rental application to getting approved for any type of loan or credit card, if you have a bad history with credit, the good news is you can fix it. Head over to BankRate.com and answer a few questions to see if you qualify. It only takes a few minutes and could save you from a major upset down the line. How to get started Hope this helps! Here are the links to get started: Have a separate savings account Stop overpaying for car insurance Finally get out of debt Start investing with a free bonus Fix your credit Upvote · 2.6K2.6K 999402 999120 Related questions More answers below Are gamers who are mean online mean in real life? Do gamers and non-gamers interact with each other? There is any real gamer dating sites? Why do people converse with other people in real life? What do gamers typically do when they meet each other in real life? Christopher Boyd .NET Developer (2018–present) · 7mo Originally Answered: Why is it so hard to make friends in-person as a gamer? · Making friends in person as a gamer can sometimes be challenging due to a few reasons: 1> Niche Interests: Gaming can be seen as a niche interest, and not everyone you encounter in person may share that interest to the same extent. This can limit the pool of potential friends you meet in face-to-face interactions. 2> Social Stigma: Despite gaming’s growing mainstream acceptance, there can still be lingering social stigma attached to it. Some people may hold misconceptions about gamers, which could make it harder to connect with them. 3> Introversion: Many gamers identify as introverts, meaning th Continue Reading Making friends in person as a gamer can sometimes be challenging due to a few reasons: 1> Niche Interests: Gaming can be seen as a niche interest, and not everyone you encounter in person may share that interest to the same extent. This can limit the pool of potential friends you meet in face-to-face interactions. 2> Social Stigma: Despite gaming’s growing mainstream acceptance, there can still be lingering social stigma attached to it. Some people may hold misconceptions about gamers, which could make it harder to connect with them. 3> Introversion: Many gamers identify as introverts, meaning they may feel more comfortable in online social settings rather than face-to-face interactions. This preference for online interaction can inadvertently limit opportunities for making friends offline. 4> Time Constraints: Gamers often spend significant amounts of time gaming, which can limit the time available for other social activities. This reduced availability may make it harder to invest time in building offline friendships. However, it’s important to remember that making friends in person as a gamer is not impossible. Finding common ground with others who share your gaming interests, participating in gaming events or conventions, joining local gaming groups or clubs, or even engaging in non-gaming activities where you might meet like-minded individuals can all help expand your social circle beyond the digital realm. Upvote · Jacob Tanner 7mo Originally Answered: Why is it so hard to make friends in-person as a gamer? · Making friends in person as a gamer can sometimes be challenging due to a few factors: 1> Stigma: There’s still a lingering stigma attached to gaming in some social circles. People who aren’t gamers might not understand the hobby or may have misconceptions about it, which can make it harder to connect with them on that level. 2> Limited opportunities: Unlike online gaming, where you can easily find and connect with like-minded individuals, finding fellow gamers in person can be more difficult. You might not have many opportunities to meet people who share your interests, especially if you live i Continue Reading Making friends in person as a gamer can sometimes be challenging due to a few factors: 1> Stigma: There’s still a lingering stigma attached to gaming in some social circles. People who aren’t gamers might not understand the hobby or may have misconceptions about it, which can make it harder to connect with them on that level. 2> Limited opportunities: Unlike online gaming, where you can easily find and connect with like-minded individuals, finding fellow gamers in person can be more difficult. You might not have many opportunities to meet people who share your interests, especially if you live in a smaller community or don’t have access to gaming events or clubs. 3> Social anxiety: Some gamers struggle with social anxiety or find it challenging to initiate conversations or form connections with new people. This can be especially true if you’re meeting people in environments where gaming isn’t the primary focus. 4> Diverse interests: While gaming is a common interest among many people, it’s not the only thing that defines you or potential friends. You might have other interests or hobbies that you’re passionate about, and finding people who share those interests as well as your love for gaming can be more challenging. However, there are ways to overcome these challenges. Look for local gaming events, conventions, or meetups where you can connect with other gamers in person. Additionally, consider joining clubs or groups related to your other interests, as you might find fellow gamers among those communities. And remember, sometimes it just takes time to find the right people who you click with, so don’t get discouraged if it doesn’t happen right away. Upvote · Riverside 4y Well.. for me games are like an escape for me. I actually have fun. I think people, well me atleast, are more open on the internet because we all may not know eachother. That said it might probably be the parents. My parents are.. let's say not very good and I have trouble talking to people irl because I'm thinking they're making fun of me, and other various things so yeah Upvote · 92 Sponsored by Fisher Investments 7 Ways to Retire Comfortably. How long will your portfolio last in retirement? Download our guide to learn more. Learn More 93 Related questions Are gamers who are mean online mean in real life? Do gamers and non-gamers interact with each other? There is any real gamer dating sites? Why do people converse with other people in real life? What do gamers typically do when they meet each other in real life? Without having met them in real life, do male gamers treat female gamers differently? As a Gamer with little social life, how to meet new people in real life? How do you deal with a strong-willed person? What are some signs that someone enjoys causing drama and getting into fights with others? Do people still talk in real life? Gamers, what are some Boss Levels in real life? What are some reasons why gamers stop playing? Do you have trouble approaching others? How can I handle someone who is highly opinionated? This person is driving me crazy. Do people with social anxiety disorders or social anxiety issues prefer playing video games over interacting with others face-to-face? Answer 98 Follow Related questions Are gamers who are mean online mean in real life? Do gamers and non-gamers interact with each other? There is any real gamer dating sites? Why do people converse with other people in real life? What do gamers typically do when they meet each other in real life? Without having met them in real life, do male gamers treat female gamers differently? Advertisement About · Careers · Privacy · Terms · Contact · Languages · Your Ad Choices · Press · © Quora, Inc. 2025",
      "title": "Why do gamers have trouble approaching people in real life? - Quora Something went wrong. Wait a moment and try again. Try again Skip to content Skip to search Sign In Why do gamers have trouble approaching people in real life? All related (38) Sort Recommended Emma Kleis Freelancer at Upwork (2021–present) · Author has 1.5K answers and 11.9M answer views · 3y Elaborate answer to a simple question coming up. Gamers make friends through a screen. That’s what they have always done, and it works for them. They are anonymous; they can pick and choose who they want to continue talking to and who they never want to speak to again. If they do or say something embarrassing, it’s not that bad. If they act themselves from the get-go, they don’t need to worry about that physical pressure, they can just be them, decide who they like and dislike and that’s it. Oh, and they don’t need to put clothes on to meet new people… or get out. In real life, I see several pro Continue Reading Elaborate answer to a simple question coming up. Gamers make friends through a screen. That’s what they have always done, and it works for them. They are anonymous; they can pick and choose who they want to continue talking to and who they never want to speak to again. If they do or say something embarrassing, it’s not that bad. If they act themselves from the get-go, they don’t need to worry about that physical pressure, they can just be them, decide who they like and dislike and that’s it. Oh, and they don’t need to put clothes on to meet new people… or get out. In real life, I see several problems if you can call them that: Once they have met someone new, ghosting them is not possible because now you have some kind of responsibility to that other person to at least let them down slowly. That sucks! Now you can no longer pick and choose who you want to be friends with. You can’t be yourself from the get-go. Some people can, that’s great, but not everyone is confident enough to just go out there and be a ‘take-me-as-I-am-or-leave-me’ type of person. So, you have to go through this awkward phase of getting to know each other and that can be a real pain. They feel social pressure talking to new people because you actually have to look them in the eye, feel their energy (not a spiritual post, I swear), read their body language. You can’t just leave them on read and wait to reply until the next day. You need to reply on the fly. You don’t speak the same language. As a gamer, this is something I relate to hard. Sometimes, I almost say pog or pepega in real life before I catch myself. In order to rephrase that, I spend like 10 seconds in my head thinking about how to convey a sentence with the proper emotions I wanted to display. It sounds ridiculous, but it’s true. You don’t get the same references. They’re talking about some new show on Netflix, and I’m over here wanting to share the fact that I literally RNGd 2 leggos in one lootbox. You know what I mean? A lot of gamers are introverted, reserved people as well. Some aren’t, but a lot are. Those who aren’t know how to socialize, and then you don’t realize they’re gamers, but they are, they just don’t go around announcing it. They don’t need to put effort into their appearance online either, so it’s just a bother to get up and out. Haha. Upvote · 96 Promoted by Savings Pro Mark Bradley Economist · Updated Dec 1 What are the stupidest money mistakes most people make? Where do I start? I’m a huge financial nerd, and have spent an embarrassing amount of time talking to people about their money habits. Here are the biggest mistakes people are making and how to fix them: Not having a separate high interest savings account Having a separate account allows you to see the results of all your hard work and keep your money separate so you're less tempted to spend it. Plus with rates above 5.00%, the interest you can earn compared to most banks really adds up. Here is a list of the top savings accounts available today. Deposit $5 before moving on because this is one of th Continue Reading Where do I start? I’m a huge financial nerd, and have spent an embarrassing amount of time talking to people about their money habits. Here are the biggest mistakes people are making and how to fix them: Not having a separate high interest savings account Having a separate account allows you to see the results of all your hard work and keep your money separate so you're less tempted to spend it. Plus with rates above 5.00%, the interest you can earn compared to most banks really adds up. Here is a list of the top savings accounts available today. Deposit $5 before moving on because this is one of the biggest mistakes and easiest ones to fix. Overpaying on car insurance You’ve heard it a million times before, but the average American family still overspends by $417/year on car insurance. If you’ve been with the same insurer for years, chances are you are one of them. Pull up Coverage.com, a free site that will compare prices for you, answer the questions on the page, and it will show you how much you could be saving. That’s it. You’ll likely be saving a bunch of money. Here’s a link to give it a try. Consistently being in debt If you’ve got $10K+ in debt (credit cards…medical bills…anything really) you could use a debt relief program and potentially reduce by over 20%. Here’s how to see if you qualify: Head over to this Debt Relief comparison website here, then simply answer the questions to see if you qualify. It’s as simple as that. You’ll likely end up paying less than you owed before and you could be debt free in as little as 2 years. Missing out on free money to invest It’s no secret that millionaires love investing, but for the rest of us, it can seem out of reach. Times have changed. There are a number of investing platforms that will give you a bonus to open an account and get started. All you have to do is open the account and invest at least $25, and you could get up to $1000 in bonus. Pretty sweet deal right? Here is a link to some of the best options. Having bad credit A low credit score can come back to bite you in so many ways in the future. From that next rental application to getting approved for any type of loan or credit card, if you have a bad history with credit, the good news is you can fix it. Head over to BankRate.com and answer a few questions to see if you qualify. It only takes a few minutes and could save you from a major upset down the line. How to get started Hope this helps! Here are the links to get started: Have a separate savings account Stop overpaying for car insurance Finally get out of debt Start investing with a free bonus Fix your credit Upvote · 2.6K2.6K 999402 999120 Related questions More answers below Are gamers who are mean online mean in real life? Do gamers and non-gamers interact with each other? There is any real gamer dating sites? Why do people converse with other people in real life? What do gamers typically do when they meet each other in real life? Christopher Boyd .NET Developer (2018–present) · 7mo Originally Answered: Why is it so hard to make friends in-person as a gamer? · Making friends in person as a gamer can sometimes be challenging due to a few reasons: 1> Niche Interests: Gaming can be seen as a niche interest, and not everyone you encounter in person may share that interest to the same extent. This can limit the pool of potential friends you meet in face-to-face interactions. 2> Social Stigma: Despite gaming’s growing mainstream acceptance, there can still be lingering social stigma attached to it. Some people may hold misconceptions about gamers, which could make it harder to connect with them. 3> Introversion: Many gamers identify as introverts, meaning th Continue Reading Making friends in person as a gamer can sometimes be challenging due to a few reasons: 1> Niche Interests: Gaming can be seen as a niche interest, and not everyone you encounter in person may share that interest to the same extent. This can limit the pool of potential friends you meet in face-to-face interactions. 2> Social Stigma: Despite gaming’s growing mainstream acceptance, there can still be lingering social stigma attached to it. Some people may hold misconceptions about gamers, which could make it harder to connect with them. 3> Introversion: Many gamers identify as introverts, meaning they may feel more comfortable in online social settings rather than face-to-face interactions. This preference for online interaction can inadvertently limit opportunities for making friends offline. 4> Time Constraints: Gamers often spend significant amounts of time gaming, which can limit the time available for other social activities. This reduced availability may make it harder to invest time in building offline friendships. However, it’s important to remember that making friends in person as a gamer is not impossible. Finding common ground with others who share your gaming interests, participating in gaming events or conventions, joining local gaming groups or clubs, or even engaging in non-gaming activities where you might meet like-minded individuals can all help expand your social circle beyond the digital realm. Upvote · Jacob Tanner 7mo Originally Answered: Why is it so hard to make friends in-person as a gamer? · Making friends in person as a gamer can sometimes be challenging due to a few factors: 1> Stigma: There’s still a lingering stigma attached to gaming in some social circles. People who aren’t gamers might not understand the hobby or may have misconceptions about it, which can make it harder to connect with them on that level. 2> Limited opportunities: Unlike online gaming, where you can easily find and connect with like-minded individuals, finding fellow gamers in person can be more difficult. You might not have many opportunities to meet people who share your interests, especially if you live i Continue Reading Making friends in person as a gamer can sometimes be challenging due to a few factors: 1> Stigma: There’s still a lingering stigma attached to gaming in some social circles. People who aren’t gamers might not understand the hobby or may have misconceptions about it, which can make it harder to connect with them on that level. 2> Limited opportunities: Unlike online gaming, where you can easily find and connect with like-minded individuals, finding fellow gamers in person can be more difficult. You might not have many opportunities to meet people who share your interests, especially if you live in a smaller community or don’t have access to gaming events or clubs. 3> Social anxiety: Some gamers struggle with social anxiety or find it challenging to initiate conversations or form connections with new people. This can be especially true if you’re meeting people in environments where gaming isn’t the primary focus. 4> Diverse interests: While gaming is a common interest among many people, it’s not the only thing that defines you or potential friends. You might have other interests or hobbies that you’re passionate about, and finding people who share those interests as well as your love for gaming can be more challenging. However, there are ways to overcome these challenges. Look for local gaming events, conventions, or meetups where you can connect with other gamers in person. Additionally, consider joining clubs or groups related to your other interests, as you might find fellow gamers among those communities. And remember, sometimes it just takes time to find the right people who you click with, so don’t get discouraged if it doesn’t happen right away. Upvote · Riverside 4y Well.. for me games are like an escape for me. I actually have fun. I think people, well me atleast, are more open on the internet because we all may not know eachother. That said it might probably be the parents. My parents are.. let's say not very good and I have trouble talking to people irl because I'm thinking they're making fun of me, and other various things so yeah Upvote · 92 Sponsored by Fisher Investments 7 Ways to Retire Comfortably. How long will your portfolio last in retirement? Download our guide to learn more. Learn More 93 Related questions Are gamers who are mean online mean in real life? Do gamers and non-gamers interact with each other? There is any real gamer dating sites? Why do people converse with other people in real life? What do gamers typically do when they meet each other in real life? Without having met them in real life, do male gamers treat female gamers differently? As a Gamer with little social life, how to meet new people in real life? How do you deal with a strong-willed person? What are some signs that someone enjoys causing drama and getting into fights with others? Do people still talk in real life? Gamers, what are some Boss Levels in real life? What are some reasons why gamers stop playing? Do you have trouble approaching others? How can I handle someone who is highly opinionated? This person is driving me crazy. Do people with social anxiety disorders or social anxiety issues prefer playing video games over interacting with others face-to-face? Answer 98 Follow Related questions Are gamers who are mean online mean in real life? Do gamers and non-gamers interact with each other? There is any real gamer dating sites? Why do people converse with other people in real life? What do gamers typically do when they meet each other in real life? Without having met them in real life, do male gamers treat female gamers differently? Advertisement About · Careers · Privacy · Terms · Contact · Languages · Your Ad Choices · Press · © Quora, Inc. 2025"
    },
    {
      "url": "https://blog.gametruckparty.com/how-to-make-friends-online-with-video-games/",
      "content": "Published Time: 2021-02-02T04:34:21+00:00 How to Make Friends Online With Video Games » GameTruck News Birthday Parties Large Events Locations About GameTruck Find your location Call (866)253-3191orRequest a Party Birthday Parties Large Events Locations About GameTruck Find your location Call (866)253-3191orRequest a Party GameTruck ========================================================================================== Menu Birthday Parties Large Events Locations About GameTruck Blog » GameTruck News and Updates » How to Make Friends Online With Video Games How to Make Friends Online With Video Games This past week I had someone reach out to me through my website scottnovis.com and ask a simple question. At least it seemed like a simple question. “I have a friend who is suffering from isolation. How could they make some friends online?” The question caught me by surprise. It just seems like everyone already knows how to do that… unless they are too young, or too old, or actually, like me never think to look online to make friends. Since the whole core of my mission is to reduce loneliness through interactive gaming, I felt compelling to answer this question. So I turned to the experts, our professional coaches, commentators, and our entire staff. They had some great answers. The Good Old Days There is no doubt that the world has changed, and not in ways that seem obvious. Not long-ago video games were hosted on private or dedicated servers. In that world, gamers could find a game they liked, find a server they liked, and “hang around”. Eventually they would make connections by seeing the same people over and over again. In the late 90’s Counterstrike had more people playing video games than watching the highest-rated TV show of the year… every night. There were literally thousands upon thousands of servers. I remember being proud that ATV Off-road Fury 2 on the PlayStation hosting tens of thousands of gamers every night. Of course, this paled in comparison to the millions of gamers that logged on to play Counterstrike. When World of Warcraft launched in Nov 2004, the game was engineered to push people together into social groups. You had to run across the world, looking for quests, and the game funneled players of a similar skill level into areas of the map and rewarded them for working together. In short, video games emulated the same kinds of techniques designers and architects have used to make offices a “social space”. According to Joseph Grenny of Vital Smarts: What worked about the office was that it was a highly structured way of promoting unstructured interaction. It gave the illusion of agency to our spontaneous connection. Basically, video games accomplished the same thing for 20 years by putting players together with a shared interest, and as Grenny put it, “letting them rub against each other like marbles in a jar”. And this worked. [[Yuval Noah Harari]] in his excellent book Sapiens makes the case that humans are wired to work in social groups. In the “old days”, all you had to do to make friends, is find a game you liked, hop on a server and hang out. Eventually, friendship would just sort of happen. [True story, I met Bill Amend, the creator of Foxtrot, by playing World of Warcraft in 2006]. So, what changed? Safety, Scale, and the Cloud More than half the people I spoke with talked about the close friends they made playing games like Halo 2 and Team Fortress 2. However, several things happened with video games and the way they are hosted online. First, the publishers wanted control of the servers. Therefore, the “dedicated” server model went away to be replaced with cloud computers. One enormous advantage came from this shift however. Suddenly a global pool of players could be polled for a match. This is probably one of the single greatest features of Fortnite. As soon as one match ends (usually with you getting wiped out quickly) You can get into another game in seconds. With Halo 2 it could take upwards of 5 minutes to find a match and start the game. This was one of the reasons early on I did not include internet play. People had no idea how much time they were spending waiting in lobbies. 5-10 minutes per game in a 120-minute party is a lot of time. With local play players could jump into a match in seconds. It is impressive Epic recreated this experience with an online game. The downside? You are faced with a nearly constant churn of players, what Nathan Ullyott, the director of Maricopa Parks and Recreation called the “infinite friend problem.” It is the exact opposite of marbles “rubbing each other”. You don’t like someone? There is zero incentive to work it out. Just move on. There’s an infinite number of people waiting to play. The Child Online Privacy and Protection Act also had an impact on forming game communities. Basically, it created a digital wall between underage players and everyone else. In principle this is an incredibly good thing, however the goal of making it safer for kids to play online by giving their parents more control, created systematic isolation for all players. Because match making is not happening at the local server level, the centralized match making systems try to make sure players who cannot possibly meet play together. It is safer yes, but also more isolating. In the name of safety, advantages of scale, and the advent of cloud computing (where is that server by the way? Does anyone really know!?), the small communities that formed around online video games just a decade ago have changed drastically. What replaced it? But have no fear. Not all is lost. While the small server might not be the place where friends are made, gamers and developers have made adjustments and adaptations. The two biggest ones being Twitch, and the rise of Discord. The idea of building community has moved from the publisher, to (hopefully) well-meaning streamers and fans of the games. I remember when my kids first started to watch people play Minecraft on YouTube. It was the fastest way to learn the rapidly changing complex game. When Twitch came around, and they could interact with content creators in real-time. Communities started to form with the streamers at the center. Like some kind of space age fan club mixed with gaming, many streamers decided to use Discord as their tool of choice for managing these enthusiastic communities. Finding Friends Through Games 2021 Style To be clear, it is still possible to make friends online through video games, but it is done a little differently. While the tools and technology have changed, the intrinsic desire for humans to connect persists. Here is the current best practices I culled and combined after talking with my team. The Steps Find a game you are interested in. Your interests will make it easier for you to connect and share experiences with other players (side note, some very interesting games have very toxic communities that are not friendly toward new players – do your homework! DOTA II and League of Legends communities are notorious for being harsh on new players) Spend some time developing enough skill to be willing to play with, or against others online. Find a streamer, or someone on YouTube who you find interesting and posting and live streaming regularly. Many of these streamers put out a steady dose of tutorials and helper videos. This content should help you get a sense if you like them and what their community might be like. Check out some Streams. They don’t have to be the most famous or popular. Find the ones that click with you. You do not have to donate! It is not at all necessary. Look for a community discord. You can even ask about it while they are streaming. Follow the procedures on their discord to become part of the community. Most streamers do not want a toxic community and Discord and Twitch also frown on “bad cultures”. This means there are usually some steps you have to go through, like accepting the community rules. You typically will get a little access to the discord at first – so you are not overwhelmed, and then over time they will open up more and more of the channels to you. Invite some people to play, and be open to invitations to play. There is one caveat about spending a lot of time watching streamers. While most of them are entertaining and often honest and open, you can feel like you know a streamer much better than you would know any other kind of celebrity. However, while you think you are getting to know them very well, the reality is that it is nearly impossible for them to get to know you. In fact, they probably don’t know you at all. There is a name for this kind of lopsided relationship. It is called a parasocial relationship. You are better off focusing your interactions with other members of the community rather than the streamer themselves. You want to focus on people you can actually play with, and who can get to know you. No matter how genuine a streamer is, they are still essentially performing and most do this as a business. That is both good and bad. Good in that they will work hard to make sure the community is consistent with their values, but bad in the sense that they have an extremely limited capacity to reciprocate any kind of meaningful friendship. They can (and do) appreciate you, without knowing you. For Younger Kids Many parents pay attention to their child’s online gaming and wonder about making friends as well. When I asked about kids making friends online, two themes popped up from our Bravous Parents. Pick the right game. Watch who they communicate with. Remember when I said you should play video games with your kids? That’s another way to do both. What games do our parents let their kids play? I’m sure you will recognize the names: Minecraft is still a mainstay and in general, has a nice community. The Java servers can allow more player to player chat (like the old dedicated servers of 15 years ago) Animal Crossing Pocket Camp because it is easy to meet new people, but even if you don’t you don’t feel so alone playing. Roblox – is very popular and really good, but you do want to be careful. There can be some bad apples and immaturity. Still, our young gamers made some friends here too. Conclusion When online gaming and chat became enormous it was inevitable that online friendships – and in fact true, real life friendships would form. Over time, as technology change, the social dynamic of the video game internet changed with it. Despite all the changes, our desire to connect and make friends can still be satisfied. I saw this quote recently from the poet Jane Hirshfield. She said it about Zen but I think it applies equally well to making friends online: Everything changes Everything is connected Pay attention If you find a game you are interested in, do some homework, find a community that shares your interest. With time, effort, and persistence chances are good you will find someone who shares your enthusiasm, and you might just make a new friend. — Reference Grenny, J., Grenny, J., & Grenny, J. (2020, November 30). No one is talking about the real problem with working from home. Fast Company. https://www.fastcompany.com/90579969/no-one-is-talking-about-the-real-problem-with-working-from-home Harari, Y. (n.d.). Sapiens: A Brief History of Humankind. Ullyot Nathan, Director Nathan Ullyot discusses Maricopa Esports, https://www.facebook.com/watch/?v=546552852616812 Jane Hirshfield, https://www.poetryfoundation.org/poets/jane-hirshfield Share on FacebookTweetFollow usSave No related posts. Author Scott NovisPosted on February 1, 2021February 1, 2021Categories GameTruck News and Updates Post navigation Previous Previous post: What Makes a GameTruck Party Great? No Lone wolves. Next Next post: GameTruck in a Suitcase? We call it GameTruck @HOME. Categories Educational GameTruck Corporate GameTruck News and Updates Gaming Parenting Recent Posts Pikmin 4: A Parent’s Guide to Nintendo’s Most Adorable Adventure Best Gamer Birthday Party Ideas for Kids DIY Birthday Party Favors That Kids Will Love Goal-Setting Tips for Kids Company Home About GameTruck Parties Events Locations Franchising Careers GameTruck Blog Pikmin 4: A Parent’s Guide to Nintendo’s Most Adorable Adventure Best Gamer Birthday Party Ideas for Kids DIY Birthday Party Favors That Kids Will Love Goal-Setting Tips for Kids How to Restore Play-Based Childhood in a Digital World: A Parent’s Guide Connect with Us Facebook Twitter Youtube Pinterest Google Plus Own a Franchise © 2025 GameTruck Licensing LLC. All Rights Reserved Privacy Policy",
      "title": "Published Time: 2021-02-02T04:34:21+00:00 How to Make Friends Online With Video Games » GameTruck News Birthday Parties Large Events Locations About GameTruck Find your location Call (866)253-3191orRequest a Party Birthday Parties Large Events Locations About GameTruck Find your location Call (866)253-3191orRequest a Party GameTruck ========================================================================================== Menu Birthday Parties Large Events Locations About GameTruck Blog » GameTruck News and Updates » How to Make Friends Online With Video Games How to Make Friends Online With Video Games This past week I had someone reach out to me through my website scottnovis.com and ask a simple question. At least it seemed like a simple question. “I have a friend who is suffering from isolation. How could they make some friends online?” The question caught me by surprise. It just seems like everyone already knows how to do that… unless they are too young, or too old, or actually, like me never think to look online to make friends. Since the whole core of my mission is to reduce loneliness through interactive gaming, I felt compelling to answer this question. So I turned to the experts, our professional coaches, commentators, and our entire staff. They had some great answers. The Good Old Days There is no doubt that the world has changed, and not in ways that seem obvious. Not long-ago video games were hosted on private or dedicated servers. In that world, gamers could find a game they liked, find a server they liked, and “hang around”. Eventually they would make connections by seeing the same people over and over again. In the late 90’s Counterstrike had more people playing video games than watching the highest-rated TV show of the year… every night. There were literally thousands upon thousands of servers. I remember being proud that ATV Off-road Fury 2 on the PlayStation hosting tens of thousands of gamers every night. Of course, this paled in comparison to the millions of gamers that logged on to play Counterstrike. When World of Warcraft launched in Nov 2004, the game was engineered to push people together into social groups. You had to run across the world, looking for quests, and the game funneled players of a similar skill level into areas of the map and rewarded them for working together. In short, video games emulated the same kinds of techniques designers and architects have used to make offices a “social space”. According to Joseph Grenny of Vital Smarts: What worked about the office was that it was a highly structured way of promoting unstructured interaction. It gave the illusion of agency to our spontaneous connection. Basically, video games accomplished the same thing for 20 years by putting players together with a shared interest, and as Grenny put it, “letting them rub against each other like marbles in a jar”. And this worked. [[Yuval Noah Harari]] in his excellent book Sapiens makes the case that humans are wired to work in social groups. In the “old days”, all you had to do to make friends, is find a game you liked, hop on a server and hang out. Eventually, friendship would just sort of happen. [True story, I met Bill Amend, the creator of Foxtrot, by playing World of Warcraft in 2006]. So, what changed? Safety, Scale, and the Cloud More than half the people I spoke with talked about the close friends they made playing games like Halo 2 and Team Fortress 2. However, several things happened with video games and the way they are hosted online. First, the publishers wanted control of the servers. Therefore, the “dedicated” server model went away to be replaced with cloud computers. One enormous advantage came from this shift however. Suddenly a global pool of players could be polled for a match. This is probably one of the single greatest features of Fortnite. As soon as one match ends (usually with you getting wiped out quickly) You can get into another game in seconds. With Halo 2 it could take upwards of 5 minutes to find a match and start the game. This was one of the reasons early on I did not include internet play. People had no idea how much time they were spending waiting in lobbies. 5-10 minutes per game in a 120-minute party is a lot of time. With local play players could jump into a match in seconds. It is impressive Epic recreated this experience with an online game. The downside? You are faced with a nearly constant churn of players, what Nathan Ullyott, the director of Maricopa Parks and Recreation called the “infinite friend problem.” It is the exact opposite of marbles “rubbing each other”. You don’t like someone? There is zero incentive to work it out. Just move on. There’s an infinite number of people waiting to play. The Child Online Privacy and Protection Act also had an impact on forming game communities. Basically, it created a digital wall between underage players and everyone else. In principle this is an incredibly good thing, however the goal of making it safer for kids to play online by giving their parents more control, created systematic isolation for all players. Because match making is not happening at the local server level, the centralized match making systems try to make sure players who cannot possibly meet play together. It is safer yes, but also more isolating. In the name of safety, advantages of scale, and the advent of cloud computing (where is that server by the way? Does anyone really know!?), the small communities that formed around online video games just a decade ago have changed drastically. What replaced it? But have no fear. Not all is lost. While the small server might not be the place where friends are made, gamers and developers have made adjustments and adaptations. The two biggest ones being Twitch, and the rise of Discord. The idea of building community has moved from the publisher, to (hopefully) well-meaning streamers and fans of the games. I remember when my kids first started to watch people play Minecraft on YouTube. It was the fastest way to learn the rapidly changing complex game. When Twitch came around, and they could interact with content creators in real-time. Communities started to form with the streamers at the center. Like some kind of space age fan club mixed with gaming, many streamers decided to use Discord as their tool of choice for managing these enthusiastic communities. Finding Friends Through Games 2021 Style To be clear, it is still possible to make friends online through video games, but it is done a little differently. While the tools and technology have changed, the intrinsic desire for humans to connect persists. Here is the current best practices I culled and combined after talking with my team. The Steps Find a game you are interested in. Your interests will make it easier for you to connect and share experiences with other players (side note, some very interesting games have very toxic communities that are not friendly toward new players – do your homework! DOTA II and League of Legends communities are notorious for being harsh on new players) Spend some time developing enough skill to be willing to play with, or against others online. Find a streamer, or someone on YouTube who you find interesting and posting and live streaming regularly. Many of these streamers put out a steady dose of tutorials and helper videos. This content should help you get a sense if you like them and what their community might be like. Check out some Streams. They don’t have to be the most famous or popular. Find the ones that click with you. You do not have to donate! It is not at all necessary. Look for a community discord. You can even ask about it while they are streaming. Follow the procedures on their discord to become part of the community. Most streamers do not want a toxic community and Discord and Twitch also frown on “bad cultures”. This means there are usually some steps you have to go through, like accepting the community rules. You typically will get a little access to the discord at first – so you are not overwhelmed, and then over time they will open up more and more of the channels to you. Invite some people to play, and be open to invitations to play. There is one caveat about spending a lot of time watching streamers. While most of them are entertaining and often honest and open, you can feel like you know a streamer much better than you would know any other kind of celebrity. However, while you think you are getting to know them very well, the reality is that it is nearly impossible for them to get to know you. In fact, they probably don’t know you at all. There is a name for this kind of lopsided relationship. It is called a parasocial relationship. You are better off focusing your interactions with other members of the community rather than the streamer themselves. You want to focus on people you can actually play with, and who can get to know you. No matter how genuine a streamer is, they are still essentially performing and most do this as a business. That is both good and bad. Good in that they will work hard to make sure the community is consistent with their values, but bad in the sense that they have an extremely limited capacity to reciprocate any kind of meaningful friendship. They can (and do) appreciate you, without knowing you. For Younger Kids Many parents pay attention to their child’s online gaming and wonder about making friends as well. When I asked about kids making friends online, two themes popped up from our Bravous Parents. Pick the right game. Watch who they communicate with. Remember when I said you should play video games with your kids? That’s another way to do both. What games do our parents let their kids play? I’m sure you will recognize the names: Minecraft is still a mainstay and in general, has a nice community. The Java servers can allow more player to player chat (like the old dedicated servers of 15 years ago) Animal Crossing Pocket Camp because it is easy to meet new people, but even if you don’t you don’t feel so alone playing. Roblox – is very popular and really good, but you do want to be careful. There can be some bad apples and immaturity. Still, our young gamers made some friends here too. Conclusion When online gaming and chat became enormous it was inevitable that online friendships – and in fact true, real life friendships would form. Over time, as technology change, the social dynamic of the video game internet changed with it. Despite all the changes, our desire to connect and make friends can still be satisfied. I saw this quote recently from the poet Jane Hirshfield. She said it about Zen but I think it applies equally well to making friends online: Everything changes Everything is connected Pay attention If you find a game you are interested in, do some homework, find a community that shares your interest. With time, effort, and persistence chances are good you will find someone who shares your enthusiasm, and you might just make a new friend. — Reference Grenny, J., Grenny, J., & Grenny, J. (2020, November 30). No one is talking about the real problem with working from home. Fast Company. https://www.fastcompany.com/90579969/no-one-is-talking-about-the-real-problem-with-working-from-home Harari, Y. (n.d.). Sapiens: A Brief History of Humankind. Ullyot Nathan, Director Nathan Ullyot discusses Maricopa Esports, https://www.facebook.com/watch/?v=546552852616812 Jane Hirshfield, https://www.poetryfoundation.org/poets/jane-hirshfield Share on FacebookTweetFollow usSave No related posts. Author Scott NovisPosted on February 1, 2021February 1, 2021Categories GameTruck News and Updates Post navigation Previous Previous post: What Makes a GameTruck Party Great? No Lone wolves. Next Next post: GameTruck in a Suitcase? We call it GameTruck @HOME. Categories Educational GameTruck Corporate GameTruck News and Updates Gaming Parenting Recent Posts Pikmin 4: A Parent’s Guide to Nintendo’s Most Adorable Adventure Best Gamer Birthday Party Ideas for Kids DIY Birthday Party Favors That Kids Will Love Goal-Setting Tips for Kids Company Home About GameTruck Parties Events Locations Franchising Careers GameTruck Blog Pikmin 4: A Parent’s Guide to Nintendo’s Most Adorable Adventure Best Gamer Birthday Party Ideas for Kids DIY Birthday Party Favors That Kids Will Love Goal-Setting Tips for Kids How to Restore Play-Based Childhood in a Digital World: A Parent’s Guide Connect with Us Facebook Twitter Youtube Pinterest Google Plus Own a Franchise © 2025 GameTruck Licensing LLC. All Rights Reserved Privacy Policy"
    },
    {
      "url": "https://gamefaqs.gamespot.com/boards/264562-playstation-5/80634295?page=4",
      "content": "So how do you guys make friends without communities? - PlayStation 5 Menu Home Boards News Q&A Community Contribute Games 3DS Android Board/Card iOS PC PlayStation 3 PlayStation 4 PlayStation 5 Switch Vita Xbox 360 Xbox One Xbox Series More Systems PCPS4PS5SwitchXbox OneXbox SeriesMore Systems 3DS Android Board / Card DS Game Boy Advance GameCube iOS Nintendo 64 PlayStation PlayStation 2 PlayStation 3 PSP Super Nintendo Vita Wii Wii U Xbox 360 See All 143... Log In Sign Up GameFAQs BoardsNewsQ&ACommunityContributeGames So how do you guys make friends without communities? PlayStation 5 PlayStation 5 Log in to add games to your lists Notify me about new: Guides Cheats Reviews Questions News Board Topics Board Messages Add this game to my: Favorite Games Favorite Boards Home Q&A Board More Home Summary Release Data Game Credits Collection Stats Game Trivia Games Q&A Media Boxes Videos News Board What do you need help on? Cancel X Topic Archived First Previous Page of 6 Last You're browsing the GameFAQs Message Boards as a guest. Sign Up for free (or Log In if you already have an account) to be able to post messages, change how messages are displayed, and view media in posts. Boards PlayStation 5 So how do you guys make friends without communities? nedmo0000 1 year ago#41IllusiveArch posted...Agreed. Just gotta put yourself out there. You aren't going to vibe with everyone. It really does depend on what you do with your time in the day too.Social? Go places? Ull meet loads of ppl. Stay at home most of the day? You won't meet anyone.Find an activity that will allow you to bond with people would be my advice it’s so easy to break the ice when you are collectively working towards something, in my case it was a coding boot camp.White_Wolf_Kiba 1 year ago#42I think people who force themselves to find an activity and do it just to make friends never really make any friends and just go deeper in despair in MOST cases, not all cases.Like if it's all forced it's not going to end well.Like say you decide to go to a language class, but have little to no interest in the class, you go there just to make friends. Wouldn't you feel awkward because you know why you're there, you won't have the energy to put time and effort into the actual class and the people you meet there may or may not be friend material.Then you keep bumming around from \"activity\" to \"activity\" and fall further and further in despair.This is what I feel like happens to people who forcefully engage themselves in activities that aren't naturally appealing to them.https://www.youtube.com/c/GamingPalOllieMKGaming Pal Ollie - Video Game reviews and talk#43(message deleted)r4vio 1 year ago#44One of my ex's mothers used to have friends she had kept for 40+ years into her old adult hood. I asked her what she attributes to her friends sticking together. She said common interests was the biggest factor. So, that would be a good start. Not simply just an activity, but something both parties are very interested or passionate about.Alltra 1 year ago#45I'd love to be of help here TC, but I make it a personal point not to play games where I'd need a friend to play with me for any of the content. It's far too troublesome to be worth it.If at all possible, perhaps you might look into solo boosting with a second console, I have on rare occasions found that to be an effective and far less troublesome way to access content like this. Nobody more reliable than yourself.The meaning of life is to suffer and be miserable.Online is the worst thing to happen to gaming. Sometimes \"Done\" is the best feature.doki-doki-panic 1 year ago#46White_Wolf_Kiba posted...I think people who force themselves to find an activity and do it just to make friends never really make any friends and just go deeper in despair in MOST cases, not all cases.Like if it's all forced it's not going to end well.Like say you decide to go to a language class, but have little to no interest in the class, you go there just to make friends. Wouldn't you feel awkward because you know why you're there, you won't have the energy to put time and effort into the actual class and the people you meet there may or may not be friend material.Then you keep bumming around from \"activity\" to \"activity\" and fall further and further in despair.This is what I feel like happens to people who forcefully engage themselves in activities that aren't naturally appealing to them.Huh? With so many different things to be involved in that result in having to social with others, why the hell would you pick something like a language class that you aren't interested in. lol you'd pick something that you ARE interested in. And if nothing is of interest, then that sounds like a personal problem that needs addressed as a result of horizons that were never expanded.White_Wolf_Kiba 1 year ago#47doki-doki-panic posted...Huh? With so many different things to be involved in that result in having to social with others, why the hell would you pick something like a language class that you aren't interested in. lol you'd pick something that you ARE interested in. And if nothing is of interest, then that sounds like a personal problem that needs addressed as a result of horizons that were never expanded.There are people who do this, that's why I posted that and that it probably won't lead to anything positive. I used to know a few people over the years who just didn't know what to do with themselves, what interests they had and all that so they'd keep trying different things and forcing themselves to \"enjoy\" them just to be in as miserable a state after the activity was over as when it first started.I've never had to deal with this myself, I always had my interests, my tolerance of people and tolerance or rather intolerance of long socializing lol I pick and choose my friends rather harshly but I've known people well into their 30's and 40's constantly adrift form one \"activity\" to another looking for people, having so called friends they fake and mask in front of and never amounting to anything socially or emotionally.That's what I was talking about.Of course if TC has genuine interest in the activity they're undertaking this wouldn't apply to them.https://www.youtube.com/c/GamingPalOllieMKGaming Pal Ollie - Video Game reviews and talkLotto_plastered 1 year ago#48doki-doki-panic posted...Exactly, ya got all these 35-40 year olds that just sit in their moms basement all day long. Not going to meet anyone IRL if you never leave the basement. The video game isn't going anywhere... play it when you get back.I have some downright hilarious footage that will make anyone laugh of me interacting with people on TikTok and I have made some genuine friendships, but it does suck big time that I am not able to create the same relationships in person. It's just the way it is these days for a lot of peoplemolokoveloocet0 1 year ago#49IllusiveArch posted...I tried to accept it but it disappeared. Please send again! It's illusivearch88It looks like we’re all good. And holy s*** you play Marvel 3?? Are you any good? I’m pretty mediocre - rolled Zero since release and never labbed lightning loops lol - but I love it.Sweet deelAnti_FANBOY 1 year ago#50Its called random matchmakingLife doesnt have a retry option, but you can always quit. Boards PlayStation 5 So how do you guys make friends without communities? Topic Archived First Previous Page of 6 Last More Topics from this Board What do you guys think about the little passive aggressive mod notes Community 12 posts, 3/3 10:00AM What happened to Lost Planet? Will Capcom ever make Lost Planet 4? 11 posts, 2/26 12:40PM What is your go-to snack/beverage while gaming? Community 26 posts, 3/4 2:38AM What is the best Western/Western-like RPG on this list? Community 42 posts, 3/4 2:34AM PSN recovery no options 16 posts, 3/4 2:30AM GameFAQs Q&A Is PSN account sharing bannable? Tech Support 6 Answers Can you download mods for PlayStation 5 games or are mods exclusive PC? Main Quest 3 Answers How do you on the PS5 split the game audio to come through the TV and chat audio to come though the headset? Tech Support 1 Answer Why my call of duty cold war campaign won't install? Tech Support 2 Answers How to Unlock a region locked ps5 China version ? Tech Support 6 Answers Ask A Question Browse More Questions GameFAQsfacebook.com/GFAQstwitter.com/GameFAQsHelp / Contact UsChange Colors Blue (Default) Blue on Black Red Red on Black Green Green on Black Orange Orange on Black Purple Purple on Black Cloudy Blue Grayscale Sepia Cotton Candy gamespot.comgiantbomb.commetacritic.comfandom.comfanatical.com SitemapPartnershipsCareersTerms of UseDigital Services Act Privacy PolicyCookie SettingsReport Ad © 2025 FANDOM, INC. ALL RIGHTS RESERVED.",
      "title": "So how do you guys make friends without communities? - PlayStation 5 Menu Home Boards News Q&A Community Contribute Games 3DS Android Board/Card iOS PC PlayStation 3 PlayStation 4 PlayStation 5 Switch Vita Xbox 360 Xbox One Xbox Series More Systems PCPS4PS5SwitchXbox OneXbox SeriesMore Systems 3DS Android Board / Card DS Game Boy Advance GameCube iOS Nintendo 64 PlayStation PlayStation 2 PlayStation 3 PSP Super Nintendo Vita Wii Wii U Xbox 360 See All 143... Log In Sign Up GameFAQs BoardsNewsQ&ACommunityContributeGames So how do you guys make friends without communities? PlayStation 5 PlayStation 5 Log in to add games to your lists Notify me about new: Guides Cheats Reviews Questions News Board Topics Board Messages Add this game to my: Favorite Games Favorite Boards Home Q&A Board More Home Summary Release Data Game Credits Collection Stats Game Trivia Games Q&A Media Boxes Videos News Board What do you need help on? Cancel X Topic Archived First Previous Page of 6 Last You're browsing the GameFAQs Message Boards as a guest. Sign Up for free (or Log In if you already have an account) to be able to post messages, change how messages are displayed, and view media in posts. Boards PlayStation 5 So how do you guys make friends without communities? nedmo0000 1 year ago#41IllusiveArch posted...Agreed. Just gotta put yourself out there. You aren't going to vibe with everyone. It really does depend on what you do with your time in the day too.Social? Go places? Ull meet loads of ppl. Stay at home most of the day? You won't meet anyone.Find an activity that will allow you to bond with people would be my advice it’s so easy to break the ice when you are collectively working towards something, in my case it was a coding boot camp.White_Wolf_Kiba 1 year ago#42I think people who force themselves to find an activity and do it just to make friends never really make any friends and just go deeper in despair in MOST cases, not all cases.Like if it's all forced it's not going to end well.Like say you decide to go to a language class, but have little to no interest in the class, you go there just to make friends. Wouldn't you feel awkward because you know why you're there, you won't have the energy to put time and effort into the actual class and the people you meet there may or may not be friend material.Then you keep bumming around from \"activity\" to \"activity\" and fall further and further in despair.This is what I feel like happens to people who forcefully engage themselves in activities that aren't naturally appealing to them.https://www.youtube.com/c/GamingPalOllieMKGaming Pal Ollie - Video Game reviews and talk#43(message deleted)r4vio 1 year ago#44One of my ex's mothers used to have friends she had kept for 40+ years into her old adult hood. I asked her what she attributes to her friends sticking together. She said common interests was the biggest factor. So, that would be a good start. Not simply just an activity, but something both parties are very interested or passionate about.Alltra 1 year ago#45I'd love to be of help here TC, but I make it a personal point not to play games where I'd need a friend to play with me for any of the content. It's far too troublesome to be worth it.If at all possible, perhaps you might look into solo boosting with a second console, I have on rare occasions found that to be an effective and far less troublesome way to access content like this. Nobody more reliable than yourself.The meaning of life is to suffer and be miserable.Online is the worst thing to happen to gaming. Sometimes \"Done\" is the best feature.doki-doki-panic 1 year ago#46White_Wolf_Kiba posted...I think people who force themselves to find an activity and do it just to make friends never really make any friends and just go deeper in despair in MOST cases, not all cases.Like if it's all forced it's not going to end well.Like say you decide to go to a language class, but have little to no interest in the class, you go there just to make friends. Wouldn't you feel awkward because you know why you're there, you won't have the energy to put time and effort into the actual class and the people you meet there may or may not be friend material.Then you keep bumming around from \"activity\" to \"activity\" and fall further and further in despair.This is what I feel like happens to people who forcefully engage themselves in activities that aren't naturally appealing to them.Huh? With so many different things to be involved in that result in having to social with others, why the hell would you pick something like a language class that you aren't interested in. lol you'd pick something that you ARE interested in. And if nothing is of interest, then that sounds like a personal problem that needs addressed as a result of horizons that were never expanded.White_Wolf_Kiba 1 year ago#47doki-doki-panic posted...Huh? With so many different things to be involved in that result in having to social with others, why the hell would you pick something like a language class that you aren't interested in. lol you'd pick something that you ARE interested in. And if nothing is of interest, then that sounds like a personal problem that needs addressed as a result of horizons that were never expanded.There are people who do this, that's why I posted that and that it probably won't lead to anything positive. I used to know a few people over the years who just didn't know what to do with themselves, what interests they had and all that so they'd keep trying different things and forcing themselves to \"enjoy\" them just to be in as miserable a state after the activity was over as when it first started.I've never had to deal with this myself, I always had my interests, my tolerance of people and tolerance or rather intolerance of long socializing lol I pick and choose my friends rather harshly but I've known people well into their 30's and 40's constantly adrift form one \"activity\" to another looking for people, having so called friends they fake and mask in front of and never amounting to anything socially or emotionally.That's what I was talking about.Of course if TC has genuine interest in the activity they're undertaking this wouldn't apply to them.https://www.youtube.com/c/GamingPalOllieMKGaming Pal Ollie - Video Game reviews and talkLotto_plastered 1 year ago#48doki-doki-panic posted...Exactly, ya got all these 35-40 year olds that just sit in their moms basement all day long. Not going to meet anyone IRL if you never leave the basement. The video game isn't going anywhere... play it when you get back.I have some downright hilarious footage that will make anyone laugh of me interacting with people on TikTok and I have made some genuine friendships, but it does suck big time that I am not able to create the same relationships in person. It's just the way it is these days for a lot of peoplemolokoveloocet0 1 year ago#49IllusiveArch posted...I tried to accept it but it disappeared. Please send again! It's illusivearch88It looks like we’re all good. And holy s*** you play Marvel 3?? Are you any good? I’m pretty mediocre - rolled Zero since release and never labbed lightning loops lol - but I love it.Sweet deelAnti_FANBOY 1 year ago#50Its called random matchmakingLife doesnt have a retry option, but you can always quit. Boards PlayStation 5 So how do you guys make friends without communities? Topic Archived First Previous Page of 6 Last More Topics from this Board What do you guys think about the little passive aggressive mod notes Community 12 posts, 3/3 10:00AM What happened to Lost Planet? Will Capcom ever make Lost Planet 4? 11 posts, 2/26 12:40PM What is your go-to snack/beverage while gaming? Community 26 posts, 3/4 2:38AM What is the best Western/Western-like RPG on this list? Community 42 posts, 3/4 2:34AM PSN recovery no options 16 posts, 3/4 2:30AM GameFAQs Q&A Is PSN account sharing bannable? Tech Support 6 Answers Can you download mods for PlayStation 5 games or are mods exclusive PC? Main Quest 3 Answers How do you on the PS5 split the game audio to come through the TV and chat audio to come though the headset? Tech Support 1 Answer Why my call of duty cold war campaign won't install? Tech Support 2 Answers How to Unlock a region locked ps5 China version ? Tech Support 6 Answers Ask A Question Browse More Questions GameFAQsfacebook.com/GFAQstwitter.com/GameFAQsHelp / Contact UsChange Colors Blue (Default) Blue on Black Red Red on Black Green Green on Black Orange Orange on Black Purple Purple on Black Cloudy Blue Grayscale Sepia Cotton Candy gamespot.comgiantbomb.commetacritic.comfandom.comfanatical.com SitemapPartnershipsCareersTerms of UseDigital Services Act Privacy PolicyCookie SettingsReport Ad © 2025 FANDOM, INC. ALL RIGHTS RESERVED."
    },
    {
      "url": "https://powpsychotherapy.com/2022/01/31/how-to-make-geeky-friends/",
      "content": "POW! Psychotherapy How to Make Geeky Friends I hear everyday from clients that they wish they had more friends. We all want (and need!) to have a community. I also hear that it’s really hard to make friends in the Midwest, especially for transplants. “Everyone is still friends with the same people from high school.” “They’re leery of new people.” “They don’t follow through on plans.” Yes. A lot of friendship circles are pretty insular. I see that, too. And, there are plenty of folks also looking for friends! Don’t get discouraged. Either keep persisting or move on to the next. It’s really hard to make friends as an adult. Friendship is built through consistent contact over time. That’s why it was easier to make friends when we were kids – most of us were held hostage in school buildings, forced to interact with each other for seven to nine hours every day! And, that’s why, as we get older, we might make friends through our jobs. What if your coworkers aren’t geeks though? And you’re not in school? It takes more effort, and it’s totally doable. Here are some ways to make geek friends that work. Consider your fandoms, life, and circumstances, and seek out IRL contact. I know we’re still in a pandemic, and that makes some IRL contact more difficult. And, it’s possible to do it safely! A lot of these things have moved online, too, which might make it even more convenient and accessible! Hang out at your local comic or gaming shop, and attend their events. A lot of places have regular gaming days, where you can drop in and meet folks. Show up more than twice, and start to recognize the familiar faces. Introduce yourself. Talk about something you have in common. Awkward conversations can be great! They get the anxiety out of the way, and the other person will probably be grateful that you pushed through, because they want friends, too. Similarly, hang out at your local independent book seller and join a book club. Look up causes or cultural interests that are important to you and find a local organization that offers volunteer opportunities. Sign up and show up! Where do you like being? A local museum or gallery? A local nature center? Spend time there. Introduce yourself you people. Again, attend events and volunteer. What do you like doing? Trivia nights? Start attending the same one. Sports? Join a local club or invite people to watch games. Crafting? Sign up for a class at your local quilting or yarn shop. Being creative and weird? Join GISH and get put on a team. Take a class in something you enjoy. Community education classes and local community colleges usually have some great offerings. You can also check out something like EventBrite and search your area for upcoming presentations, trainings, or meet ups. Classes that meet more than once are preferred. Remember, consistency in contact over time is what builds the foundation for friendship. (This is how I’ve personally made some of my longest friendships!) Go to conventions. Talk to people at conventions. Exchange info. Follow each other on social media. Find out the next time you’ll both be at a convention. Convention friends are awesome. People with similar interests exist in your professional world. Check out the calendar for your local professional groups, and attend meetings or events. There are often niche professional organizations that attract like-minded people. Connect with your or a local/national/international union. In the same vein, look for connection around your circumstances. Are you a parent? Attend parenting groups and events. Dealing with some health stuff? Join a support group. Connect online. Online friendships can be just as strong and meaningful as local friend connections. Find your fandoms online, avoid the toxicity, and reach out to others you find cool or fun. Comment on their posts, be generous with the likes, and take the plunge to send an appropriate DM/PM. (Obviously, use common sense and internet safety precautions whenever you’re online.) If you’re in the Twin Cities, we have an amazing resource in Twin Cities Geek. Check out their calendar and attend the things that look fun. You’ll start to recognize people and suss out the ones you think are extra cool. If you’re somewhere else, see if you have a similar resource in your area. Here’s the secret: Everyone wants friends. Everyone is also anxious. If you’re waiting for someone to reach out to you, reach out to them instead! The worst that will happen is they won’t respond or they’ll say no to an invitation. The best that will happen is you’ll instantly have a new BFF. And, the most likely is that you’ll make some plans and see where things go! Fear is the potential friendship killer. We’re scared of being embarrassed and rejected. Our nervous system is telling us we literally might die if we put ourselves out there. Feelings are chemical and electrical reactions happening in our bodies, not a true reflection of reality. So here’s what to do: Persist Keep showing up at the same places, events, and opportunities over time. At least a few months. Initiate People want to be friends with you. They are waiting for an invitation. They don’t know you’re interested in knowing them unless you tell them. Soothe Assume people like you. I know it can be hard. If you just assume no one likes or will like you, you won’t make the effort in the first place. So set yourself up for success by recognizing you’re awesome! Calm your system and remind yourself, even if you feel awkward, feeling awkward is literally NOT going to kill you. You’ve got this! Want to know more about geeky mental health topics? Check out my other blog posts. Related Post navigation Hours & Info Travectia Therapy & Consulting, LLC DBA POW! Psychotherapy Recent Blog Posts: POW! Psychotherapy Guest Post: How might you know you are a highly sensitive person? Healing is Possible: Kevin Smith Parasocial Grief You must be logged in to post a comment.",
      "title": "POW! Psychotherapy How to Make Geeky Friends I hear everyday from clients that they wish they had more friends. We all want (and need!) to have a community. I also hear that it’s really hard to make friends in the Midwest, especially for transplants. “Everyone is still friends with the same people from high school.” “They’re leery of new people.” “They don’t follow through on plans.” Yes. A lot of friendship circles are pretty insular. I see that, too. And, there are plenty of folks also looking for friends! Don’t get discouraged. Either keep persisting or move on to the next. It’s really hard to make friends as an adult. Friendship is built through consistent contact over time. That’s why it was easier to make friends when we were kids – most of us were held hostage in school buildings, forced to interact with each other for seven to nine hours every day! And, that’s why, as we get older, we might make friends through our jobs. What if your coworkers aren’t geeks though? And you’re not in school? It takes more effort, and it’s totally doable. Here are some ways to make geek friends that work. Consider your fandoms, life, and circumstances, and seek out IRL contact. I know we’re still in a pandemic, and that makes some IRL contact more difficult. And, it’s possible to do it safely! A lot of these things have moved online, too, which might make it even more convenient and accessible! Hang out at your local comic or gaming shop, and attend their events. A lot of places have regular gaming days, where you can drop in and meet folks. Show up more than twice, and start to recognize the familiar faces. Introduce yourself. Talk about something you have in common. Awkward conversations can be great! They get the anxiety out of the way, and the other person will probably be grateful that you pushed through, because they want friends, too. Similarly, hang out at your local independent book seller and join a book club. Look up causes or cultural interests that are important to you and find a local organization that offers volunteer opportunities. Sign up and show up! Where do you like being? A local museum or gallery? A local nature center? Spend time there. Introduce yourself you people. Again, attend events and volunteer. What do you like doing? Trivia nights? Start attending the same one. Sports? Join a local club or invite people to watch games. Crafting? Sign up for a class at your local quilting or yarn shop. Being creative and weird? Join GISH and get put on a team. Take a class in something you enjoy. Community education classes and local community colleges usually have some great offerings. You can also check out something like EventBrite and search your area for upcoming presentations, trainings, or meet ups. Classes that meet more than once are preferred. Remember, consistency in contact over time is what builds the foundation for friendship. (This is how I’ve personally made some of my longest friendships!) Go to conventions. Talk to people at conventions. Exchange info. Follow each other on social media. Find out the next time you’ll both be at a convention. Convention friends are awesome. People with similar interests exist in your professional world. Check out the calendar for your local professional groups, and attend meetings or events. There are often niche professional organizations that attract like-minded people. Connect with your or a local/national/international union. In the same vein, look for connection around your circumstances. Are you a parent? Attend parenting groups and events. Dealing with some health stuff? Join a support group. Connect online. Online friendships can be just as strong and meaningful as local friend connections. Find your fandoms online, avoid the toxicity, and reach out to others you find cool or fun. Comment on their posts, be generous with the likes, and take the plunge to send an appropriate DM/PM. (Obviously, use common sense and internet safety precautions whenever you’re online.) If you’re in the Twin Cities, we have an amazing resource in Twin Cities Geek. Check out their calendar and attend the things that look fun. You’ll start to recognize people and suss out the ones you think are extra cool. If you’re somewhere else, see if you have a similar resource in your area. Here’s the secret: Everyone wants friends. Everyone is also anxious. If you’re waiting for someone to reach out to you, reach out to them instead! The worst that will happen is they won’t respond or they’ll say no to an invitation. The best that will happen is you’ll instantly have a new BFF. And, the most likely is that you’ll make some plans and see where things go! Fear is the potential friendship killer. We’re scared of being embarrassed and rejected. Our nervous system is telling us we literally might die if we put ourselves out there. Feelings are chemical and electrical reactions happening in our bodies, not a true reflection of reality. So here’s what to do: Persist Keep showing up at the same places, events, and opportunities over time. At least a few months. Initiate People want to be friends with you. They are waiting for an invitation. They don’t know you’re interested in knowing them unless you tell them. Soothe Assume people like you. I know it can be hard. If you just assume no one likes or will like you, you won’t make the effort in the first place. So set yourself up for success by recognizing you’re awesome! Calm your system and remind yourself, even if you feel awkward, feeling awkward is literally NOT going to kill you. You’ve got this! Want to know more about geeky mental health topics? Check out my other blog posts. Related Post navigation Hours & Info Travectia Therapy & Consulting, LLC DBA POW! Psychotherapy Recent Blog Posts: POW! Psychotherapy Guest Post: How might you know you are a highly sensitive person? Healing is Possible: Kevin Smith Parasocial Grief You must be logged in to post a comment."
    },
    {
      "url": "https://gooddads.com/how-to-make-friends-as-a-busy-dad/",
      "content": "Published Time: 2023-06-01T00:00:00+00:00 How to Make Friends as a Busy Dad - Good Dads [Skip to content](https://gooddads.com/how-to-make-friends-as-a-busy-dad/#main) Donate Programs for Dads Programs for Dads Programs for At-Risk Dads Good Dads Strong Schools Good Dads Great Communities Programs for Faith Communities Workplace Programs Class Locations Chapters Resources Resources Good Dads Blog Media Podcast Men’s Mental Health Child Support FAQs Conversation Starters #FunWithDad Events Get Involved Contact Us How to Make Friends as a Busy Dad < Back to Blog June 1, 2023 How to Make Friends as a Busy Dad I get it – you want friends. But as a grown man and a father, that can be a weird thing to admit out loud. But the truth is, you don’t just want friends, you need friends. And you can’t afford to go any longer without them. One survey found that 70% of fathers say that their stress levels increased in the 12 months after becoming a father for the first time, and approximately a quarter of dads say they felt isolated when they first became a father. Yet we know that friends are crucial to a healthy life. The same survey found that dads without close friends are more likely to experience increased stress levels in the first 12 months of becoming a father. Yet one-fifth of them – 1 out of 5 new fathers – reported losing connection with their friends after having a baby. Look, fatherhood is tough. Like, really tough. It’s one of the most rewarding yet challenging roles that any man can take on. Being a dad means you have to provide for your family, be a role model to your children, and create a positive home environment. It’s a lot for any man, much less for any man to try to do alone. The truth is, in the midst of all the chaos that is parenting, even the most capable fathers need support and guidance from time to time, and that’s why you absolutely must have friends. So let’s talk about the importance of having friends as a dad, how having friends can enhance your experience of fatherhood, and how you can find friends without being awkward.‍ Why Dads Need Friends‍ Emotional Support One of the most critical roles that friends can play in a dad’s life is providing emotional support. Being a dad can be a lonely experience, and it’s easy to feel isolated or overwhelmed. Friends can be a sounding board for your concerns and a listening ear when you need to vent. Having friends who are also fathers can be especially beneficial because they understand the unique challenges that come with raising children. They can offer empathy and support that non-parent friends might not be able to provide. It’s also important to note that having a supportive social network has been shown to have a positive impact on mental health, making it easier to manage stress and anxiety.‍ Learning from Their Lessons Another benefit of having friends as a dad is the opportunity to learn from their experiences. Every father has their unique parenting style, and sharing tips and advice with other dads can help you become a better parent. By seeing how other dads interact with their children, you can pick up new techniques for working through tough parenting situations. Dads can also learn from each other about different life stages and how to navigate them. For example, if you have friends who have children who are older than yours, they can offer insights into what to expect as your kids grow up. Or if you have friends with younger children, you can share your experiences and provide advice to them.‍ Balance Your Life a Little Another essential aspect of having friends as a dad is the ability to balance the craziness of life with laid-back socializing. Being a parent can be all-consuming, and it’s easy to lose touch with the outside world. Having a group of friends to socialize with can help you maintain a healthy work-life balance and give you an outlet to blow off steam. Friendship is about more than just spending time together. It’s about creating a sense of camaraderie, a feeling that you’re all in this together. You need that to balance out the dog-eat-dog mentality that is so pervasive in man culture right now. By having a group of dads who share your struggles and triumphs, you’ll feel less alone in the challenges of fatherhood. This can lead to deeper connections and a more profound sense of community.‍ Setting a Positive Example Having friends as a dad can also help you set a positive example for your children. By cultivating healthy relationships with other adults, you’re demonstrating the importance of social connection and how to maintain those connections throughout your life. Seeing you interact with your friends can help your children learn about communication, empathy, and the importance of having a support system. If you don’t want them to grow up lonely and awkward, show them what it looks like to get out of your comfort zone and value relationships with others.‍ But how can I make new friends as a busy dad? I’m glad you asked. Making new friends is tough – sometimes even tougher than parenting. It’s even more difficult when you’re an ambitious and busy person. Between work, family obligations, and other responsibilities, it can feel impossible to find the time and energy to meet new people. However, there are a few strategies you can use to make new friends, even when you have a full plate.‍ Make time for social activities I know, I know. This one’s kind of a gotcha. But it needs to be said over and over again. Yes, you might be busy. We all are. But you can’t afford not to make time for social activities. As much as you may not like it, socializing will give you the much needed breath of fresh air you need to get back in the good fight of parenting. This may mean cutting back on some other obligations or re-prioritizing your schedule. Making social activities a priority is essential for your mental health, and it’ll help you build a social support network.‍ Join a Dad’s group on social media If you’re one of those straight-forward, no-fluff kind of guys, this one’s for you. A surprisingly simple way to meet other dads is by joining…a dad’s group on social media. I know, brilliant, right? By joining a dad’s group online, you may not have the same physical vicinity as them, but you’ll have a built-in social network of people who understand the challenges of fatherhood. So it’s a great first step. A simple way to find groups on social media is by searching on Facebook for “men” or “dads” then filter by groups. You should see a long list of popular men’s groups or dad’s groups on there. Here’s a link to see Facebook groups for dads. You can even sort by city if you’re in a large enough region for there to be groups on social media near you. Another good way to find local groups on social media that are near you is to look for workout groups. Men love to work out together, so find a group that meets up to go running or to do other types of workouts and go join them!‍ Attend events with your kids One of the simplest ways to meet other dads is to attend events with your kids. Whether it’s a school function, a little league game, or a neighborhood BBQ, going to events where your kids are present can be an excellent way to meet other dads and break the ice without being awkward. You’ll have a natural conversation starter in the form of your shared experience as parents. Introduce yourself to other dads, ask about their children, and try to find common ground. You never know who you might click with, and these events can be an excellent opportunity to build new friendships.‍ Be approachable Guys are notorious for trying to be tough around each other. We give each other the silent treatment like we’re trying to see who’s the alpha in the room or something, when all we really want is to have another dude to cut up with and talk to about the hard things in life. But here’s the thing: you’re not going to get that without letting down your guard and the tough guy facade. Be open and approachable. Smile, make eye contact (without being weird), and be willing to strike up a conversation. If you’re at an event with your kids, don’t be afraid to approach other dads and introduce yourself. Making new friends as a busy dad may seem daunting, but it’s entirely possible. Remember, even small efforts to connect with other guys can lead to friendships you never thought would happen. But in order to make that happen, let’s talk about some places to go to find or hang out with new dad-friends. LEARN MORE: Episode 95: Encouraging Strong Friendships ‍ Here are some places you can go to make friends as a dad If you stop and think about it, there are lots of places you can go to make friends as a dad. Here are a few ideas: Community centers often have programs or events geared towards families and children, which can be an excellent opportunity to meet other dads. Check out your local community center’s calendar of events to see what’s coming up. The gym is another easy place to meet other dads. A lot of guys go to the gym to blow off steam and get their minds right either before or after a long day. So why not talk to some of the dudes you’re walking past every day in the gym? After all, you’re probably dealing with a lot of the same problems. And the gym gives you a built-in ice breaker for conversations. So talk to each other! Another good place to meet friends is in adult sports leagues. Joining a local sports league, whether it’s for basketball, soccer, or softball, can be a really good way to meet other dads who like what you like. Even if you’re not particularly athletic, the good news is, most everyone else in the league won’t be athletic either. Plus, joining a recreational league is fun, you’ll stay active, and meet new friends along the way. Win-win-win. Of course, if you’re a working dad, you may also be able to make friends with other dads in your workplace. Try to connect with other men in the break room or at company events. And yes, you’ll have to go out of your way to break the ice. But do you want friends or not? If so, you’ll have to be the one to speak first at the break room coffee machine. In addition to joining dad’s groups on social media, you can also use online platforms like Meetup to find groups of like-minded individuals. These groups can be focused on anything from hiking to board games, and they can be a really good way to meet new people. Remember, it’s only weird if you make it weird. If you have school-age children, you may be able to meet other dads through school events like daddy-daughter dances, PTA, parent-teacher conferences, back-to-school nights, and other school functions like field trips and carnivals. And last but not least, don’t forget the tried-and-true way to find friends: in your neighborhood. Whether it’s a football game, a cookout, a community pool party, a neighborhood Facebook group or simply striking up a conversation while you’re out for a walk with your kids, there are other dads in your community who are looking for new friends as well. Be that guy for them. ‍ Activities dads can do with new friends so it isn’t awkward Women like to do things face to face: dinners, makeovers, long conversations, etc. But men like to do things shoulder to shoulder: cooking, camping, sports, etc. So when you’re trying to make new friends as a dad, try to find activities that let you connect with other guys and do some sort of activity at the same time. That’ll keep you from feeling awkward or uncomfortable. Here are a few ideas for activities you can do with new dad friends: Go for a Hike: Hiking is an awesome way to get exercise without feeling like you’re killing yourself. You’ll also get to enjoy nature and hang out with friends in the process. Play Sports: Whether it’s a pickup basketball game or a round of golf, playing sports is one the the best ways to bond with other dads without having to come up with something to do together. Visit a Museum: If you and your new friends are interested in art or history, visiting a museum can be a good way to hangout. There are plenty of manly museums out there – history museums, military museums, nature museums, etc. Many museums have interactive exhibits and activities that can be fun for adults and kids, too, so you can take the kids along to give the moms a break and score double points. Have a Game Night: Guys poker night might be the oldest and most reliable way to build friendships. But you don’t have to play poker. You can play board games, other card games, or even video games if that’s what you’re into. Attend a Sporting Event: Going to a game is another good non-awkward activity for guys to do together. Whether it’s a professional game or just a local high school game, going to some sort of sporting event can be an awesome way to bond with other dads who share your love of sports. Volunteer Together: If you’re a church-goer, this one is a no-brainer. Volunteering for your church or a local charity is another good way to give back to your community while getting to know new people. If you don’t attend a local church, look for opportunities to serve at a local food bank, animal shelter, or other community organization. Then invite a guy from work or in the neighborhood to come with you. And yes, you can bring your kids along if that helps make it less awkward. Have a BBQ: Dudes love anything at all to do with cooking. Even if they don’t want to be the one cooking, no one turns down the chance to sit on a back patio with a cold drink and good food. And if they do turn it down, you don’t want that kind of friend anyways. But seriously, hosting a BBQ can be a fun way to bring together potential dad friends and their families in a no-pressure atmosphere. ‍ At the end of the day, just pick something you like doing and invite a guy along. Don’t overthink it. Try to find activities that are fun and not awkward by focusing on things that almost any guy would enjoy. Ease into the lunches and nights out if that’s too deep for you at first. There’s nothing wrong with that. With a little creativity, you can find plenty of ways to find dad friends and build lasting friendships. Because honestly man, you need it. And everyone around you will be better off for you having invested in meaningful friendships. About the Author Dad Well Done Mike P. Taylor is a proud husband and father of 4 from North Alabama. He is an author, speaker, and coach who helps dads find purpose so they can live and lead with clear direction. You can learn more about him on his website https://www.dadwelldone.com See More Tags advice, communication, emotional intelligence, friends, fun, leadership, learning, mental health, relationships Sort by Topic: Lorem ipsum dolor sit amet, consectetur adipiscing elit. Ut elit tellus, luctus nec ullamcorper mattis, pulvinar dapibus leo. Search Related Posts Snow Day Stories from Good Dads Brrrrr! Bitter winds are howling. Tiny frozen crystals dance from the cloudy sky. Slippery ice covers every surface. It can only mean one thing: a READ MORE How to Keep the Romance Alive All Year Long We’ve been covering healthy relationships (romantic and otherwise) here on the Good Dads blog for years, and this week we’ve collected some of our favorite READ MORE Helping Your Student Achieve Success The oft-heard adage, “Fake it ’till you make it” isn’t perfectly true, but it does contain an important nugget of truth. You see, no one READ MORE Read More 415 E. Walnut Street Springfield, MO 65806 Call us: (417) 501-8867 Monday – Thursday: 8:00 AM – 3:00 PM Friday: 8:00 AM – 12:00 PM ​Saturday – Sunday: Closed Join our Newsletter Be the first to receive updates from Good Dads. Email Email About Our Team Partners FAQ Contact Us Events Programs Programs for At-Risk Dads Programs for Schools Programs for Communities Workplace Programs Programs for Faith Media Podcast News What I Want to Be Chapters Where are the Chapters? Start a Chapter Get Involved Donate Merch Training Camp Volunteer Business Partnerships © 2025 Good Dads All Rights Reserved. A United Way Partner United Way of the Ozarks",
      "title": "Published Time: 2023-06-01T00:00:00+00:00 How to Make Friends as a Busy Dad - Good Dads [Skip to content](https://gooddads.com/how-to-make-friends-as-a-busy-dad/#main) Donate Programs for Dads Programs for Dads Programs for At-Risk Dads Good Dads Strong Schools Good Dads Great Communities Programs for Faith Communities Workplace Programs Class Locations Chapters Resources Resources Good Dads Blog Media Podcast Men’s Mental Health Child Support FAQs Conversation Starters #FunWithDad Events Get Involved Contact Us How to Make Friends as a Busy Dad < Back to Blog June 1, 2023 How to Make Friends as a Busy Dad I get it – you want friends. But as a grown man and a father, that can be a weird thing to admit out loud. But the truth is, you don’t just want friends, you need friends. And you can’t afford to go any longer without them. One survey found that 70% of fathers say that their stress levels increased in the 12 months after becoming a father for the first time, and approximately a quarter of dads say they felt isolated when they first became a father. Yet we know that friends are crucial to a healthy life. The same survey found that dads without close friends are more likely to experience increased stress levels in the first 12 months of becoming a father. Yet one-fifth of them – 1 out of 5 new fathers – reported losing connection with their friends after having a baby. Look, fatherhood is tough. Like, really tough. It’s one of the most rewarding yet challenging roles that any man can take on. Being a dad means you have to provide for your family, be a role model to your children, and create a positive home environment. It’s a lot for any man, much less for any man to try to do alone. The truth is, in the midst of all the chaos that is parenting, even the most capable fathers need support and guidance from time to time, and that’s why you absolutely must have friends. So let’s talk about the importance of having friends as a dad, how having friends can enhance your experience of fatherhood, and how you can find friends without being awkward.‍ Why Dads Need Friends‍ Emotional Support One of the most critical roles that friends can play in a dad’s life is providing emotional support. Being a dad can be a lonely experience, and it’s easy to feel isolated or overwhelmed. Friends can be a sounding board for your concerns and a listening ear when you need to vent. Having friends who are also fathers can be especially beneficial because they understand the unique challenges that come with raising children. They can offer empathy and support that non-parent friends might not be able to provide. It’s also important to note that having a supportive social network has been shown to have a positive impact on mental health, making it easier to manage stress and anxiety.‍ Learning from Their Lessons Another benefit of having friends as a dad is the opportunity to learn from their experiences. Every father has their unique parenting style, and sharing tips and advice with other dads can help you become a better parent. By seeing how other dads interact with their children, you can pick up new techniques for working through tough parenting situations. Dads can also learn from each other about different life stages and how to navigate them. For example, if you have friends who have children who are older than yours, they can offer insights into what to expect as your kids grow up. Or if you have friends with younger children, you can share your experiences and provide advice to them.‍ Balance Your Life a Little Another essential aspect of having friends as a dad is the ability to balance the craziness of life with laid-back socializing. Being a parent can be all-consuming, and it’s easy to lose touch with the outside world. Having a group of friends to socialize with can help you maintain a healthy work-life balance and give you an outlet to blow off steam. Friendship is about more than just spending time together. It’s about creating a sense of camaraderie, a feeling that you’re all in this together. You need that to balance out the dog-eat-dog mentality that is so pervasive in man culture right now. By having a group of dads who share your struggles and triumphs, you’ll feel less alone in the challenges of fatherhood. This can lead to deeper connections and a more profound sense of community.‍ Setting a Positive Example Having friends as a dad can also help you set a positive example for your children. By cultivating healthy relationships with other adults, you’re demonstrating the importance of social connection and how to maintain those connections throughout your life. Seeing you interact with your friends can help your children learn about communication, empathy, and the importance of having a support system. If you don’t want them to grow up lonely and awkward, show them what it looks like to get out of your comfort zone and value relationships with others.‍ But how can I make new friends as a busy dad? I’m glad you asked. Making new friends is tough – sometimes even tougher than parenting. It’s even more difficult when you’re an ambitious and busy person. Between work, family obligations, and other responsibilities, it can feel impossible to find the time and energy to meet new people. However, there are a few strategies you can use to make new friends, even when you have a full plate.‍ Make time for social activities I know, I know. This one’s kind of a gotcha. But it needs to be said over and over again. Yes, you might be busy. We all are. But you can’t afford not to make time for social activities. As much as you may not like it, socializing will give you the much needed breath of fresh air you need to get back in the good fight of parenting. This may mean cutting back on some other obligations or re-prioritizing your schedule. Making social activities a priority is essential for your mental health, and it’ll help you build a social support network.‍ Join a Dad’s group on social media If you’re one of those straight-forward, no-fluff kind of guys, this one’s for you. A surprisingly simple way to meet other dads is by joining…a dad’s group on social media. I know, brilliant, right? By joining a dad’s group online, you may not have the same physical vicinity as them, but you’ll have a built-in social network of people who understand the challenges of fatherhood. So it’s a great first step. A simple way to find groups on social media is by searching on Facebook for “men” or “dads” then filter by groups. You should see a long list of popular men’s groups or dad’s groups on there. Here’s a link to see Facebook groups for dads. You can even sort by city if you’re in a large enough region for there to be groups on social media near you. Another good way to find local groups on social media that are near you is to look for workout groups. Men love to work out together, so find a group that meets up to go running or to do other types of workouts and go join them!‍ Attend events with your kids One of the simplest ways to meet other dads is to attend events with your kids. Whether it’s a school function, a little league game, or a neighborhood BBQ, going to events where your kids are present can be an excellent way to meet other dads and break the ice without being awkward. You’ll have a natural conversation starter in the form of your shared experience as parents. Introduce yourself to other dads, ask about their children, and try to find common ground. You never know who you might click with, and these events can be an excellent opportunity to build new friendships.‍ Be approachable Guys are notorious for trying to be tough around each other. We give each other the silent treatment like we’re trying to see who’s the alpha in the room or something, when all we really want is to have another dude to cut up with and talk to about the hard things in life. But here’s the thing: you’re not going to get that without letting down your guard and the tough guy facade. Be open and approachable. Smile, make eye contact (without being weird), and be willing to strike up a conversation. If you’re at an event with your kids, don’t be afraid to approach other dads and introduce yourself. Making new friends as a busy dad may seem daunting, but it’s entirely possible. Remember, even small efforts to connect with other guys can lead to friendships you never thought would happen. But in order to make that happen, let’s talk about some places to go to find or hang out with new dad-friends. LEARN MORE: Episode 95: Encouraging Strong Friendships ‍ Here are some places you can go to make friends as a dad If you stop and think about it, there are lots of places you can go to make friends as a dad. Here are a few ideas: Community centers often have programs or events geared towards families and children, which can be an excellent opportunity to meet other dads. Check out your local community center’s calendar of events to see what’s coming up. The gym is another easy place to meet other dads. A lot of guys go to the gym to blow off steam and get their minds right either before or after a long day. So why not talk to some of the dudes you’re walking past every day in the gym? After all, you’re probably dealing with a lot of the same problems. And the gym gives you a built-in ice breaker for conversations. So talk to each other! Another good place to meet friends is in adult sports leagues. Joining a local sports league, whether it’s for basketball, soccer, or softball, can be a really good way to meet other dads who like what you like. Even if you’re not particularly athletic, the good news is, most everyone else in the league won’t be athletic either. Plus, joining a recreational league is fun, you’ll stay active, and meet new friends along the way. Win-win-win. Of course, if you’re a working dad, you may also be able to make friends with other dads in your workplace. Try to connect with other men in the break room or at company events. And yes, you’ll have to go out of your way to break the ice. But do you want friends or not? If so, you’ll have to be the one to speak first at the break room coffee machine. In addition to joining dad’s groups on social media, you can also use online platforms like Meetup to find groups of like-minded individuals. These groups can be focused on anything from hiking to board games, and they can be a really good way to meet new people. Remember, it’s only weird if you make it weird. If you have school-age children, you may be able to meet other dads through school events like daddy-daughter dances, PTA, parent-teacher conferences, back-to-school nights, and other school functions like field trips and carnivals. And last but not least, don’t forget the tried-and-true way to find friends: in your neighborhood. Whether it’s a football game, a cookout, a community pool party, a neighborhood Facebook group or simply striking up a conversation while you’re out for a walk with your kids, there are other dads in your community who are looking for new friends as well. Be that guy for them. ‍ Activities dads can do with new friends so it isn’t awkward Women like to do things face to face: dinners, makeovers, long conversations, etc. But men like to do things shoulder to shoulder: cooking, camping, sports, etc. So when you’re trying to make new friends as a dad, try to find activities that let you connect with other guys and do some sort of activity at the same time. That’ll keep you from feeling awkward or uncomfortable. Here are a few ideas for activities you can do with new dad friends: Go for a Hike: Hiking is an awesome way to get exercise without feeling like you’re killing yourself. You’ll also get to enjoy nature and hang out with friends in the process. Play Sports: Whether it’s a pickup basketball game or a round of golf, playing sports is one the the best ways to bond with other dads without having to come up with something to do together. Visit a Museum: If you and your new friends are interested in art or history, visiting a museum can be a good way to hangout. There are plenty of manly museums out there – history museums, military museums, nature museums, etc. Many museums have interactive exhibits and activities that can be fun for adults and kids, too, so you can take the kids along to give the moms a break and score double points. Have a Game Night: Guys poker night might be the oldest and most reliable way to build friendships. But you don’t have to play poker. You can play board games, other card games, or even video games if that’s what you’re into. Attend a Sporting Event: Going to a game is another good non-awkward activity for guys to do together. Whether it’s a professional game or just a local high school game, going to some sort of sporting event can be an awesome way to bond with other dads who share your love of sports. Volunteer Together: If you’re a church-goer, this one is a no-brainer. Volunteering for your church or a local charity is another good way to give back to your community while getting to know new people. If you don’t attend a local church, look for opportunities to serve at a local food bank, animal shelter, or other community organization. Then invite a guy from work or in the neighborhood to come with you. And yes, you can bring your kids along if that helps make it less awkward. Have a BBQ: Dudes love anything at all to do with cooking. Even if they don’t want to be the one cooking, no one turns down the chance to sit on a back patio with a cold drink and good food. And if they do turn it down, you don’t want that kind of friend anyways. But seriously, hosting a BBQ can be a fun way to bring together potential dad friends and their families in a no-pressure atmosphere. ‍ At the end of the day, just pick something you like doing and invite a guy along. Don’t overthink it. Try to find activities that are fun and not awkward by focusing on things that almost any guy would enjoy. Ease into the lunches and nights out if that’s too deep for you at first. There’s nothing wrong with that. With a little creativity, you can find plenty of ways to find dad friends and build lasting friendships. Because honestly man, you need it. And everyone around you will be better off for you having invested in meaningful friendships. About the Author Dad Well Done Mike P. Taylor is a proud husband and father of 4 from North Alabama. He is an author, speaker, and coach who helps dads find purpose so they can live and lead with clear direction. You can learn more about him on his website https://www.dadwelldone.com See More Tags advice, communication, emotional intelligence, friends, fun, leadership, learning, mental health, relationships Sort by Topic: Lorem ipsum dolor sit amet, consectetur adipiscing elit. Ut elit tellus, luctus nec ullamcorper mattis, pulvinar dapibus leo. Search Related Posts Snow Day Stories from Good Dads Brrrrr! Bitter winds are howling. Tiny frozen crystals dance from the cloudy sky. Slippery ice covers every surface. It can only mean one thing: a READ MORE How to Keep the Romance Alive All Year Long We’ve been covering healthy relationships (romantic and otherwise) here on the Good Dads blog for years, and this week we’ve collected some of our favorite READ MORE Helping Your Student Achieve Success The oft-heard adage, “Fake it ’till you make it” isn’t perfectly true, but it does contain an important nugget of truth. You see, no one READ MORE Read More 415 E. Walnut Street Springfield, MO 65806 Call us: (417) 501-8867 Monday – Thursday: 8:00 AM – 3:00 PM Friday: 8:00 AM – 12:00 PM ​Saturday – Sunday: Closed Join our Newsletter Be the first to receive updates from Good Dads. Email Email About Our Team Partners FAQ Contact Us Events Programs Programs for At-Risk Dads Programs for Schools Programs for Communities Workplace Programs Programs for Faith Media Podcast News What I Want to Be Chapters Where are the Chapters? Start a Chapter Get Involved Donate Merch Training Camp Volunteer Business Partnerships © 2025 Good Dads All Rights Reserved. A United Way Partner United Way of the Ozarks"
    }
  ],
  "researchSummary": "Published Time: 2022-12-14T16:26:08+00:00 4 ways to make friends without feeling socially awkward | IGNITE Sorry, there has been error and we cannot log you in at this time. ERROR: Unable to confirm current student status. Terminate session Hello Log Out Log In IGNITE About IGNITE Impact Report Board of Directors Staff Directory Media Interview Requests Services Health & Dental Insurance Plan Soupbar Sleep Lounge Zen Zone Menstrual Products Tax Clinic Posting and Student Centre Requests Financial Support Learning Essentials Support Bursaries & Financial Relief Program GLOW Bursary Skills Bundle Equity Scholarships Black Excellence Scholarship Indigenous Scholarship Pride Scholarship Get Involved Events & Contests Clubs Election Work at IGNITE Advocacy Student Advocates Academic Program Reps Equity & Inclusion Indigenous Resources Black Excellence Resources 2SLGBTQ+ Resources News Search for: Search Submit Please log in using your Humber ID. Don’t forget to include ‘@humber.ca’ in your username. UofGH students, to locate your Humber ID and password, please use this form. You can also search your ‘@guelphhumber.ca’ email account for “Humber login credential”. If you continue to have issues locating or using your @humber.ca ID, please contact the Humber IT Service Desk: Visit Humber IT Support Centre (Live Chat available during business hours.) Email servicedesk@humber.ca Call 416-675-6622 ext. 4357 4 Ways to make friends without feeling socially awkward It's time to socialize By: Jeneen Richards On: December 14, 2022 Don’t be afraid to start a conversation Raise of hands if you’re struggling to make friends right now. Navigating online classes for two years has made it difficult to get back out there socially. We’re accustomed to attending classes in our pyjamas or using WhatsApp for most group assignments and we’ve missed out on interacting with our peers face-to-face. Now that we’re back in person, it’s time to shake things up. So, here are four ways you can make fr",
  "coreTopic": "The main topic revolves around strategies for socializing and making friends, particularly in the context of reconnecting after the isolation brought on by online learning during the pandemic. It emphasizes overcoming social awkwardness and offers practical tips for engaging with peers in person.",
  "brandInfo": "\n      Website: https://foundertoolkit.org/\n      Brand: foundertoolkit\n      Products: No product images\n      Description: Backed by learnings and experience of solopreneurs who built tech startups doing 1M+ ARR\n\n      Documents: No documents\n      Logo: No logo\n      Posts/Videos: No posts/videos\n      Taglines: None\n      Colours: No colours\n      Country: No country\n    ",
  "youtubeVideo": "No video found.",
  "internalLinks": [
    "/blog/tips-for-growth",
    "/resources/ecommerce-guide"
  ],
  "references": [
    "https://playpickups.app/",
    "https://ignitestudentlife.com/4-ways-to-make-friends-without-feeling-socially-awkward/",
    "https://www.reddit.com/r/Games/comments/1udemc/what_the_best_way_to_make_friends_in_online_games/",
    "https://ocremix.org/community/topic/44249-lonely-gamer-doesnt-know-how-to-make-friends-anymore/",
    "https://www.quora.com/Why-is-it-so-hard-to-make-friends-in-person-as-a-gamer",
    "https://blog.gametruckparty.com/how-to-make-friends-online-with-video-games/",
    "https://gamefaqs.gamespot.com/boards/264562-playstation-5/80634295?page=4",
    "https://powpsychotherapy.com/2022/01/31/how-to-make-geeky-friends/",
    "https://gooddads.com/how-to-make-friends-as-a-busy-dad/",
    "No video found."
  ],
  "existingPosts": "",
  "targetKeywords": [],
  "timestamp": "2025-03-04",
  "nudge": "9lvdk"
}