{
  "initialUrl": "https://foundertoolkit.org/",
  "initialResearchSummary": "FOUNDER TOOLKIT. UNLOCKING OUR METHODS. Proven concepts, case studies and training we offer for free to help you grow your business. What are you looking for? Key concepts & case studies. Interested in a specific topic? Come Behind the Counter and learn something new. ... https: //behindthecounter",
  "researchResults": [
    {
      "url": "https://forums.sufficientvelocity.com/threads/placeholder-quest-i-want-to-write-a-quest-pick-which-one-you-want.128591/page-3",
      "content": "GitHub - PikaMug/PlaceholderExpansion-Quests: Provides quest variables for PAPI usage Skip to content Navigation Menu Toggle navigation Sign in Product GitHub Copilot Write better code with AI Security Find and fix vulnerabilities Actions Automate any workflow Codespaces Instant dev environments Issues Plan and track work Code Review Manage code changes Discussions Collaborate outside of code Code Search Find more, search less Explore All features Documentation GitHub Skills Blog Solutions By company size Enterprises Small and medium teams Startups Nonprofits By use case DevSecOps DevOps CI/CD View all use cases By industry Healthcare Financial services Manufacturing Government View all industries View all solutions Resources Topics AI DevOps Security Software Development View all Explore Learning Pathways Events & Webinars Ebooks & Whitepapers Customer Stories Partners Executive Insights Open Source GitHub Sponsors Fund open source developers The ReadME Project GitHub community articles Repositories Topics Trending Collections Enterprise Enterprise platform AI-powered developer platform Available add-ons Advanced Security Enterprise-grade security features GitHub Copilot Enterprise-grade AI features Premium Support Enterprise-grade 24/7 support Pricing Search or jump to... Search code, repositories, users, issues, pull requests... Search Clear Search syntax tips Provide feedback We read every piece of feedback, and take your input very seriously. Include my email address so I can be contacted Cancel Submit feedback Saved searches Use saved searches to filter your results more quickly Name Query To see all available qualifiers, see our documentation. Cancel Create saved search Sign in Sign up Reseting focus You signed in with another tab or window. Reload to refresh your session. You signed out in another tab or window. Reload to refresh your session. You switched accounts on another tab or window. Reload to refresh your session. Dismiss alert {{ message }} PikaMug / PlaceholderExpansion-Quests Public Notifications You must be signed in to change notification settings Fork 6 Star 1 Provides quest variables for PAPI usage 1 star 6 forks Branches Tags Activity Star Notifications You must be signed in to change notification settings Code Issues 2 Pull requests 0 Actions Projects 0 Wiki Security Insights Additional navigation options Code Issues Pull requests Actions Projects Wiki Security Insights PikaMug/PlaceholderExpansion-Quests master BranchesTags Go to file Code Folders and files | Name | Name | Last commit message | Last commit date | | --- | --- | --- | --- | | Latest commit History 14 Commits | | .idea | .idea | | | | src/main/java/me/pikamug/questsexpansion | src/main/java/me/pikamug/questsexpansion | | | | README.md | README.md | | | | View all files | Repository files navigation README Easy info across the board PlaceholderExpansion-Quests is an expansion which provides Quests placeholders for the PlaceholderAPI plugin. Download Distributed through these fine vendors: SpigotMC (https://www.spigotmc.org/resources/placeholderexpansion-quests.69357/) PAPI eCloud (https://api.extendedclip.com/expansions/quests/) Usage DO NOT PUT IN YOUR /plugins FOLDER. Place in /PlaceholderAPI/expansions only! About Provides quest variables for PAPI usage Topics java minecraft bukkit spigot Resources Readme Activity Stars 1 star Watchers 3 watching Forks 6 forks Report repository Releases No releases published Packages 0 No packages published Contributors 2 Languages Java 100.0% Footer © 2025 GitHub, Inc. Footer navigation Terms Privacy Security Status Docs Contact Manage cookies Do not share my personal information You can’t perform that action at this time.",
      "title": "GitHub - PikaMug/PlaceholderExpansion-Quests: Provides quest variables for PAPI usage Skip to content Navigation Menu Toggle navigation Sign in Product GitHub Copilot Write better code with AI Security Find and fix vulnerabilities Actions Automate any workflow Codespaces Instant dev environments Issues Plan and track work Code Review Manage code changes Discussions Collaborate outside of code Code Search Find more, search less Explore All features Documentation GitHub Skills Blog Solutions By company size Enterprises Small and medium teams Startups Nonprofits By use case DevSecOps DevOps CI/CD View all use cases By industry Healthcare Financial services Manufacturing Government View all industries View all solutions Resources Topics AI DevOps Security Software Development View all Explore Learning Pathways Events & Webinars Ebooks & Whitepapers Customer Stories Partners Executive Insights Open Source GitHub Sponsors Fund open source developers The ReadME Project GitHub community articles Repositories Topics Trending Collections Enterprise Enterprise platform AI-powered developer platform Available add-ons Advanced Security Enterprise-grade security features GitHub Copilot Enterprise-grade AI features Premium Support Enterprise-grade 24/7 support Pricing Search or jump to... Search code, repositories, users, issues, pull requests... Search Clear Search syntax tips Provide feedback We read every piece of feedback, and take your input very seriously. Include my email address so I can be contacted Cancel Submit feedback Saved searches Use saved searches to filter your results more quickly Name Query To see all available qualifiers, see our documentation. Cancel Create saved search Sign in Sign up Reseting focus You signed in with another tab or window. Reload to refresh your session. You signed out in another tab or window. Reload to refresh your session. You switched accounts on another tab or window. Reload to refresh your session. Dismiss alert {{ message }} PikaMug / PlaceholderExpansion-Quests Public Notifications You must be signed in to change notification settings Fork 6 Star 1 Provides quest variables for PAPI usage 1 star 6 forks Branches Tags Activity Star Notifications You must be signed in to change notification settings Code Issues 2 Pull requests 0 Actions Projects 0 Wiki Security Insights Additional navigation options Code Issues Pull requests Actions Projects Wiki Security Insights PikaMug/PlaceholderExpansion-Quests master BranchesTags Go to file Code Folders and files | Name | Name | Last commit message | Last commit date | | --- | --- | --- | --- | | Latest commit History 14 Commits | | .idea | .idea | | | | src/main/java/me/pikamug/questsexpansion | src/main/java/me/pikamug/questsexpansion | | | | README.md | README.md | | | | View all files | Repository files navigation README Easy info across the board PlaceholderExpansion-Quests is an expansion which provides Quests placeholders for the PlaceholderAPI plugin. Download Distributed through these fine vendors: SpigotMC (https://www.spigotmc.org/resources/placeholderexpansion-quests.69357/) PAPI eCloud (https://api.extendedclip.com/expansions/quests/) Usage DO NOT PUT IN YOUR /plugins FOLDER. Place in /PlaceholderAPI/expansions only! About Provides quest variables for PAPI usage Topics java minecraft bukkit spigot Resources Readme Activity Stars 1 star Watchers 3 watching Forks 6 forks Report repository Releases No releases published Packages 0 No packages published Contributors 2 Languages Java 100.0% Footer © 2025 GitHub, Inc. Footer navigation Terms Privacy Security Status Docs Contact Manage cookies Do not share my personal information You can’t perform that action at this time."
    },
    {
      "url": "https://bethandersonwriter.com/2022/12/02/behind-the-scenes-using-placeholder-words-and-stanzas-until-the-lightbulb-moment-by-debra-shumaker/",
      "content": "Published Time: 2022-12-02T12:32:00+00:00 Behind the Scenes: “Using Placeholder Words and Stanzas until the Lightbulb Moment” by Debra Shumaker – Beth Anderson, Children's Writer Skip to content Beth Anderson, Children's Writer Reader, Writer, Miner of Moments Menu Blog Books About Parent/Teacher Resources Author Visits Behind the Scenes: “Using Placeholder Words and Stanzas until the Lightbulb Moment” by Debra Shumaker Posted on December 2, 2022December 1, 2022 by Beth Anderson I absolutely loved Debra Shumaker’s book, FREAKY, FUNKY FISH, so when I learned of her new one, PECULIAR PRIMATES, I invited Debra back in hopes she might share something about it. Her topic in this post is valuable not only for authors, but educators, too! I get stalled way too easily and frequently on imperfect words or phrases in my early drafts. Debra is also offering a GIVEAWAY—a copy of PECULIAR PRIMATES!! Leave a comment below to enter the drawing. Congratulations to Ashley Sierra, winner of ALL SHEEP ARE NOT BORING! from illustrator Julie Rowan-Zoch! Using Placeholder Words and Stanzas until the Lightbulb Moment by Debra Shumaker I was thrilled when Running Press Kids asked if I was interested in writing about primates as a companion book to FREAKY, FUNKY FISH. Of course I said “Yes!” I knew I wanted this primate book to have the same “feel” as FREAKY, FUNKY FISH: the same meter and rhyme scheme, starting with common features before focusing on the strange and unusual, and the last set of facts having a nighttime scene to give the book some sort of narrative arc before the conclusion. So I dove into research and tackled the opening, taking notes on what primates had in common. I wrote: hair or fur produce milk birth live babies care for their young breathe air warm-blooded no paws but hands and feet many live in trees Playing with the various facts and possible rhyme of air/hair, I wrote: All primates nurse and breathe in air. They have big brains and fur or hair. I was not comfortable with “nurse” but needed a one syllable verb that all primates had in common. That’s all I could come up with. While “nurse” was accurate, to me it was an awkward beginning for a young audience and my critique group thought the same. Imagining the illustration, I envisioned school visits could be a bit uncomfortable, lol. But, I decided to use “nurse” as a placeholder so I could move on to the rest of the story. I hoped that, as I delved deeper into the research, another common feature would become apparent. So I moved on. While researching unique features for the body of the book, I played close attention to options for a nighttime scene. I read that bonobos wove a nest each night, fell asleep on their backs, and held onto a branch with one foot as they slept. Bingo! So I wrote: One weaves itself a nest each night, then goes to sleep by holding tight. It was a nighttime scene, the meter and rhyme worked, but rereading it, I realized I didn’t love it. I typically didn’t use four lines to cover one adaptation. But at least I had something down. It became another placeholder so I could focus on the main part of the book. Hopefully, I would find another primate feature to rhyme with night, but at least I had something. Through versions 2, 3, 4, 5, 6, and 7 those placeholder words and lines bugged me. Every time I sent the story to my critique groups, I always noted “I do not plan on keeping ‘nurse’ and I’m looking for another primate feature to rhyme with night, but what do you think of the rest?” I started to solidify the body by reviewing/confirming my facts so I could write the back matter. As I got closer and closer to feeling “done”, I began to worry I was going to be stuck with those placeholders. They worked, but I didn’t like them. Finally, while rereading my notes, a lightbulb moment—all primates climb! A one-syllable verb! One little word and my opening spread was SO much better. Then, a second lightbulb moment. I reread a line in my notes that stated “Titi monkeys twine their tails together when they sleep.” Hmm, could I use that? Yes! And bonus—nice alliteration to close the story. My new nighttime spread became: Some primates build a nest each night, while others sleep with tails twined tight. I now had a manuscript free of my placeholders. Once I finished the back matter, I sent PECULIAR PRIMATES it off. A few months later I had a contract—and no changes to the text was needed. Success. Don’t forget to leave a comment below for a chance to win a copy of PECULIAR PRIMATES. (Continental US addresses only, please. Winner announced 12/9/22) Share this: Email Facebook Bluesky Threads Pinterest Like Loading... Related Posted in Behind the Scenes, nonfiction, picture books, STEM/STEAMTagged Claire Powell, Debra Shumaker, Peculiar Primates, writing for children Post navigation Behind the Scenes: “Composition 101” by Julie Rowan-Zoch Behind the Scenes: “Adding Doorways into Your Story for Broader Appeal” by Lindsey McDivitt 38 thoughts on “Behind the Scenes: “Using Placeholder Words and Stanzas until the Lightbulb Moment” by Debra Shumaker” Joyce Uglow says: December 2, 2022 at 5:53 am So with intention, those dastardly placeholder words can turn into [great, fantastic, wonderful] lovely images. LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 2:32 pm Yes! 🙂 LikeLiked by 1 person Reply Michele Helsel says: December 2, 2022 at 6:14 am I love this insight. I love giving yourself permission to have placeholders and to keep researching. It helps demystify how these wonderful stories in rhyme come to be. Thanks for sharing! LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 2:32 pm Thanks for reading! LikeLiked by 1 person Reply Beth Charles says: December 2, 2022 at 6:24 am Such great advice! And such a charming book. I can’t wait to read it! LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 2:32 pm Thank you! LikeLiked by 1 person Reply Laura Perdew says: December 2, 2022 at 6:55 am I love FREAKY, FUNKY FISH and look forward to reading its new companion! I’m also glad to hear I’m not the only one who uses placeholders as they write – they literally work like detours around writer’s block. LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 2:33 pm Aww, thanks! And yes, “detours around writer’s block” is a great way to describe them! LikeLiked by 1 person Reply mlyablonaolcom says: December 2, 2022 at 7:54 am Love your placeholder ideas and your final solutions! Can’t wait to read your new book. 🙂 LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 2:33 pm Thank you! LikeLiked by 1 person Reply Deborah Amadei says: December 2, 2022 at 9:07 am Hi Debra, I like the methodology you use here. I will keep it in mind. LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 2:34 pm Thank you! LikeLiked by 1 person Reply carolbaldwin says: December 2, 2022 at 10:14 am Great post and I loved hearing about the process. Thanks for sharing Beth and Debra. LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 2:34 pm Thanks for reading! LikeLiked by 1 person Reply Jilanne Hoffmann says: December 2, 2022 at 10:35 am Love how the puzzle pieces all fell in to place…with a bit of research! Congrats! LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 2:34 pm Writing rhyming NF is definitely a puzzle. Thanks for reading! LikeLiked by 2 people Reply danielledufayet says: December 2, 2022 at 11:00 am Great info -thanks for sharing! This book looks wonderful -congrats! LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 2:34 pm Thank you! LikeLiked by 1 person Reply Danielle Hammelef says: December 2, 2022 at 11:27 am This post is so helpful for knowing it’s okay to move on and continue researching and writing while your brain thinks about a solution. Thank you for showing the before and final texts. LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 2:35 pm Yes, definitely move on when you’re stuck. Most often, your brain will find its way. 🙂 LikeLiked by 1 person Reply Donna Gwinnell Lambo-Weidner says: December 2, 2022 at 12:40 pm Wonderful advice! And congratulations 🙂 LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 2:36 pm Thank you! LikeLiked by 1 person Reply Patricia Tilton says: December 2, 2022 at 1:06 pm Kids love primates and this book will win the heart of many. Know my grandson would love this book because he loves animals. Enjoyed learning about Debra’s process and research! And the cover is very lively and inviting. LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 2:37 pm Thank you! LikeLiked by 1 person Reply Lillie_Pardo says: December 2, 2022 at 2:19 pm Debra, I loved Freaky, Funky, Fish. I look forward to reading Peculiar Primates. Thanks for sharing your process. I love your use of alliteration and rhyme to convey facts about primates. Congrats on your latest book. LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 2:37 pm Thank you so much for the compliment on Freaky, Funky Fish! Hope you love this one, too! LikeLiked by 1 person Reply Rebecca says: December 2, 2022 at 3:08 pm Yes, placeholder words are life savers! I enjoyed seeing how you worked these lines out. LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 4:34 pm Glad you enjoyed it! LikeLiked by 1 person Reply cindyargentine says: December 2, 2022 at 3:59 pm Great post, Debra! I love this placeholder concept and how you explained it. Your patience and research led to another fun, rhythmic, interesting, informative book! LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 4:34 pm Thank you! LikeLiked by 1 person Reply Amy Newbold says: December 4, 2022 at 12:05 pm Debra, thanks for the insights into your process. I love that you showed how, with patience and digging deeper, placeholder words can evolve into something better. Can’t wait to read this book! LikeLiked by 1 person Reply Debra Shumaker says: December 13, 2022 at 3:12 pm Thanks Amy! LikeLiked by 1 person Reply Danny Delgado says: December 4, 2022 at 1:34 pm Greetings from Georgia! Came across your post on twitter and I’m glad to have read this reflection. Our school hosts an annual Writing Team for grades 4 – 7 that focuses on narrative writing. We have a children’s author as a “writing coach” who presents writing master classes to our participants. I will definitely file your experience away to bring up to our young authors 😊 LikeLiked by 1 person Reply Debra Shumaker says: December 13, 2022 at 3:13 pm Awesome! Thanks so much! LikeLiked by 1 person Reply Angel says: December 5, 2022 at 4:43 pm Congratulations =) LikeLiked by 1 person Reply Debra Shumaker says: December 13, 2022 at 3:13 pm Thank you! LikeLiked by 1 person Reply Jennifer Merrifield says: December 5, 2022 at 6:16 pm This is the first I have heard of using placeholders words. Love it! I am excited to read the book and share it with my students. LikeLiked by 1 person Reply Debra Shumaker says: December 13, 2022 at 3:13 pm Thank you! I hope your students enjoy the book! LikeLiked by 1 person Reply Leave a comment Cancel reply Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Search for: Follow Blog via Email Enter your email address to follow this blog and receive notifications of new posts by email. Email Address: Follow Join 623 other subscribers Follow Beth Anderson, Children's Writer on WordPress.com Social View beth.anderson.33671748?fref=ts’s profile on Facebook View @BAndersonWriter’s profile on Instagram View bandersonwriter’s profile on Pinterest Categories anthology Behind the Scenes biography board books Cover reveal Especially for Educators fiction historical fiction Middle Grade Mining for Heart my writing journey nonfiction picture books PPBF reading instruction STEM/STEAM Uncategorized Vocabulary writing instruction Recent Posts Especially for Educators: “’Riding a Bike with No Hands:’ Using Sensory Imagery to Infuse Writing With Emotion” by Lisa Rogers Behind the Scenes: “Going Off Script” by Janice Hechter Especially for Educators: “Trading Places: Connecting Story Elements Across Texts and Time” from Beth Anderson and Vivian Kirkfield Behind the Scenes: “Telling Your Story” by Selene Castrovilla Mining for Heart: “Writing Nonfiction with Kid Appeal” by Lydia Lukidis Behind the Scenes: “Emotions Across Eras: Creating Characters That Connect” by Rosanne Tolin Mining for Heart: “The Inspiring Fabric of Community…and Underwear!” by Jonathan Roth Behind the Scenes: “Momentos for Momentum” by Julie Rowan-Zoch Behind the Scenes: “Making Your Book Stand Out in a Crowded Market” by Suzanne Lipshaw Behind the Scenes: “The Importance of Wonder and Play” by Jami Gigot Blog at WordPress.com. Comment Reblog Subscribe Subscribed Beth Anderson, Children's Writer Join 623 other subscribers Sign me up Already have a WordPress.com account? Log in now. Beth Anderson, Children's Writer Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar Loading Comments... Write a Comment... Email (Required) Name (Required) Website %d",
      "title": "Published Time: 2022-12-02T12:32:00+00:00 Behind the Scenes: “Using Placeholder Words and Stanzas until the Lightbulb Moment” by Debra Shumaker – Beth Anderson, Children's Writer Skip to content Beth Anderson, Children's Writer Reader, Writer, Miner of Moments Menu Blog Books About Parent/Teacher Resources Author Visits Behind the Scenes: “Using Placeholder Words and Stanzas until the Lightbulb Moment” by Debra Shumaker Posted on December 2, 2022December 1, 2022 by Beth Anderson I absolutely loved Debra Shumaker’s book, FREAKY, FUNKY FISH, so when I learned of her new one, PECULIAR PRIMATES, I invited Debra back in hopes she might share something about it. Her topic in this post is valuable not only for authors, but educators, too! I get stalled way too easily and frequently on imperfect words or phrases in my early drafts. Debra is also offering a GIVEAWAY—a copy of PECULIAR PRIMATES!! Leave a comment below to enter the drawing. Congratulations to Ashley Sierra, winner of ALL SHEEP ARE NOT BORING! from illustrator Julie Rowan-Zoch! Using Placeholder Words and Stanzas until the Lightbulb Moment by Debra Shumaker I was thrilled when Running Press Kids asked if I was interested in writing about primates as a companion book to FREAKY, FUNKY FISH. Of course I said “Yes!” I knew I wanted this primate book to have the same “feel” as FREAKY, FUNKY FISH: the same meter and rhyme scheme, starting with common features before focusing on the strange and unusual, and the last set of facts having a nighttime scene to give the book some sort of narrative arc before the conclusion. So I dove into research and tackled the opening, taking notes on what primates had in common. I wrote: hair or fur produce milk birth live babies care for their young breathe air warm-blooded no paws but hands and feet many live in trees Playing with the various facts and possible rhyme of air/hair, I wrote: All primates nurse and breathe in air. They have big brains and fur or hair. I was not comfortable with “nurse” but needed a one syllable verb that all primates had in common. That’s all I could come up with. While “nurse” was accurate, to me it was an awkward beginning for a young audience and my critique group thought the same. Imagining the illustration, I envisioned school visits could be a bit uncomfortable, lol. But, I decided to use “nurse” as a placeholder so I could move on to the rest of the story. I hoped that, as I delved deeper into the research, another common feature would become apparent. So I moved on. While researching unique features for the body of the book, I played close attention to options for a nighttime scene. I read that bonobos wove a nest each night, fell asleep on their backs, and held onto a branch with one foot as they slept. Bingo! So I wrote: One weaves itself a nest each night, then goes to sleep by holding tight. It was a nighttime scene, the meter and rhyme worked, but rereading it, I realized I didn’t love it. I typically didn’t use four lines to cover one adaptation. But at least I had something down. It became another placeholder so I could focus on the main part of the book. Hopefully, I would find another primate feature to rhyme with night, but at least I had something. Through versions 2, 3, 4, 5, 6, and 7 those placeholder words and lines bugged me. Every time I sent the story to my critique groups, I always noted “I do not plan on keeping ‘nurse’ and I’m looking for another primate feature to rhyme with night, but what do you think of the rest?” I started to solidify the body by reviewing/confirming my facts so I could write the back matter. As I got closer and closer to feeling “done”, I began to worry I was going to be stuck with those placeholders. They worked, but I didn’t like them. Finally, while rereading my notes, a lightbulb moment—all primates climb! A one-syllable verb! One little word and my opening spread was SO much better. Then, a second lightbulb moment. I reread a line in my notes that stated “Titi monkeys twine their tails together when they sleep.” Hmm, could I use that? Yes! And bonus—nice alliteration to close the story. My new nighttime spread became: Some primates build a nest each night, while others sleep with tails twined tight. I now had a manuscript free of my placeholders. Once I finished the back matter, I sent PECULIAR PRIMATES it off. A few months later I had a contract—and no changes to the text was needed. Success. Don’t forget to leave a comment below for a chance to win a copy of PECULIAR PRIMATES. (Continental US addresses only, please. Winner announced 12/9/22) Share this: Email Facebook Bluesky Threads Pinterest Like Loading... Related Posted in Behind the Scenes, nonfiction, picture books, STEM/STEAMTagged Claire Powell, Debra Shumaker, Peculiar Primates, writing for children Post navigation Behind the Scenes: “Composition 101” by Julie Rowan-Zoch Behind the Scenes: “Adding Doorways into Your Story for Broader Appeal” by Lindsey McDivitt 38 thoughts on “Behind the Scenes: “Using Placeholder Words and Stanzas until the Lightbulb Moment” by Debra Shumaker” Joyce Uglow says: December 2, 2022 at 5:53 am So with intention, those dastardly placeholder words can turn into [great, fantastic, wonderful] lovely images. LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 2:32 pm Yes! 🙂 LikeLiked by 1 person Reply Michele Helsel says: December 2, 2022 at 6:14 am I love this insight. I love giving yourself permission to have placeholders and to keep researching. It helps demystify how these wonderful stories in rhyme come to be. Thanks for sharing! LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 2:32 pm Thanks for reading! LikeLiked by 1 person Reply Beth Charles says: December 2, 2022 at 6:24 am Such great advice! And such a charming book. I can’t wait to read it! LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 2:32 pm Thank you! LikeLiked by 1 person Reply Laura Perdew says: December 2, 2022 at 6:55 am I love FREAKY, FUNKY FISH and look forward to reading its new companion! I’m also glad to hear I’m not the only one who uses placeholders as they write – they literally work like detours around writer’s block. LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 2:33 pm Aww, thanks! And yes, “detours around writer’s block” is a great way to describe them! LikeLiked by 1 person Reply mlyablonaolcom says: December 2, 2022 at 7:54 am Love your placeholder ideas and your final solutions! Can’t wait to read your new book. 🙂 LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 2:33 pm Thank you! LikeLiked by 1 person Reply Deborah Amadei says: December 2, 2022 at 9:07 am Hi Debra, I like the methodology you use here. I will keep it in mind. LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 2:34 pm Thank you! LikeLiked by 1 person Reply carolbaldwin says: December 2, 2022 at 10:14 am Great post and I loved hearing about the process. Thanks for sharing Beth and Debra. LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 2:34 pm Thanks for reading! LikeLiked by 1 person Reply Jilanne Hoffmann says: December 2, 2022 at 10:35 am Love how the puzzle pieces all fell in to place…with a bit of research! Congrats! LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 2:34 pm Writing rhyming NF is definitely a puzzle. Thanks for reading! LikeLiked by 2 people Reply danielledufayet says: December 2, 2022 at 11:00 am Great info -thanks for sharing! This book looks wonderful -congrats! LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 2:34 pm Thank you! LikeLiked by 1 person Reply Danielle Hammelef says: December 2, 2022 at 11:27 am This post is so helpful for knowing it’s okay to move on and continue researching and writing while your brain thinks about a solution. Thank you for showing the before and final texts. LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 2:35 pm Yes, definitely move on when you’re stuck. Most often, your brain will find its way. 🙂 LikeLiked by 1 person Reply Donna Gwinnell Lambo-Weidner says: December 2, 2022 at 12:40 pm Wonderful advice! And congratulations 🙂 LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 2:36 pm Thank you! LikeLiked by 1 person Reply Patricia Tilton says: December 2, 2022 at 1:06 pm Kids love primates and this book will win the heart of many. Know my grandson would love this book because he loves animals. Enjoyed learning about Debra’s process and research! And the cover is very lively and inviting. LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 2:37 pm Thank you! LikeLiked by 1 person Reply Lillie_Pardo says: December 2, 2022 at 2:19 pm Debra, I loved Freaky, Funky, Fish. I look forward to reading Peculiar Primates. Thanks for sharing your process. I love your use of alliteration and rhyme to convey facts about primates. Congrats on your latest book. LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 2:37 pm Thank you so much for the compliment on Freaky, Funky Fish! Hope you love this one, too! LikeLiked by 1 person Reply Rebecca says: December 2, 2022 at 3:08 pm Yes, placeholder words are life savers! I enjoyed seeing how you worked these lines out. LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 4:34 pm Glad you enjoyed it! LikeLiked by 1 person Reply cindyargentine says: December 2, 2022 at 3:59 pm Great post, Debra! I love this placeholder concept and how you explained it. Your patience and research led to another fun, rhythmic, interesting, informative book! LikeLiked by 1 person Reply Debra Shumaker says: December 2, 2022 at 4:34 pm Thank you! LikeLiked by 1 person Reply Amy Newbold says: December 4, 2022 at 12:05 pm Debra, thanks for the insights into your process. I love that you showed how, with patience and digging deeper, placeholder words can evolve into something better. Can’t wait to read this book! LikeLiked by 1 person Reply Debra Shumaker says: December 13, 2022 at 3:12 pm Thanks Amy! LikeLiked by 1 person Reply Danny Delgado says: December 4, 2022 at 1:34 pm Greetings from Georgia! Came across your post on twitter and I’m glad to have read this reflection. Our school hosts an annual Writing Team for grades 4 – 7 that focuses on narrative writing. We have a children’s author as a “writing coach” who presents writing master classes to our participants. I will definitely file your experience away to bring up to our young authors 😊 LikeLiked by 1 person Reply Debra Shumaker says: December 13, 2022 at 3:13 pm Awesome! Thanks so much! LikeLiked by 1 person Reply Angel says: December 5, 2022 at 4:43 pm Congratulations =) LikeLiked by 1 person Reply Debra Shumaker says: December 13, 2022 at 3:13 pm Thank you! LikeLiked by 1 person Reply Jennifer Merrifield says: December 5, 2022 at 6:16 pm This is the first I have heard of using placeholders words. Love it! I am excited to read the book and share it with my students. LikeLiked by 1 person Reply Debra Shumaker says: December 13, 2022 at 3:13 pm Thank you! I hope your students enjoy the book! LikeLiked by 1 person Reply Leave a comment Cancel reply Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Search for: Follow Blog via Email Enter your email address to follow this blog and receive notifications of new posts by email. Email Address: Follow Join 623 other subscribers Follow Beth Anderson, Children's Writer on WordPress.com Social View beth.anderson.33671748?fref=ts’s profile on Facebook View @BAndersonWriter’s profile on Instagram View bandersonwriter’s profile on Pinterest Categories anthology Behind the Scenes biography board books Cover reveal Especially for Educators fiction historical fiction Middle Grade Mining for Heart my writing journey nonfiction picture books PPBF reading instruction STEM/STEAM Uncategorized Vocabulary writing instruction Recent Posts Especially for Educators: “’Riding a Bike with No Hands:’ Using Sensory Imagery to Infuse Writing With Emotion” by Lisa Rogers Behind the Scenes: “Going Off Script” by Janice Hechter Especially for Educators: “Trading Places: Connecting Story Elements Across Texts and Time” from Beth Anderson and Vivian Kirkfield Behind the Scenes: “Telling Your Story” by Selene Castrovilla Mining for Heart: “Writing Nonfiction with Kid Appeal” by Lydia Lukidis Behind the Scenes: “Emotions Across Eras: Creating Characters That Connect” by Rosanne Tolin Mining for Heart: “The Inspiring Fabric of Community…and Underwear!” by Jonathan Roth Behind the Scenes: “Momentos for Momentum” by Julie Rowan-Zoch Behind the Scenes: “Making Your Book Stand Out in a Crowded Market” by Suzanne Lipshaw Behind the Scenes: “The Importance of Wonder and Play” by Jami Gigot Blog at WordPress.com. Comment Reblog Subscribe Subscribed Beth Anderson, Children's Writer Join 623 other subscribers Sign me up Already have a WordPress.com account? Log in now. Beth Anderson, Children's Writer Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar Loading Comments... Write a Comment... Email (Required) Name (Required) Website %d"
    },
    {
      "url": "https://www.researchgate.net/publication/327161657_How_deep_do_we_dig_Formal_explanations_as_placeholders_for_inherent_explanations",
      "content": "To resolve this puzzle, we hypothesized that formal explanations constitute an implicit appeal to a category's inherent features rather than",
      "title": "To resolve this puzzle, we hypothesized that formal explanations constitute an implicit appeal to a category's inherent features rather than"
    },
    {
      "url": "https://soggymusings.wordpress.com/2017/06/05/using-placeholders/",
      "content": "Published Time: 2017-06-05T09:00:50+00:00 Why you should use placeholders – soggy musings Skip to content soggy musings for writers, crafters, cats, and people who like pretty things Menu Home Why, hello! Categories Cats Crafting Annual Challenge WIPs Finished Projects Crochet Knitting Freebies Sticker Kits Writing Resources Seasonal Freebies Health & Lifestyle Stationery Writing Tutorials Writing Tips Writer’s Toolkit £ Shop ♥︎ Ko-fi Contact Writing Why you should use placeholders Posted by Emma on June 5th, 2017October 14th, 2020 Here are some quotes from the first draft of the second book in my Guardians trilogy: Only some of Kaska’s edginess was reflex born of [#that thing you feel when you’re scared]. Kaska’s head jerked up to look in the direction Rastik pointed, a stick of [#liquorice] dangling from between his teeth. I hadn’t explored much beyond the main setting of the previous book, so I was pretty much world-building as I wrote. I was working on NANOWRIMO and using Liquid Story Binder’s typewriter mode, so I didn’t want to stop every couple of sentences to name the stuff I was talking about. Doing so would have distracted me from the story; I didn’t want to risk losing the inspiration because I’d already had to ditch one version of The Spy Master and I didn’t want to have to abandon a second. Kas frowned dubiously at the creatures Rastik had pointed out. They weren’t [#flatrunners] as Rastik had hoped for, but the [#cliff-riders] were good enough climbers that they’d make up for the loss in speed. So, how do you write when the words won’t come? I’m not talking about writer’s block. That’s an entirely different issue and one I don’t feel particularly qualified to help you solve. Instead, I’m talking about specific words: when you’re on a roll and you don’t want to stop because you can’t remember the colour of a character’s hair, or when you just got a super idea for a critter but you don’t have time to think of a name. This you can solve with placeholders. What are placeholders? If you look at the quotes above, you can see where I’ve left suggestive terms in place of what might be made-up words, such as [#liquorice] for what became a stick-like teething treat meant for Ysindhi children. I had a total blank on the word fear so I left [#that thing you feel when you’re scared] in its place. The [#flatrunners] didn’t get a name until I started writing The Gun Runner and decided on the kind of mount they’d use in a forested province. (I originally thought they were going to be a flat, fleet-footed type of lizard, hence the placeholder, but they turned out to be kind of like ostriches instead.) And while I was fairly quick to design the [#cliff-riders], I still kept changing their name because it just didn’t feel right. In the meantime, I still wanted to write about them, so I stuck with the placeholder instead. Placeholders, then, are (somewhat obviously) words you use in place of other words. What are placeholders for? Think of placeholders like bookmarks. However, where a reader might use a bookmark to remember the page they were on before they had to go feed the cat, writers use them to highlight a spot in their draft that they need to go back and fix. I mostly use placeholders for proper nouns where I haven’t yet developed the concept I’m writing about enough to give it a name. I also frequently fall back on them when I can’t remember the appropriate word for the meaning I’m trying to convey, and so I don’t have to check back on descriptions. (Typing [#blue eyes] is way faster than opening a file to look up that particular character and be reminded their eyes are actually green.) In other words, placeholders are a nifty little time-saver for when you’re writing your first draft and just trying to get words on the page. They let you skip past any blank spots and keep writing, instead of getting bogged down in world-building or a dictionary, because you know you’ll fix them later. How do you use placeholders? I once sent a draft to my beta reader, forgetting to strip all my line notes from the manuscript. That’s not quite the same as leaving placeholders behind, but the effect is similar: a manuscript that’s not fit for public consumption. As helpful as placeholders are, they can be a pain to find again during revision if you don’t make them obvious and easily searchable. Dave Johnson at CBS News suggests using Microsoft Word’s auto correct function to highlight your placeholders, but this only works if you: A) use Microsoft Word, and B) use the same placeholder in every instance (such as the “TK” he mentions). So what if you don’t use Word? And what if you need a dynamic placeholder instead? #Hashtags are for more than just Twitter I used a simple number sign # for the longest time. My handwritten drafts were dotted with “and he said #blah” and “she had #blue eyes”. The problem with the hashtag is that it blends in too well with other text and can be easily misread as a typo. Some writers also use a triple hashtag ### to indicate chapter breaks, which makes it even more difficult to see them in prose. Side note: You could use a different symbol, such as the @ sign. (It’s still fairly invisible when you’re proofreading, though.) You could even devise a multi-faceted system where # is for words you forgot, @ is for description details you need to look up, and so on. (Just remember not to use common punctuation symbols or you’ll be working around a question mark that’s not actually a placeholder!) Use brackets too A while back, I read that someone used square brackets [ ] to surround their placeholder words. (I can’t seem to find it again, so it was probably on the NANOWRIMO forums at some point.) Brackets can blend just as easily, but it gave me the idea to combine her technique with my own. My placeholders now are enclosed in square brackets [ ], but also have the # hashtag to help them stand out more, [#like this]. Don’t get distracted Use placeholders if you’re writing along and suddenly can’t think what the next word should be. Don’t get bogged down or distracted looking something up. Just ignore that brain blip with a [#placeholder] and go back later to fix it. Finding them again Once you’re done with your draft and you’re ready to edit, you can go back and deal with all those [#placeholders]. Just hit CTRL+F (or F7 in Liquid Story Binder) to bring up your find + replace function. Type in your placeholder symbol (e.g. #) and work your way through the results. If you have a multi-faceted system, you can go through your placeholders in stages. I’d suggest fixing all the words you know are wrong first, because they’re the easiest to solve and getting rid of dictionary errors will reduce the amount of symbols in your draft. You could also use Dave Johnson’s trick if your software allows automatic formatting like Microsoft Word’s. (Just highlight the brackets and/or symbols instead of “TK”.) This will make it much easier to spot your placeholders when you’re proofreading. What’s the benefit? The biggest benefit of using placeholders is that you get to write, and keep writing, without having to stop every few words or sentences to come up with a name or description or idea. You don’t have to stop and Google “word that means ‘easily duped'”. You don’t have to stop and spend an hour or a day or a week designing the creature your character just mounted. You don’t have to open a file on your current setting and scour the information to find that tiny little detail about the colour of the lamps. You can just stick in a [#placeholder] and keep going. This means that you can get the bulk of the story down and then worry about the details later. That is a humongous benefit. Other benefits There are other benefits, too. I change names often because they just don’t feel right — which means going back and scouring for every instance of that name and its many alternatives, versions, and derivatives because the find + replace tool won’t account for every change of spelling. Using a placeholder, especially for uncertain pronouns, can save a lot of effort later. (It also means that you don’t get trapped in a name that isn’t working for you, which gives you the freedom to write now and find the perfect pronoun later.) Like this article? Pin it! Do you [#hold your place*]? I’m not the only writer who uses placeholders, but up until I saw that post on NANOWRIMO (or wherever it was) about the brackets, I thought I was. Who else uses them? How do you use them? Do you borrow from the non-fic writer’s system (such as TK for “to come” like Dave Johnson) or is your system more dynamic like mine? How do you ensure that you won’t miss your placeholders when it’s time to proofread or find them again? Does your word processor of choice have a nifty system already in place (like Word’s formatting auto-correct), or do you have to keep it simple? Share this: Click to share on Facebook (Opens in new window) Click to share on Twitter (Opens in new window) Click to share on Pinterest (Opens in new window) Click to share on Reddit (Opens in new window) More Click to share on Pocket (Opens in new window) Click to share on Tumblr (Opens in new window) Click to share on LinkedIn (Opens in new window) Click to share on Telegram (Opens in new window) Click to share on WhatsApp (Opens in new window) Click to email a link to a friend (Opens in new window) Click to print (Opens in new window) Like Loading... Related Liquid Story BinderSoftwareWritingWriting AdviceWriting Tips Post navigation Previous Post Happy Planner NaNoWriMo Free Printable Next Post 9 more ways to keep your cat cool in summer 7 Comments Add yours cassandraec12 says: September 18th, 2017 at 3:12 pm Yes! I’ve used placeholders before, mostly for names, but this article gives me encouragement that I could do ignore a lot more. I do tend to drop everything and research things online, etc and get wayyy off track! Great idea! LikeLiked by 1 person Reply Emma says: September 19th, 2017 at 9:44 am I was the same before I discovered placeholders. It’s very easy to get caught up in “inventing”! I’m glad this post helped you out, Cassandra. 🙂 LikeLike Reply Jennifer Hungerford says: October 25th, 2017 at 12:43 am Great post, thanks for the ideas! I usually just use a series of five Xs. Using your examples from above, it would look like this: “Only some of Kaska’s edginess was reflex born of XXXXX.” “Kaska’s head jerked up to look in the direction Rastik pointed, a stick of XXXXX dangling from between his teeth.” It’s easy enough to find later with a search function, and unlikely to get looked over when proofreading. Sometimes I change the font color to red for a sentence that I know is awkward or needs research. This has always worked well for me, but I do like the idea of putting a note in the text so there are no doubts what I had in mind when I go back to edit. I haven’t tried to write anything over about 10,000 words, so it may well be that my system is too simple for a novel-length work. LikeLiked by 1 person Reply Emma says: October 25th, 2017 at 8:42 am Thanks, Jennifer! I love your XXXXX placeholders. I think they’d be great as a replacement for Dave Johnson’s “TK” because you’re far more likely to see a bunch of Xs (which don’t appear often in prose like the rest of the alphabet). I might take to using that for placeholders that don’t need notes. 🙂 But yeah, the way my mind works, I have to remind myself what I was thinking at the time of writing, so the notes system works best for me. I’ve moved to Scrivener recently though so I might just use annotations/footnotes/comments instead. 🤔 Thanks for commenting! 😀 LikeLike Reply Karla says: March 17th, 2018 at 12:16 pm I use brackets when I have not decided which word to use, frequently using two or more sets, i.e. [cat] [kitten]. If I rewrite some line or passage but am uncertain which I will ultimately use, I leave both, separated by [or], which I format as a note, in red. I use curly brackets for “to-do”-type notes, such as things to research, things to fit into previously written passages, etc., again in red. This not only stands out visually, but it also makes searching easy. I don’t find a need for the # sign, since I can just search for “[” or “{“. LikeLiked by 1 person Reply Emma says: March 30th, 2018 at 12:47 pm That sounds like a great plan. Do you write by hand or digitally? I’m not sure I’d have the patience to change font colours lol but swapping pens sounds kinda fun… Maybe that’s just the stationery addict in me xD LikeLike Reply Pingback: Placeholders: An Introduction - ScrivenerVirgin I'd love to know what you think! Cancel reply Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Search for: Cats Crafting Freebies Health & Lifestyle Stationery Writing Calendar Cats Characters Classic Happy Planner Craft Challenge Crafting Crochet Crochet Projects ECLP Embroidery Erin Condren Life Planner Etsy Etsy Seller Etsy Shop Etsy Shop Updates Finished Projects Freebies Halloween Handmade Jewelry Happy Planner Health & Lifestyle Highlights Knitting Knitting Projects MAMBI Happy Planner Mollie Makes NANOWRIMO Planner Kits Planner Stickers Plotting Printable Planner Kit Printables Printable Stickers Reviews Software Sticker Kits Story Bible Wallpaper WIPs Worldbuilding Writer's Toolkit Writing Writing Advice Writing Spaces Writing Tips Instagram Pinterest Etsy WordPress Twitter Facebook Subscribe Enter your email address to follow this blog and receive notifications of new posts by email. Email Address: Subscribe! Join 227 other subscribers Follow soggy musings on WordPress.com @soggymuse Etsy Pinterest Twitter Facebook Reddit RSS feed @kitkat.the.first Comment Reblog Subscribe Subscribed soggy musings Join 51 other subscribers Sign me up Already have a WordPress.com account? Log in now. soggy musings Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar Loading Comments... Write a Comment... Email Name Website %d",
      "title": "Published Time: 2017-06-05T09:00:50+00:00 Why you should use placeholders – soggy musings Skip to content soggy musings for writers, crafters, cats, and people who like pretty things Menu Home Why, hello! Categories Cats Crafting Annual Challenge WIPs Finished Projects Crochet Knitting Freebies Sticker Kits Writing Resources Seasonal Freebies Health & Lifestyle Stationery Writing Tutorials Writing Tips Writer’s Toolkit £ Shop ♥︎ Ko-fi Contact Writing Why you should use placeholders Posted by Emma on June 5th, 2017October 14th, 2020 Here are some quotes from the first draft of the second book in my Guardians trilogy: Only some of Kaska’s edginess was reflex born of [#that thing you feel when you’re scared]. Kaska’s head jerked up to look in the direction Rastik pointed, a stick of [#liquorice] dangling from between his teeth. I hadn’t explored much beyond the main setting of the previous book, so I was pretty much world-building as I wrote. I was working on NANOWRIMO and using Liquid Story Binder’s typewriter mode, so I didn’t want to stop every couple of sentences to name the stuff I was talking about. Doing so would have distracted me from the story; I didn’t want to risk losing the inspiration because I’d already had to ditch one version of The Spy Master and I didn’t want to have to abandon a second. Kas frowned dubiously at the creatures Rastik had pointed out. They weren’t [#flatrunners] as Rastik had hoped for, but the [#cliff-riders] were good enough climbers that they’d make up for the loss in speed. So, how do you write when the words won’t come? I’m not talking about writer’s block. That’s an entirely different issue and one I don’t feel particularly qualified to help you solve. Instead, I’m talking about specific words: when you’re on a roll and you don’t want to stop because you can’t remember the colour of a character’s hair, or when you just got a super idea for a critter but you don’t have time to think of a name. This you can solve with placeholders. What are placeholders? If you look at the quotes above, you can see where I’ve left suggestive terms in place of what might be made-up words, such as [#liquorice] for what became a stick-like teething treat meant for Ysindhi children. I had a total blank on the word fear so I left [#that thing you feel when you’re scared] in its place. The [#flatrunners] didn’t get a name until I started writing The Gun Runner and decided on the kind of mount they’d use in a forested province. (I originally thought they were going to be a flat, fleet-footed type of lizard, hence the placeholder, but they turned out to be kind of like ostriches instead.) And while I was fairly quick to design the [#cliff-riders], I still kept changing their name because it just didn’t feel right. In the meantime, I still wanted to write about them, so I stuck with the placeholder instead. Placeholders, then, are (somewhat obviously) words you use in place of other words. What are placeholders for? Think of placeholders like bookmarks. However, where a reader might use a bookmark to remember the page they were on before they had to go feed the cat, writers use them to highlight a spot in their draft that they need to go back and fix. I mostly use placeholders for proper nouns where I haven’t yet developed the concept I’m writing about enough to give it a name. I also frequently fall back on them when I can’t remember the appropriate word for the meaning I’m trying to convey, and so I don’t have to check back on descriptions. (Typing [#blue eyes] is way faster than opening a file to look up that particular character and be reminded their eyes are actually green.) In other words, placeholders are a nifty little time-saver for when you’re writing your first draft and just trying to get words on the page. They let you skip past any blank spots and keep writing, instead of getting bogged down in world-building or a dictionary, because you know you’ll fix them later. How do you use placeholders? I once sent a draft to my beta reader, forgetting to strip all my line notes from the manuscript. That’s not quite the same as leaving placeholders behind, but the effect is similar: a manuscript that’s not fit for public consumption. As helpful as placeholders are, they can be a pain to find again during revision if you don’t make them obvious and easily searchable. Dave Johnson at CBS News suggests using Microsoft Word’s auto correct function to highlight your placeholders, but this only works if you: A) use Microsoft Word, and B) use the same placeholder in every instance (such as the “TK” he mentions). So what if you don’t use Word? And what if you need a dynamic placeholder instead? #Hashtags are for more than just Twitter I used a simple number sign # for the longest time. My handwritten drafts were dotted with “and he said #blah” and “she had #blue eyes”. The problem with the hashtag is that it blends in too well with other text and can be easily misread as a typo. Some writers also use a triple hashtag ### to indicate chapter breaks, which makes it even more difficult to see them in prose. Side note: You could use a different symbol, such as the @ sign. (It’s still fairly invisible when you’re proofreading, though.) You could even devise a multi-faceted system where # is for words you forgot, @ is for description details you need to look up, and so on. (Just remember not to use common punctuation symbols or you’ll be working around a question mark that’s not actually a placeholder!) Use brackets too A while back, I read that someone used square brackets [ ] to surround their placeholder words. (I can’t seem to find it again, so it was probably on the NANOWRIMO forums at some point.) Brackets can blend just as easily, but it gave me the idea to combine her technique with my own. My placeholders now are enclosed in square brackets [ ], but also have the # hashtag to help them stand out more, [#like this]. Don’t get distracted Use placeholders if you’re writing along and suddenly can’t think what the next word should be. Don’t get bogged down or distracted looking something up. Just ignore that brain blip with a [#placeholder] and go back later to fix it. Finding them again Once you’re done with your draft and you’re ready to edit, you can go back and deal with all those [#placeholders]. Just hit CTRL+F (or F7 in Liquid Story Binder) to bring up your find + replace function. Type in your placeholder symbol (e.g. #) and work your way through the results. If you have a multi-faceted system, you can go through your placeholders in stages. I’d suggest fixing all the words you know are wrong first, because they’re the easiest to solve and getting rid of dictionary errors will reduce the amount of symbols in your draft. You could also use Dave Johnson’s trick if your software allows automatic formatting like Microsoft Word’s. (Just highlight the brackets and/or symbols instead of “TK”.) This will make it much easier to spot your placeholders when you’re proofreading. What’s the benefit? The biggest benefit of using placeholders is that you get to write, and keep writing, without having to stop every few words or sentences to come up with a name or description or idea. You don’t have to stop and Google “word that means ‘easily duped'”. You don’t have to stop and spend an hour or a day or a week designing the creature your character just mounted. You don’t have to open a file on your current setting and scour the information to find that tiny little detail about the colour of the lamps. You can just stick in a [#placeholder] and keep going. This means that you can get the bulk of the story down and then worry about the details later. That is a humongous benefit. Other benefits There are other benefits, too. I change names often because they just don’t feel right — which means going back and scouring for every instance of that name and its many alternatives, versions, and derivatives because the find + replace tool won’t account for every change of spelling. Using a placeholder, especially for uncertain pronouns, can save a lot of effort later. (It also means that you don’t get trapped in a name that isn’t working for you, which gives you the freedom to write now and find the perfect pronoun later.) Like this article? Pin it! Do you [#hold your place*]? I’m not the only writer who uses placeholders, but up until I saw that post on NANOWRIMO (or wherever it was) about the brackets, I thought I was. Who else uses them? How do you use them? Do you borrow from the non-fic writer’s system (such as TK for “to come” like Dave Johnson) or is your system more dynamic like mine? How do you ensure that you won’t miss your placeholders when it’s time to proofread or find them again? Does your word processor of choice have a nifty system already in place (like Word’s formatting auto-correct), or do you have to keep it simple? Share this: Click to share on Facebook (Opens in new window) Click to share on Twitter (Opens in new window) Click to share on Pinterest (Opens in new window) Click to share on Reddit (Opens in new window) More Click to share on Pocket (Opens in new window) Click to share on Tumblr (Opens in new window) Click to share on LinkedIn (Opens in new window) Click to share on Telegram (Opens in new window) Click to share on WhatsApp (Opens in new window) Click to email a link to a friend (Opens in new window) Click to print (Opens in new window) Like Loading... Related Liquid Story BinderSoftwareWritingWriting AdviceWriting Tips Post navigation Previous Post Happy Planner NaNoWriMo Free Printable Next Post 9 more ways to keep your cat cool in summer 7 Comments Add yours cassandraec12 says: September 18th, 2017 at 3:12 pm Yes! I’ve used placeholders before, mostly for names, but this article gives me encouragement that I could do ignore a lot more. I do tend to drop everything and research things online, etc and get wayyy off track! Great idea! LikeLiked by 1 person Reply Emma says: September 19th, 2017 at 9:44 am I was the same before I discovered placeholders. It’s very easy to get caught up in “inventing”! I’m glad this post helped you out, Cassandra. 🙂 LikeLike Reply Jennifer Hungerford says: October 25th, 2017 at 12:43 am Great post, thanks for the ideas! I usually just use a series of five Xs. Using your examples from above, it would look like this: “Only some of Kaska’s edginess was reflex born of XXXXX.” “Kaska’s head jerked up to look in the direction Rastik pointed, a stick of XXXXX dangling from between his teeth.” It’s easy enough to find later with a search function, and unlikely to get looked over when proofreading. Sometimes I change the font color to red for a sentence that I know is awkward or needs research. This has always worked well for me, but I do like the idea of putting a note in the text so there are no doubts what I had in mind when I go back to edit. I haven’t tried to write anything over about 10,000 words, so it may well be that my system is too simple for a novel-length work. LikeLiked by 1 person Reply Emma says: October 25th, 2017 at 8:42 am Thanks, Jennifer! I love your XXXXX placeholders. I think they’d be great as a replacement for Dave Johnson’s “TK” because you’re far more likely to see a bunch of Xs (which don’t appear often in prose like the rest of the alphabet). I might take to using that for placeholders that don’t need notes. 🙂 But yeah, the way my mind works, I have to remind myself what I was thinking at the time of writing, so the notes system works best for me. I’ve moved to Scrivener recently though so I might just use annotations/footnotes/comments instead. 🤔 Thanks for commenting! 😀 LikeLike Reply Karla says: March 17th, 2018 at 12:16 pm I use brackets when I have not decided which word to use, frequently using two or more sets, i.e. [cat] [kitten]. If I rewrite some line or passage but am uncertain which I will ultimately use, I leave both, separated by [or], which I format as a note, in red. I use curly brackets for “to-do”-type notes, such as things to research, things to fit into previously written passages, etc., again in red. This not only stands out visually, but it also makes searching easy. I don’t find a need for the # sign, since I can just search for “[” or “{“. LikeLiked by 1 person Reply Emma says: March 30th, 2018 at 12:47 pm That sounds like a great plan. Do you write by hand or digitally? I’m not sure I’d have the patience to change font colours lol but swapping pens sounds kinda fun… Maybe that’s just the stationery addict in me xD LikeLike Reply Pingback: Placeholders: An Introduction - ScrivenerVirgin I'd love to know what you think! Cancel reply Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Search for: Cats Crafting Freebies Health & Lifestyle Stationery Writing Calendar Cats Characters Classic Happy Planner Craft Challenge Crafting Crochet Crochet Projects ECLP Embroidery Erin Condren Life Planner Etsy Etsy Seller Etsy Shop Etsy Shop Updates Finished Projects Freebies Halloween Handmade Jewelry Happy Planner Health & Lifestyle Highlights Knitting Knitting Projects MAMBI Happy Planner Mollie Makes NANOWRIMO Planner Kits Planner Stickers Plotting Printable Planner Kit Printables Printable Stickers Reviews Software Sticker Kits Story Bible Wallpaper WIPs Worldbuilding Writer's Toolkit Writing Writing Advice Writing Spaces Writing Tips Instagram Pinterest Etsy WordPress Twitter Facebook Subscribe Enter your email address to follow this blog and receive notifications of new posts by email. Email Address: Subscribe! Join 227 other subscribers Follow soggy musings on WordPress.com @soggymuse Etsy Pinterest Twitter Facebook Reddit RSS feed @kitkat.the.first Comment Reblog Subscribe Subscribed soggy musings Join 51 other subscribers Sign me up Already have a WordPress.com account? Log in now. soggy musings Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar Loading Comments... Write a Comment... Email Name Website %d"
    },
    {
      "url": "https://meta.discourse.org/t/hide-the-topic-template-placeholder-text/279380",
      "content": "Published Time: 2023-09-18T12:19:29+00:00 Hide the Topic template placeholder text - Support - Discourse Meta Skip to main content Sign Up Log In ​* Tech Advocate Assigns * Team Inbox * ​ Topics More Categories Documentation Community wiki Announcements Support Bug UX Feature Data & reporting Community Plugin Theme Theme component Community Support Program All categories Tags official release-notes All tags Meta Branded ​ Discourse is growing! 🎉 We are currently hiring a Full Stack Engineer, Migrations Engineer and Technical Advocate. Check out our job listings ​ Hide the Topic template placeholder text Support You have selected 0 posts. select all cancel selecting 389 views 10 likes 3 Summarize Sep 2023 1 / 6 Sep 2023 Sep 2023 Danny Dainton 1 Sep 2023 Hey folks, I have several topics on my fourm and I’m using the Template section on the Edit Category feature to provide more context and helpful pointers etc. image790×1064 59.7 KB Much the same as you have here for this one. image3092×566 46.7 KB What I’m finding, far too often, are users posting new topics with the whole template text included, instead of removing it before adding their content. I can add another line to say “Delete this block before posting” but I honestly think that they would post that too Is there a method, process, plugin that can provide me with the same section to add a Template but then disappears, as the user starts to type? To prevent seeing my own template all the time This was the closest topic that I found which related to my issue but I wasn’t sure what/where the solved response was referring too. How to hide the content of About Topics template? support [Topics%20-%20About%20content] How do you hide the generic contents of the About Topics template? or is it possible to hide the topic instead? ​ ​ 389 views 10 likes 3 Summarize Ethannot-ethanSupport Enthusiast Sep 2023 You can use the custom wizard plugin made by Pabilion Custom Wizard Plugin plugin It is now much easier to subscribe for the advanced features Now all you have to do is hit ‘Subscribe’ from the admin page of the installed Custom Wizard Plugin and follow the prompts, and Authorize it once it is set up. Easy as! Of course, the basic (still quite powerful) Wizard functionality works just fine without a subscription. Summary Forms for Discourse. This plugin lets you make rich and powerful forms for your Discourse forum. Better user onboard… ​ ​ Danny Dainton Sep 2023 Without digging deeping into that plugin, would that offer that same “disappearing template placeholder” feature? Have you used this before? 1 Reply ​ ​ Moin Sep 2023 Maybe having the template text as a html comment works for you. Something like this Invisible: In code tags: heart eyes 4 ​ ​ JammyDodger Danny Dainton Sep 2023 Hello and welcome @Danny_Dainton We add the ‘Before asking…’ snippet to our blocked Watched Words to encourage people to remove it before posting, which can work if it’s something small. We also use the style ones Moin suggests in our plugin topics too, which has worked pretty well. We also have a new ‘Topic Templates V2’ coming out soon, which may be able to help with this as well. It allows ‘form templates’ to be created, that also validate data before allowing a topic to be created. This may cut down the need on providing ‘text as structure’ from the outset. 4 ​ ​ Danny Dainton Sep 2023 Thank you so much for the welcome and the information!! I’ll give @Moin’s suggestion a go, it sounds like the kind of thing I was looking for but I’m very interested in the V2 feature - sounds awesome! 3 ​ ​ Reply Related topics Topic list, column headers with buttons are sortable. | Topic | Replies | Views | Activity | | --- | --- | --- | --- | | Have users complete form when creating a topic? Feature completed | 11 | 2.0k | Sep 2022 | | How to hide the content of About Topics template? Support | 3 | 498 | Jul 2019 | | New Topic template form, like GitHub Issue templates? Support | 5 | 1.3k | Oct 2023 | | Hide ignored users’ topics Theme component | 12 | 1.3k | 21d | | Topic Templates Feature | 35 | 14.8k | Aug 2015 | Powered by Discourse Invalid date Invalid date",
      "title": "Published Time: 2023-09-18T12:19:29+00:00 Hide the Topic template placeholder text - Support - Discourse Meta Skip to main content Sign Up Log In ​* Tech Advocate Assigns * Team Inbox * ​ Topics More Categories Documentation Community wiki Announcements Support Bug UX Feature Data & reporting Community Plugin Theme Theme component Community Support Program All categories Tags official release-notes All tags Meta Branded ​ Discourse is growing! 🎉 We are currently hiring a Full Stack Engineer, Migrations Engineer and Technical Advocate. Check out our job listings ​ Hide the Topic template placeholder text Support You have selected 0 posts. select all cancel selecting 389 views 10 likes 3 Summarize Sep 2023 1 / 6 Sep 2023 Sep 2023 Danny Dainton 1 Sep 2023 Hey folks, I have several topics on my fourm and I’m using the Template section on the Edit Category feature to provide more context and helpful pointers etc. image790×1064 59.7 KB Much the same as you have here for this one. image3092×566 46.7 KB What I’m finding, far too often, are users posting new topics with the whole template text included, instead of removing it before adding their content. I can add another line to say “Delete this block before posting” but I honestly think that they would post that too Is there a method, process, plugin that can provide me with the same section to add a Template but then disappears, as the user starts to type? To prevent seeing my own template all the time This was the closest topic that I found which related to my issue but I wasn’t sure what/where the solved response was referring too. How to hide the content of About Topics template? support [Topics%20-%20About%20content] How do you hide the generic contents of the About Topics template? or is it possible to hide the topic instead? ​ ​ 389 views 10 likes 3 Summarize Ethannot-ethanSupport Enthusiast Sep 2023 You can use the custom wizard plugin made by Pabilion Custom Wizard Plugin plugin It is now much easier to subscribe for the advanced features Now all you have to do is hit ‘Subscribe’ from the admin page of the installed Custom Wizard Plugin and follow the prompts, and Authorize it once it is set up. Easy as! Of course, the basic (still quite powerful) Wizard functionality works just fine without a subscription. Summary Forms for Discourse. This plugin lets you make rich and powerful forms for your Discourse forum. Better user onboard… ​ ​ Danny Dainton Sep 2023 Without digging deeping into that plugin, would that offer that same “disappearing template placeholder” feature? Have you used this before? 1 Reply ​ ​ Moin Sep 2023 Maybe having the template text as a html comment works for you. Something like this Invisible: In code tags: heart eyes 4 ​ ​ JammyDodger Danny Dainton Sep 2023 Hello and welcome @Danny_Dainton We add the ‘Before asking…’ snippet to our blocked Watched Words to encourage people to remove it before posting, which can work if it’s something small. We also use the style ones Moin suggests in our plugin topics too, which has worked pretty well. We also have a new ‘Topic Templates V2’ coming out soon, which may be able to help with this as well. It allows ‘form templates’ to be created, that also validate data before allowing a topic to be created. This may cut down the need on providing ‘text as structure’ from the outset. 4 ​ ​ Danny Dainton Sep 2023 Thank you so much for the welcome and the information!! I’ll give @Moin’s suggestion a go, it sounds like the kind of thing I was looking for but I’m very interested in the V2 feature - sounds awesome! 3 ​ ​ Reply Related topics Topic list, column headers with buttons are sortable. | Topic | Replies | Views | Activity | | --- | --- | --- | --- | | Have users complete form when creating a topic? Feature completed | 11 | 2.0k | Sep 2022 | | How to hide the content of About Topics template? Support | 3 | 498 | Jul 2019 | | New Topic template form, like GitHub Issue templates? Support | 5 | 1.3k | Oct 2023 | | Hide ignored users’ topics Theme component | 12 | 1.3k | 21d | | Topic Templates Feature | 35 | 14.8k | Aug 2015 | Powered by Discourse Invalid date Invalid date"
    },
    {
      "url": "https://www.cui.edu/studentlife/writing-studio/voice-paint-blog/post/placeholder-title-change-later-the-importance-of-placeholders-in-essay-writing",
      "content": "[Placeholder Title] - Change Later: The Importance of Placeholders in Essay Writing Skip to Main Content Search Toggle navigation Concordia University Irvine Academics Overview Undergraduate Graduate Online Nursing Admissions Overview Undergraduate Graduate Nursing International Transfer Veterans About Athletics Student Life The Arts Giving MyCUI MyCUI Canvas MyRecords Eagles Email Faculty/Staff Email Writing Studio About Mission Statement AI Use in the Writing Studio The Backstory Annual Report What Others Say About Us Location & Hours Job Application Make an Appointment Meet the Staff FAQ's Online Writing Lab (OWL) FAQ's On-Site Writing Studio FAQ's Workshops Resources Students Grammarly Support for Graduate Students Faculty Classroom Support Teaching Resources Writers Resources for Writing Consultants Resources for Writers Community Blog Writing Groups Creative Collective Writing Group Graduate Writing Group Summer Book Club [Placeholder Title] - Change Later: The Importance of Placeholders in Essay Writing October 10, 2022 - 2 minute read The first words of an essay can be torture to write. With no clear idea as to the direction of the paper, a frustrated writer will struggle, either writing a short, vague introduction or a long, rambling one. Neither of these outcomes is desirable. An introduction needs to be robust, both an engaging hook to get the audience invested as well as a successful preview of the essay's main points and thesis. However, it is often difficult to write a successful introduction until you know exactly what your body paragraphs will cover. This problem may be frustrating for those who write linearly (that is, straight from beginning to end). Breaking the habit of writing linearly may be the first step in writing a better paper. A natural way to accomplish this is to use placeholders. Placeholders help writers change up the order in which they compose their essays. For many writers, there is something profoundly unsettling about writing paragraphs out of order. Writing linearly is a habit that can be difficult to break. Plugging in a placeholder helps satisfy this need to fill the essay in \"top-down\" without the disadvantages of starting with the introduction. A placeholder for an introduction paragraph can be as simple as [introduction here] or as complex as an outline. Both these strategies have advantages and can be employed in different ways for different results. Using a bracketed [intro here] placeholder is immensely useful for getting ideas down on paper as quickly as possible. This strategy does not give the introduction or title a second thought, but rather skims over them so you can jump headfirst into writing the body paragraphs. Some writers may find this technique appealing just on the face of it, but it also has utility in specific circumstances. When a writer is fresh off their research, it can be useful to “strike while the iron is hot” and formulate thoughts around the primary sources. On the other hand, a short outline can make for an excellent placeholder. Instead of beginning with typing the full paper, a writer can start by constructing a few lines that describe each part of the paper and what each part will be about. This can help generate ideas about the focus of the essay and what pieces of information it will cover. The outline of the introduction paragraph might even contain a rudimentary thesis to guide the flow of thoughts. Keeping it in outline form, however, frees the writer from having committed to anything concrete and allows the essay to adapt as the body paragraphs are filled in. Using placeholders can help break bad habits and introduce a new rhythm to writing. It is a valuable tool, but it is ultimately just space, a bit of room for your ideas to breathe before being filled in with carefully chosen, effective sentences. *** Nathan Estrick is a history and political thought major with a theology minor. He is a senior working toward an education credential. As someone involved with the forensics debate team at Concordia, he loves working on argumentative essays and sharpening their format and content. However, he is also quite comfortable with research essays, especially those written in Chicago and MLA style. He also enjoys reviewing poetry and short stories! Facebook Twitter Email) Join Our Community Apply Now Visit Concordia Request Info Virtual Tour Contact Us Concordia University Irvine Footer Connect University Events Resources Campus Map Employment MyCUI Parents Pay Tuition Online Press Room Sitemap Veterans Resource Center Services Academic Advising Bursar's Office Campus Safety Financial Aid at Concordia University Irvine Library Brand and Marketing Resources Registrar University Services Concordia University Irvine is a private, Christian university that is ranked nationally among the \"Top Performers on Social Mobility\" universities by U.S. News & World Report. Concordia is accredited by WASC Senior College and University Commission (WSCUC) and serves over 5,000 students annually. Concordia University Irvine 1530 Concordia West Irvine, CA, USA 92612 (949) 854-8002 info@cui.edu © 1998-2025 Concordia University Irvine | Privacy Statement | Terms of Use | Accessibility Back to top",
      "title": "[Placeholder Title] - Change Later: The Importance of Placeholders in Essay Writing Skip to Main Content Search Toggle navigation Concordia University Irvine Academics Overview Undergraduate Graduate Online Nursing Admissions Overview Undergraduate Graduate Nursing International Transfer Veterans About Athletics Student Life The Arts Giving MyCUI MyCUI Canvas MyRecords Eagles Email Faculty/Staff Email Writing Studio About Mission Statement AI Use in the Writing Studio The Backstory Annual Report What Others Say About Us Location & Hours Job Application Make an Appointment Meet the Staff FAQ's Online Writing Lab (OWL) FAQ's On-Site Writing Studio FAQ's Workshops Resources Students Grammarly Support for Graduate Students Faculty Classroom Support Teaching Resources Writers Resources for Writing Consultants Resources for Writers Community Blog Writing Groups Creative Collective Writing Group Graduate Writing Group Summer Book Club [Placeholder Title] - Change Later: The Importance of Placeholders in Essay Writing October 10, 2022 - 2 minute read The first words of an essay can be torture to write. With no clear idea as to the direction of the paper, a frustrated writer will struggle, either writing a short, vague introduction or a long, rambling one. Neither of these outcomes is desirable. An introduction needs to be robust, both an engaging hook to get the audience invested as well as a successful preview of the essay's main points and thesis. However, it is often difficult to write a successful introduction until you know exactly what your body paragraphs will cover. This problem may be frustrating for those who write linearly (that is, straight from beginning to end). Breaking the habit of writing linearly may be the first step in writing a better paper. A natural way to accomplish this is to use placeholders. Placeholders help writers change up the order in which they compose their essays. For many writers, there is something profoundly unsettling about writing paragraphs out of order. Writing linearly is a habit that can be difficult to break. Plugging in a placeholder helps satisfy this need to fill the essay in \"top-down\" without the disadvantages of starting with the introduction. A placeholder for an introduction paragraph can be as simple as [introduction here] or as complex as an outline. Both these strategies have advantages and can be employed in different ways for different results. Using a bracketed [intro here] placeholder is immensely useful for getting ideas down on paper as quickly as possible. This strategy does not give the introduction or title a second thought, but rather skims over them so you can jump headfirst into writing the body paragraphs. Some writers may find this technique appealing just on the face of it, but it also has utility in specific circumstances. When a writer is fresh off their research, it can be useful to “strike while the iron is hot” and formulate thoughts around the primary sources. On the other hand, a short outline can make for an excellent placeholder. Instead of beginning with typing the full paper, a writer can start by constructing a few lines that describe each part of the paper and what each part will be about. This can help generate ideas about the focus of the essay and what pieces of information it will cover. The outline of the introduction paragraph might even contain a rudimentary thesis to guide the flow of thoughts. Keeping it in outline form, however, frees the writer from having committed to anything concrete and allows the essay to adapt as the body paragraphs are filled in. Using placeholders can help break bad habits and introduce a new rhythm to writing. It is a valuable tool, but it is ultimately just space, a bit of room for your ideas to breathe before being filled in with carefully chosen, effective sentences. *** Nathan Estrick is a history and political thought major with a theology minor. He is a senior working toward an education credential. As someone involved with the forensics debate team at Concordia, he loves working on argumentative essays and sharpening their format and content. However, he is also quite comfortable with research essays, especially those written in Chicago and MLA style. He also enjoys reviewing poetry and short stories! Facebook Twitter Email) Join Our Community Apply Now Visit Concordia Request Info Virtual Tour Contact Us Concordia University Irvine Footer Connect University Events Resources Campus Map Employment MyCUI Parents Pay Tuition Online Press Room Sitemap Veterans Resource Center Services Academic Advising Bursar's Office Campus Safety Financial Aid at Concordia University Irvine Library Brand and Marketing Resources Registrar University Services Concordia University Irvine is a private, Christian university that is ranked nationally among the \"Top Performers on Social Mobility\" universities by U.S. News & World Report. Concordia is accredited by WASC Senior College and University Commission (WSCUC) and serves over 5,000 students annually. Concordia University Irvine 1530 Concordia West Irvine, CA, USA 92612 (949) 854-8002 info@cui.edu © 1998-2025 Concordia University Irvine | Privacy Statement | Terms of Use | Accessibility Back to top"
    },
    {
      "url": "https://forum.zcashcommunity.com/t/placeholder-considerations-resources-governance-and-legitimacy-in-nu4/34045",
      "content": "Published Time: 2019-07-10T16:21:21+00:00 Placeholder Considerations: Resources, Governance, and Legitimacy in NU4 - Community Collaborations / protocol - Zcash Community Forum Skip to main content Sign Up Log In ​ Topics More Categories Community Collaborations Community Grants Ecosystem Updates General Governance International Meta Off Topic Lounge Technical Support Technology Zcash Apps All categories Light ​ ​ Zcash Foundation is pleased to announce ZconVI, a virtual gathering of Zcash enthusiasts and experts, is taking place this week Tuesday, March 4 to Friday, March 7,2025. Join the Livestream ZconVI will be a fully virtual event, allowing participants from around the globe to join without the constraints of travel. The event will showcase how we can achieve Synergy Through Decentralization, highlighting the collaborative efforts of multiple organizations in planning and executing the event content. This blog post provides additional details. Placeholder Considerations: Resources, Governance, and Legitimacy in NU4 Community Collaborationsprotocol You have selected 0 posts. select all cancel selecting Jul 2019 1 / 58 Jul 2019 Aug 2019 cburniske 4 Jul 2019 Attention! This proposal has morphed into a ZIP draft, discussed in a separate thread. Original primer post below: In October 2020 the Zcash network will undergo its first halving, slicing the annual rate of ZEC inflation in half. Halvings are important moments in any cryptomoney’s maturation as they double the marginal cost of producing each incremental unit (at constant hash rate), moving the asset further along the scarcity curve. Concurrent with this halving, Zcash will undergo its fourth network upgrade (NU4), in which key decisions (especially re: the Founders Reward) need to be made that will shape the next four years of Zcash’s life. For those new to Zcash (not many noobs on the forum, but just in case!), the Founders Reward refers to the 20% of newly minted ZEC supply that goes towards Zcash founders and software development, with the other 80% going to miners who maintain the network’s hardware and ensure its security. This bifurcation differs from Bitcoin’s choice to allocate 100% of newly minted BTC to hardware security. The term Founders Reward is not entirely representative of how the 20% ZEC is used, as witnessed in the breakdown of Zcash’s monetary policy below: 1306×862 181 KB Right now, the default plan for NU4 is to discontinue any allocation for software development and revert to Bitcoin’s design of 100% newly issued ZEC to miners. If, however, the community decides it would prefer to continue allocating 20% of the block reward to software development during the 2nd coinbase reward epoch (totalling 5% of fully-diluted ZEC supply), then a number of decisions need to be made about the allocation and governance of those funds [1]. As ZEC coin holders, Placeholder recognizes that NU4 will be a critical upgrade for the Zcash network, and therefore have chosen to submit our thoughts about its contents. Since it’s our first “formal” participation in the Zcash community, some explanation could be helpful: While members of the Zcash and Placeholder teams have known each other for years, only in 1H 2019 did Placeholder build a position in ZEC. The timing of our ZEC purchases was market driven, but the choice to work with Zcash was underpinned by the belief that privacy will become a critical feature for users, retail and institutional, by the end of crypto’s second decade. Zcash’s privacy team is second to none amongst its cryptonetwork peers, and given the Electric Coin Company (ECC) and the Zcash Foundation (ZF) have demonstrated a credible commitment to fairly evolve network governance, participation seemed like a natural fit for Placeholder. Prior to the purchase of ZEC in the open market, Placeholder had no formal relationships with the ECC or the ZF, and nor do we plan to pursue any. We’ve been engaged in conversations with both, but are not here to pick sides. We view our interests and governance rights as identical with that of other coin holders, big and small, and hope that together we can come to agree on the best upgrades for the network. In our efforts to understand the current state of the community leading up to NU4, we found ourselves resonating with the sentiment behind Andrew Miller’s recent Notes on reaching agreement about a potential Zcash dev fund [2]. We encourage anyone who hasn’t read that to do so before proceeding here. What’s important to take from Miller’s piece is that Zcash is in a strong position after its first four years, and so we have the liberty to make clear-headed decisions in NU4. Most importantly for Placeholder, and here we echo Miller, decisions around NU4 need to be legitimate in the eyes of the community as a whole. Beyond legitimate, we also hope to be able to approach NU4 as exactly that, an upgrade. With this upgrade the community has an opportunity to re-evaluate and redesign parts of the network’s policies to work best for all members. It is only natural that, as the network matures, the optimal allocation of its resources also evolves. Optimal allocation means that funds are disbursed efficiently and with purpose, without excessive allocations to any single party, to ensure that work necessary for the long-term success of the network is appropriately compensated. If this conversation is of interest to you, it’s important you weigh in sooner rather than later, as August 31, 2019 is the deadline for Zcash Improvement Proposals (ZIPs) that want to be considered for NU4, and October 31, 2019 marks the date when the feature selection for NU4 must be completed. For network upgrade pipelines and dates, see here. Placing Zcash in Context Zcash sits comfortably in the spectrum of monetary and fiscal policy experiments currently visible in leading cryptomonies. Placeholder has taken an interest in Zcash in the context of already being highly active participants in the Decred network and passive hodlers of bitcoin. The image below depicts the differences between the three in terms of supply-side compensation: 1036×279 18.1 KB Bitcoin is the most minimalist with its incentive structure, optimizing for hardware security in the form of miners only. As witnessed in the SegWit saga and the emergence of user-activated soft-forks, governance of the Bitcoin network appears to be controlled by full node operators, though some would still contend it’s the miners with the upper hand. Zcash considers both miners and builders to be supply-siders of the network and makes room for the builder incentive by cutting miner’s incentives by 20% from Bitcoin’s benchmark. On a relative basis, between the three networks, Zcash allocates the lowest percentage of coinbase rewards to security, but it does so by allocating the most to the builders and protocol development. That means we, as ZEC holders, should be getting the most out of the Zcash builders as we are paying for it with supply inflation. To date, governance of the distribution of the builder subsidy has been transparent but without community’s participation. The controls of the ECC and the ZF are still in the process of being decentralized and encoded (the extent to which they are on-chain is still to be determined). While allocating the least to security may sound alarming, Zcash still allocates 80% of all newly minted ZEC and all transaction fees to security which, judging by the healthy hash rate growth depicted below, does not appear to be insufficient: 1600×842 172 KB Turning to Decred, it has three sets of supply-siders it compensates: the miners as with Bitcoin and Zcash, builders as with Zcash, and a new entity in the form of the stakers. Decred’s stakers put a voting check on miners per Decred’s hybrid PoW / PoS security design, and also govern protocol upgrades and disbursement of the network treasury financed by the 10% that is allocated for builders. While Zcash has a significant amount of “off-chain governance” between the ECC and the ZF, Decred has more of its governance made explicit in the code. As part of NU4, we expect Zcash to begin walking the path towards increased decentralization and governance formalization, with the ECC reducing its control and becoming one contractor among others. That said, between Bitcoin, Zcash, and Decred, Zcash’s current governance design is the most familiar to existing institutions, potentially making them more comfortable using Zcash’s public network or collaborating with the team, as evidenced by the JPMorgan research partnership. Institutions wanting to use public networks will likely need to do so while keeping transaction data private, making Zcash a natural fit. Therefore, while maintaining a more traditional governance structure may be interpreted as a systemic risk by crypto-anarchists, it might actually be a strategic advantage for Zcash and therefore should be a background point of consideration in these conversations. A side note about Zcash’s Founders Reward: we’ve noticed a tendency for polarizing conversations around the compensation of Zcash’s founders. In the hopes of de-polarizing, we will turn to numbers which we can all agree to as fact. In the 4 years leading up to this first halving, 50% of ZEC’s total supply of 21 million units will be issued, meaning Founders and Vested Employees are slated to earn 6.4% of the ZEC that will ever be in existence (50% of 12.8%). However, in June 2019, all Founders and Vested Employees took a dilution to provide more funds for protocol development (at that time ZEC was in oversold territory at $40-60 per unit, placing the ECC in an operating deficit). In total, the dilution places Founders and Vested Employees as slated to receive 5.8% of the fully-diluted ZEC, as described in detail on p. 13 of the ECC’s Q2 2019 Transparency Report. To place Zcash compensation in the context of the rest of crypto, we can use Nic Carter’s University of Edinburgh Master’s Thesis, A Cross-Sectional Overview of Cryptoasset Governance and Implications for Investors, which analyzed the launch types, founder allocations, corporate support and more, of the top 50 cryptoassets by network value on July 29, 2017. Below is a table from Nic’s cross-sectional survey, which includes Zcash and a column dedicated to investigating Founder Reserve norms [3]. In his analysis, Nic found the median for founder’s reserves to be 15% of total supply and the mean to be 19.68%, ~2.5x and ~3.4x greater than Zcash’s Founders Reward [4]. When we overlay the fact that some of Zcash’s founders have been working on digital currency implementations for longer than many crypto participants have been alive, we find complaints about their 5.8% allocation to lack perspective. 1600×1097 582 KB Lastly, for those who can’t stand the idea of more than 10% fully-diluted ZEC being allocated to funding protocol development, there is Ycash (YEC), an upcoming “friendly fork.” Slated to occur on Zcash’s 570,000th block (roughly July 18, 2019), the Ycash network “will reduce the Founders Reward rate from 20% to a perpetual 5%, which will exactly preserve the original 2.1 million coin cap on the Founders Reward.” If people believe the Ycash model is better, they are of course open to convert their ZEC into YEC. With the above as context, let’s turn to the practical decisions the Zcash community must make in the coming months. Making the Decision about the Decision As we mentioned at the beginning, it’s important to the network’s long term health that there be general consensus on the legitimacy of the decision-making process, as well as the decisions themselves. As part of a legitimate process, the community’s opinions should be collected and quantified so that the network can get a decent snapshot of its preference before NU4 decisions are made final. Obvious possibilities for gauging community preference include miner signaling, Twitter polling, email or forum surveys, but none of these information sources are trustworthy or representative enough to be binding. While using more complex voting systems such as Decred’s Politeia has been discussed, designing and implementing such a system in time for NU4 is not realistic given these decisions need to be made in the coming months. Therefore, until a more complete and credible solution is developed, the focus should be on polling as opposed to voting. The design of the polling system should be carefully considered to ensure that the outcome is as informative as possible. For example, as has already been suggested, a one-time poll in which each respondent has to choose between a potentially large number of options runs the risk of not identifying the most widely supported proposal. In theory, a series of elimination polls in which the least supported proposal is dropped after each round until only two remain would more accurately highlight the community’s preferences, all things considered. Of course, introducing such additional complexity must be weighed against technical, time and other constraints, but given the importance of the decision at hand, a basic one-time poll to gauge relative majority could be insufficient. Once polling is complete, we expect decisions about NU4 to be made via the 2-of-2 multisig controlled by the ECC and ZF. It would be preferable for the two organizations to gather and quantify community input independently, but there are practical considerations regarding community fatigue and ECC + ZF resource-constraints. Regardless of how information is gathered and quantified, we’d expect both organizations to provide public statements on the rationale behind their votes, taking into account the community’s expressed preferences. For those that may object to the 2-of-2 multisig being too centralized, we would point out that the ZF has done a “notably good job” (our words and Zooko’s) of remaining independent and avoiding governance capture by the same individuals who control the ECC. This has been clear in both public communications and private conversations we’ve had with both groups. Now that we’ve covered the process, we turn to the details of the 2020 decision. Revert to Bitcoin’s approach: 100% to miners If 100% of supply were to go to miners, then from 2020 onward the network would have opted for a rules-based monetary policy with little discretion. With no new funds coming in, there is less discussion that would need to be had about the governance of funds set aside for protocol development. Some would argue this is a strength as it leaves fewer vectors open for attack, but we think it would create more problems than it solves at this stage of Zcash’s development. Modest funds would remain on the balance sheet of the ZF, but the most important discussions would need to revolve around the path forward for protocol development as there would no longer be explicit compensation for the work being done (for ECC or anyone else). While Zooko has expressed he intends to remain committed to Zcash protocol development regardless of the outcome, the ECC would inevitably need to supplant the income that it had been receiving from coinbase rewards with diversified business models. This would inevitably pull focus and resources from Zcash R&D and maintenance. Non-block reward based, non-profit funding (e.g., donation) for development is also possible, as witnessed in Ethereum’s current MolochDAO efforts or Grin’s recent call for financial support. But as pointed out by Lane Rettig at Zcon1, Zcash’s NU4 choices placed in the context of Ethereum represents a somewhat ironic symmetry, as Ethereum is currently working through how to properly compensate their core developers precisely because they lack a recurring and native funding pool. Many other mining based networks have also turned to the donation avenue over the years, and while quality projects typically find a way to make ends meet, we do not view these situations as optimal as they tend to be resource constrained. In our opinion, therefore, reverting to Bitcoin’s approach and sacrificing block-reward funding is not the optimal path. Not only does it make Zcash look awfully similar to Ycash (putting the two more directly in competition), but it also concedes control over an available incentive pool for some of the world’s best cryptography talent to continue work on Zcash. Provided there’s proper governance over the treasury, a partial allocation of the coinbase reward to software development feels like the cleanest solution. It’s denominated in the network’s own asset, thus aligning interests better than external, fiat-denominated funding. Since the network becomes better capitalized the greater its utility and asset value, the community 's resources grow with network success. In other words, it rewards success with more resources for further success. On the other hand, if the network is hardly used and ZEC plummets in value, there will be very little value to fund development and few people that the ECC or ZF can employ-- incentive alignment! Stay the Zcash Course: 80% to miners, 20% (?) to builders, evolve fund governance In this case, 20% would continue to be allocated to protocol development, but control over these resources could be re-designed as part of NU4. In particular, areas where the governors are able to direct capital back to themselves must be given special attention, as incentives may skew towards the governors’ best interests as opposed to the network’s. One can view this as a principal-agent problem between coin holders, the ECC, and the ZF. If the community agrees with this path forward, then by the end of October 2024 (Zcash’s eighth year), 15% of the fully-diluted 21 million ZEC will have been allocated to software development, with the remaining 85% destined to be earned by miners. Of course, if a decision to extend this 20% allocation is made as the community approaches Zcash’s third coinbase reward epoch, then it would mean 17.5% of all supply would end up being allocated to protocol development. At this cadence ad infinitum, the theoretical maximum is that 20% of all ZEC supply ultimately goes to the entities behind software development. That said, as has been raised numerous times on the Zcash forum, it is still an open question of whether 20% of the coinbase reward is the right allocation for software development in the second coinbase reward epoch, or if it should be dropped to 10%, with 90% going to miners. At current market prices of ZEC, a drop to 10% when the rate of supply inflation is already getting cut in half due to the halving would place the ECC and ZF under operating constraints and require scaling back current efforts. Lastly, we would be remiss to not mention that part of the opportunity here is the ability to adjust the balance between rules and discretion in Zcash’s governance, in the hopes of solidifying its long-term legitimacy. Rules help establish time-consistent credibility of any monetary asset, while discretion optimizes for short-to-medium term flexibility. With these factors in mind, we submit the following for consideration: 20% of the coinbase reward continues to be allocated to software development, but is split into “Protocol Development” (70%) and “Growth Funds” (30%). It’s an open discussion of whether these two funds should be governed through the same or different mechanisms. Additionally, we’re not attached to the 70/30 split. In fact, better analysis of what the optimal split would be based on anticipated ECC and Zebra budgets (protocol development costs), versus anticipated demand for growth funds, would be helpful in the search for the optimal split. Should it turn out that one pool is significantly overfunded in time, there is also always the opportunity for that pool to vote part of its funds over to the other pool. Governing Protocol Development funds: We’re comfortable with this initially being governed by the aforementioned 2-of-2 ECC and ZF multisig, though encourage exploring more representative designs. Zooko’s recent Zcon1 comment that he “likes proof-of-stake” combined with active community conversation re: PoW / PoS hybrid designs, leaves open the possibility of future governance involving voting stakeholders beyond the ECC and ZF. In each period the applying teams should include key research, development, and maintenance milestones, which are not only reviewed prior to the current funding, but also returned to in the proximate funding to keep track of how credible each team has been over time. Funding should be approved on a semi-annual or annual basis to provide stability for the core development teams. It’s also possible to align each funding period with NU’s, where if a NU is delayed the team doesn’t automatically get more funding, but would have to apply for an extension with explanation of why target dates weren’t hit for that NU. Importantly, the ECC - responsible for zcashd - is not the only team that should have access to these funds. For example Zebra, a recent Rust implementation of Zcash written by the Parity team and handed over to the ZF to develop and maintain, will also require resources. Security audits and any other expenses strictly related to protocol development should also be covered by this pool. Since each approval of funding should be for a concrete USD amount, were ZEC to appreciate considerably, the developer funds could accrue significant value beyond the current cost of development. In this case, the excess ZEC would not be claimable or allocated as a bonus, but rather saved for future rounds of funding. This would address the concern around the development teams getting under- or over-funded due to swings in ZEC/USD exchange rate, and ensure a more efficient use of funds. Governing Growth funds: The governance of these funds could follow the same path and principles as that of protocol development funds, but given this represents a minority of the coinbase reward, we also believe a more experimental design could be chosen. If effective, and once hardened, such a design could then be used to also govern the “Protocol Development” funds. There’s already the ZF Grants Program, and the proposed 30% growth allocation could be routed to this existing program, which already has a defined process. If there’s appetite for experimenting beyond the 2-of-2 multisig or ZF Grants’ existing process, such experimentation could involve: A small committee of diverse and identifiable individuals with a 3-of-5 (or similar) multisig. Many examples of this exist in the crypto market today. A 2-of-3 multisig with a seat for the ECC, ZF, and aggregate coin holder vote. This is a hybrid option between the above and below, where the community serves as tiebreaker in cases where the ECC and ZF diverge. An implementation of purely on-chain voting, with Decred’s Politeia and decentralized treasury management the best example. This design is the most complex, and warrants an entire post / discussion of its own if ultimately chosen. While the cadence of decision making will vary depending on the governance design chosen, it’s important these funds be adaptive to market needs, making a quarterly decision likely the slowest desirable cadence. Ideas for growth funds are vast and fall into broad categories such as wallets, application interfaces, liquidity/exchanges, education, marketing, events, and more. The ZF has some good first blush needs here as part of its ZF Grants Program. We note that there’s the possibility for contention/confusion over where the “protocol ends and the growth begins.” For example, is the currently listed “Lightning Network integration for Zcash” a protocol fund proposal or a growth fund proposal? The potential confusion is one argument against two funds. An alternative would be to focus instead on bolstering the process around a single fund that has two focuses. Growth funds could be disbursed in the form of grants, prizes, or investments. Thus far the ZF has chosen grants as its preferred model, but for the sake of completeness we’ve included a summary of the key differences between the three below. We hope this invites more discussion from the community on what’s optimal for these funds from here on out, as a mixture of strategies can be used: Grants: individual entities apply with proposals for work they deem important and are approved/rejected before the work has been submitted. Assets go one way from the fund to the accepted team(s), and while control over funds can be metered according to milestones, there is typically little recourse in the case work is left incomplete or below expected quality. Prizes: the governing group runs competitions around needed work, with one team selected for compensation after the work has been submitted. A benefit to this approach is more work is submitted per dollar allocated, as multiple teams submit solutions to the same problem, and due to the nature of the competition incomplete work is simply not considered for compensation. Assets again go one way from the fund to the accepted team(s). Investments: individual entities are funded but assets are exchanged between the fund and the team, be they traditional equity instruments, cryptoassets, etc. While there is more governance and recourse in these arrangements, and they can compound the growth fund’s balance sheet, they also come with more complications than the other two options, which again would warrant dedicated discussion. That said, it’s common for foundations to grow or maintain their principal via investments, while concurrently doling out grants to fund mission-related efforts and meet tax obligations (more on that here). Managing the principal of the growth fund (and protocol development fund, for that matter), could be important for the long term sustainability of software development as Zcash’s rate of inflation continues to halve every four years. No further “investment allocations” to Zcash founders in the 2nd coinbase reward epoch: As already discussed, the Zcash network is four years old and those that helped get it off the ground have been sufficiently compensated with 5.8% of fully-diluted ZEC supply. We expect the process around NU4 to inform the design of standard, semi-formal methods for gathering input, measuring sentiment, and implementing the preferences of the Zcash community. While not every decision will require as formal a process as NU4, it is important to have the appropriate structures in place for future situations in which broader participation is required. There will be no excuse for not having these systems if we are at a similar crossroads leading up to Zcash’s second halving. Conclusion In the ZF’s own words, “Governance fundamentally consists of three questions: What should we do, who gets to decide, and how are the deciders chosen and held accountable?” As we ponder Zcash’s next four years, everything boils down to answering these three questions in a way that the community as a whole accepts as legitimate. If the above proposal is well received, there’s the possibility Placeholder converts it into a ZIP, incorporating community feedback in the process. If this came to pass, it would be our preference to collaborate with others on the ZIP (or hand over the ZIP entirely). We’ve never navigated the ZIP process before, which feels less than ideal given the gravity of the decisions that are likely to be made. Thanks for reading to the end, and let the discussion continue! Footnotes: [1] A coinbase reward does not refer to the company, Coinbase, but rather to the coins issued as reward for new block production. The term block reward is more common, though the two are not synonymous. A block reward refers to both the coinbase reward and the transaction fees associated with the transactions included in a given block. This paper is primarily concerned with the coinbase reward, not the block reward, as we believe miners should continue to receive all transaction fees, though there has been some discussion on the Zcash forum about using transaction fees to finance software development. [2] Andrew Miller is an Associate Professor at the University of Illinois in Electrical and Computer Engineering, Associate Director of the Initiative for Cryptocurrencies and Contracts (IC3) and a board member of the Zcash Foundation. [3] The Zcash column for Founder Reserve reads 0% in Nic’s report but in reality should be 5.8% – for a future college student to incorporate [4] Not even pure mining networks can always claim a more equitable distribution than Zcash. Especially as earlier in crypto’s history (when lots of the currently dominant cryptomonies were born), pioneering miners or founders would amass large amounts of the coin by mining extremely early or before broader release. These positions sometimes represented double-digit percentages of fully-diluted supply, and the network received little in compensation beyond a massive mining whale or covertly enriched founder(s). 2 Replies 20 ​ Dev Fund Proposal: 20% to a 2-of-3 multisig with community-involved governance Dev Fund Proposal: 5-Entity Strategic Council Approach Proposal for the Zcash 2020 Network Upgrade Future of Zcash dev funding — megathread / everything in one place Moving the Dev Fund discussion forward 20.8k views 121 likes 29 links 14 users 11 9 9 6 6 read 44 min Top replies boxalex 1 Jul 2019 As you formulated and wrote a very well written proposal, or condiderations as you name it i hope it’s ok to ask some questions and comment. cburniske: A side note about Zcash’s Founders Reward : we’ve noticed a tendency for polarizing conversations around the compensation of Zcash’s founders. In the hopes of de-polarizing, we will turn to numbers which we can all agree to as fact. In the 4 years leading up to this first halving, 50% of ZEC’s total supply of 21 million units will be issued, meaning Founders and Vested Employees are slated to earn 6.4% of the ZEC that will ever be in existence (50% of 12.8%). However, in June 2019, all Founders and Vested Employees took a dilution to provide more funds for protocol development (at that time ZEC was in oversold territory at $40-60 per unit, placing the ECC in an operating deficit). In total, the dilution places Founders and Vested Employees as slated to receive 5.8% of the fully-diluted ZEC, as described in detail on p. 13 of the 1.) Currently with the Founders Reward the Founders/Employees receive the Founders Reward and than donate a percentage to the ECC. In my opinion this is an interesting experiment but it has more flaws than it has positive points. What would be the distribution of a new developement reward? Same? 2.) Isn’t it of any concern for “placeholder” that there is an ongoing law suite with an ex-employee where shares/distribution of the Founders reward is part of it? And of course the dilution of the founders reward towards ECC? cburniske: Below is a table from Nic’s cross-sectional survey, which includes Zcash and a column dedicated to investigating Founder Reserve norms [3]. In his analysis, Nic found the median for founder’s reserves to be 15% of total supply and the mean to be 19.68%, ~2.5x and ~3.4x greater than Zcash’s Founders Reward [4]. When we overlay the fact that some of Zcash’s founders have been working on digital currency implementations for longer than many crypto participants have been alive, we find complaints about their 5.8% allocation to lack perspective. Nic’s whole research is a must read and we can find a lot of usefull information there, without doubt. But there is as well a lack of deeper or wider research, mostly because it’s from 2017. Some questions that arise with the cross -sectional survey I and II are: it doesn’t sum up how much a given founders reward, ICO, whatever funding, has generated in US$. Means in theory a given ICO at the start of 50% (just as an example) could have generated $10M for example, but a 5% continous Block Reward (Founders Reward) could have generated $500M. As ssaid, just as an example. This means while the percentage of Nic’s Chart than back have been mostly correct than back it doesn’t tell us anything about the amount of funds a development team has received to reach it’s target. Without this factor this chart has only limited value. cburniske: Lastly, for those who can’t stand the idea of more than 10% fully-diluted ZEC being allocated to funding protocol development, there is Ycash (YEC), an upcoming “friendly fork.” Slated to occur on Zcash’s 570,000th block (roughly July 18, 2019), the Ycash network “will reduce the Founders Reward rate from 20% to a perpetual 5%, which will exactly preserve the original 2.1 million coin cap on the Founders Reward.” If people believe the Ycash model is better, they are of course open to convert their ZEC into YEC. It’s not that easy for the community. Just because someone or a group of people doesn’t like the whole idea of a contioued dev fee, and/or propose to consider other funding sources or even a hybrid mix of different proposals as well shouldn’t mean exactly the Ycash one-man-show should be the alternative. cburniske: The design of the polling system should be carefully considered to ensure that the outcome is as informative as possible. For example, as has already been suggested, a one-time poll in which each respondent has to choose between a potentially large number of options runs the risk of not identifying the most widely supported proposal. In theory, a series of elimination polls in which the least supported proposal is dropped after each round until only two remain would more accurately highlight the community’s preferences, all things considered. Of course, introducing such additional complexity must be weighed against technical, time and other constraints, but given the importance of the decision at hand, a basic one-time poll to gauge relative majority could be insufficient. +1, absolutly agree on this one. This should be a MUST having in mind the importance of such decision. cburniske: Not only does it make Zcash look awfully similar to Ycash (putting the two more directly in competition), A project without own tech can’t be called competition seriously. Just as a sidenote. If you replace Ycash with another privacy project and own tech like Monero i fully agree of course. cburniske: Provided there’s proper governance over the treasury, a partial allocation of the coinbase reward to software development feels like the cleanest solution. How is this provided and controlled havine a for-profit company as the recepient with limited transparency? An important factor in the whole dev fee discussion (at least for some). Why not the foundation with bigger transparency options having the recepient and having the foundation allocating needed funds to the ECC? What are the arguments against this variation to ensure proper governance over treasury and control from/through the community? cburniske: or if it should be dropped to 10%, with 90% going to miners. At current market prices of ZEC, a drop to 10% when the rate of supply inflation is already getting cut in half due to the halving would place the ECC and ZF under operating constraints and require scaling back current efforts. There are several points why i don’t fully agree to this argument: When the ECC run with a deficit the ZEC exchange rate was $60 or lower if i remember right, currently we are $100. With the current Founders Reward there are expenses that shouldn’t be anymore the case with the new dev free, for example advisor, early founders and so on … This should mean more funds in % are available for the ECC development anyway compared to the current situation with the Founders Reward. The halving won’t cut only block rewards, there is a big chance, even i’am not yet a believer of this, that the effect would/could be compensated by a price rise. Or at least partially, which again would lead to at leat partially more funds available for the ECC even if it’s just 10% or any given number. Of course we do not know where the price goes so it could work out either way. Having way too much funds available or not enough funds. Wouldn’t here some kind of dynamic funding system versus US$ fit better and have the ECC safe? For example the Dev Fund gets adjusted monthly and correspondents to a $1M value per month from the generated dev fund. $1M can be replaced with whatever value the community thinks is fine. cburniske: Lastly, we would be remiss to not mention that part of the opportunity here is the ability to adjust the balance between rules and discretion in Zcash’s governance Makes me remind Nic’s figure 4: NIC-Governance-Figure41227×510 54.7 KB Any improvement to this governance model or should it stay like this? cburniske: We’ve never navigated the ZIP process before, which feels less than ideal given the gravity of the decisions that are likely to be made. +1, absolutly agree on this one!!! cburniske: Thanks for reading to the end, and let the discussion continue! It was an interesting read for sure, no matter i don’t agree to some points or have some concerns, much if not most makes just sense. Interesting to see if there will be indeed a discussion. 1 Reply 5 ​ nathan-at-least Jul 2019 Hi @cburniske, thank you for contributing to the Zcash community! This is an excellent post and I really appreciate how you’ve positioned Zcash within the ecosystem for context. I hear you that participating in the ZIP process seems like it may be too heavyweight or involved. In fact, that’s a concern expressed in many of the dev-fund related proposals found in the protocol proposals section of the Forum. One of my intentions is to ensure that we don’t let the ZIP process be a barrier to anyone in the community formulating and advocating for their own proposals, so we’ll be reaching back out to you and other proposers to simplify and clarify that process. 1 Reply 3 ​ cburniske 1 Jul 2019 Thank you for these. Below I address most all of them, in order: boxalex: 1.) Currently with the Founders Reward the Founders/Employees receive the Founders Reward and than donate a percentage to the ECC. In my opinion this is an interesting experiment but it has more flaws than it has positive points. What would be the distribution of a new developement reward? Same? The distribution of a new development reward could be 70% Protocol Development Fund (2 of 2 multisig for now), 30% Growth Fund (2 of 2 multisig or sleeved into ZF Grants Process, with more experimental structures available). The 70% Protocol Development will be open for ECC to apply to, as well as the team from the ZF that maintains Zebra, not to mention any other full node implementations in alternative languages. As mentioned in the doc, “Security audits and any other expenses strictly related to protocol development should also be covered by this pool,” which is likely another independent set of entities. The 30% Growth Fund is then even more widely available to the public, with Decred’s Politeia as a good example of what is possible here (sans the protocol / Company0 proposals that go through Politeia). (this is all described in more detail in the Stay the Zcash Course: 80% to miners, 20% (?) to builders, evolve fund governance section) boxalex: 2.) Isn’t it of any concern for “placeholder” that there is an ongoing law suite with an ex-employee where shares/distribution of the Founders reward is part of it? And of course the dilution of the founders reward towards ECC? We can discuss with the ECC the current state of affairs, but atm this is not a concern. Nic Carter’s Research Re: your points for improvements of Nic’s cross-sectional survey, I appreciate the thoroughness but am going to leave that conversation for elsewhere boxalex: It’s not that easy for the community. Just because someone or a group of people doesn’t like the whole idea of a contioued dev fee, and/or propose to consider other funding sources or even a hybrid mix of different proposals as well shouldn’t mean exactly the Ycash one-man-show should be the alternative. Fair enough, I agree a community divorce/fork is tough and shouldn’t be referenced as an option as casually as I did. boxalex: +1, absolutly agree on this one. This should be a MUST having in mind the importance of such decision. cburniske: We agree. IMO the series of elimination polls for boiling down to the community’s proposal of choice is one of the most important recommendations we make about a practical yet accurate approach to distilling the community’s preference**** Wasn’t my suggestion, was Mario’s (Placeholeder’s Governance Researcher), who may have got it from somewhere else… boxalex: How is this provided and controlled havine a for-profit company as the recepient with limited transparency? An important factor in the whole dev fee discussion (at least for some). Why not the foundation with bigger transparency options having the recepient and having the foundation allocating needed funds to the ECC? What are the arguments against this variation to ensure proper governance over treasury and control from/through the community? For legal reasons the ZF does not want sole discretion over the movement of the network’s funds, therefore it has to at least be a two signature situation. We think having the ZF and ECC vote together is better than just the ECC, and do not believe the ECC has “captured the ZF.” In cases where there is a similar Foundation + for-profit Core Company structure in crypto (which we all know is common after 2017!), Zcash’s Foundation is one of the most independent Foundations I’ve encountered in crypto Beyond that though, you are getting at important points. I do think we should push for the Growth Funds to be more decentralized in their governance first (with a path to on-chain voting?), and then move on to further decentralized the Protocol Funds second (perhaps with the Growth Fund model which has by that time been hardened within the Zcash system). Part of Placeholder’s push in this proposal is precisely to increase the controls and transparency of resource flows within Zcash. This is not to knock the effort thus far, ongoing examples (with the Q2 2019 Transparency Report a good recent one) are part of what convinced the Placeholder team that the ECC and ZF are committed to credibly evolving the governance and transparency of the system over time, and thus got us involved. boxalex: There are several points why i don’t fully agree to this argument: When the ECC run with a deficit the ZEC exchange rate was $60 or lower if i remember right, currently we are $100. With the current Founders Reward there are expenses that shouldn’t be anymore the case with the new dev free, for example advisor, early founders and so on … This should mean more funds in % are available for the ECC development anyway compared to the current situation with the Founders Reward. The halving won’t cut only block rewards, there is a big chance, even i’am not yet a believer of this, that the effect would/could be compensated by a price rise. Or at least partially, which again would lead to at leat partially more funds available for the ECC even if it’s just 10% or any given number. Of course we do not know where the price goes so it could work out either way. Having way too much funds available or not enough funds. Wouldn’t here some kind of dynamic funding system versus US$ fit better and have the ECC safe? For example the Dev Fund gets adjusted monthly and correspondents to a $1M value per month from the generated dev fund. $1M can be replaced with whatever value the community thinks is fine. You raise a few points but they all seem to boil down to fear about an inefficient allocation of ZEC (either deficiency or excess). I think it’s an interesting idea to have a dynamic monetary policy based on USD spend of the different entities tapping the funding pool(s). That said, my fear at this stage is dynamic but automated monetary policies are still at the forefront of research and I’m not sure that this coinbase reward epoch is the right one to try to implement such an approach. But maybe funds could be allocated from the Growth Fund to R&D around this effort (or would it come from the Protocol Fund? Guess it’s at the applicants discretion…) A second option, though not as nifty as yours, is the fixed division of resources again between hardware (miners) and software development (builders). I like sticking with this (for now) for its simplicity, and also time-consistent assurance to different economic agents (this includes both the miners and builders) of the resources they stand to gain from contributing to the system. We cannot possibly speculate on ZEC’s price with precision, but we can know the budget of the teams pretty well in advance in USD terms. My thinking is after each period, and in a macro sense at the end of the 2nd coinbase reward epoch, if there is a situation where either fund has leftover ZEC, then it will just roll over into future years of allocation. The funds are never zeroed out (nor are “investment allocations” given past this 1st coinbase reward epoch, as we reference). I think it would be healthy if we start to think of and work towards these funds as endowments - eventually they need to be designed to compound capital, dole out interest without drawing down the principal, and support Zcash for decades (centuries?) to come. boxalex: Makes me remind Nic’s figure 4: NIC-Governance-Figure4.jpg1227×510 54.7 KB Any improvement to this governance model or should it stay like this? Love this graphic, think it can be a helpful reference as we work towards NU4, but FWIW I don’t think Zcash is a benevolent dictatorship. As much as Zooko is revered in crypto, there are a lot of rockstars on the Zcash team, and as noted prior, the ZF is stolidly independent. Okay, I think that’s everything of greatest relevance (for now) - thanks @boxalex! 5 Replies 6 ​ cburniske nathan-at-least Jul 2019 thanks @nathan-at-least! we’re happy to explore the ZIP process, but also don’t want to jam anything up on account of being relative noobs to the Zcash process. That said, if you could have DC connect us via email that would be great. 3 ​ sonya Jul 2019 Chris, the ZIP process is described in depth here: zips/zip-0000.rst at main · zcash/zips · GitHub It’s a lot to dig into, but pretty thorough. Please let us (the community) and the ZIP editors (zips@z.cash) know what your questions are, or if anything is unclear in ZIP 0! The ZIP on-boarding experience definitely has room for improvement, especially now that more people will be participating in the creation and evaluation of ZIPs. In fact, I just opened a PR to add a link to ZIP 0 to the readme. cc @daira @acityinohio (the current ZIP editors) 2 Replies 2 ​ mistfpgaRegular Jul 2019 I am currently working on a template. should hopefully be ready in a couple of days. It is going to be based off feedback I have received from the ECC, other zips and the RUST model. Am I wasting my time? I was going to collate a post that could hopefully be pinned that tells people what is needed to write a zip. (like going into detail about rfc language and why it is important, how to use it, etc) the post will be specifically designed for non technical people to be able to express their ideas and directly compare them to others. And remove a lot of the ‘heavy lifting’ of getting to grips with the zip process from a community standpoint. This post is a basic outline. of the format, but I have not made the template yet. (and wont for at least a day) ZIP Proposal - 8-15% Opt-in or 4-7.5% Mandatory Dev Free |75% Zcash Foundation 25% ECC| - #20 by mistfpga @daira @acityinohio Should I still continue? or wait? Thanks, Steve 2 Replies 3 ​ cburniske Jul 2019 will do, thanks sonya. sonya: In fact, I just opened a PR to add a link to ZIP 0 to the readme. love this! 1 ​ cburniske mistfpga Jul 2019 i shouldn’t be the final authority here, but so long as the work is not duplicative it sounds helpful. on the duplicative part, i would follow up with sonya per mention of intro materials in ZIP 0. 2 ​ sonya mistfpga Jul 2019 I think a “crash course on the ZIP process” guide would be incredibly helpful, even if it overlapped with ZIP 0. I would be happy to offer feedback or contribute, when / if you’re ready for more input! 2 ​ McKie Jul 2019 Just want to ACK that we agree with your sentiments here at Amentum, Chris. And too have amassed a holding of ZEC over the last year of our operation during ideal market conditions. We look forward to reading others feedback. 5 ​ boxalex Jul 2019 A follow up and some more thoughts on your answers/comments: cburniske: The distribution of a new development reward could be 70% Protocol Development Fund (2 of 2 multisig for now), 30% Growth Fund (2 of 2 multisig or sleeved into ZF Grants Process, with more experimental structures available). The 70% Protocol Development will be open for ECC to apply to, as well as the team from the ZF that maintains Zebra, not to mention any other full node implementations in alternative languages. As mentioned in the doc, “Security audits and any other expenses strictly related to protocol development should also be covered by this pool,” which is likely another independent set of entities. The 30% Growth Fund is then even more widely available to the public, with Decred’s Politeia as a good example of what is possible here (sans the protocol / Company0 proposals that go through Politeia). (this is all described in more detail in the Stay the Zcash Course: 80% to miners, 20% (?) to builders, evolve fund governance section) Seeems on this point, due my bad non-native-English we speak about different things. What i have in mind is how the current founders reward is distributed: \\==> Block reward % goes to a Zcash adress \\==> from the Zcash adress it’s distributed to the different recepients, founders, employees, whomemver. \\==> From exactly these founders, employees, whomever ECC gets the “donations” or funding. That’s my impression how it currently works and in my book this is an absolutly wrong setup. Or in case you exactly have this in mind the the protocol change should modified and 70% go to Protocol Development and 30% to Growth Fund by default? Still, who will be in charge to decide what gets used for what? cburniske: We can discuss with the ECC the current state of affairs, but atm this is not a concern. Seriously? A multi-million dollar on-going lawsuite is not a concern? Just in case the law-suite is begin lost others could follow and this should at very least be a concern in my opinion. And in case one or more such law-suites are lost in future, who is paying these multi-million dollar fines/compensations? cburniske: Re: your points for improvements of Nic’s cross-sectional survey, I appreciate the thoroughness but am going to leave that conversation for elsewhere Why? It’s your chart you posted with the funding percentages and comparision to other project. But it’s less than half of the story to use NIC’s numbers without US$ conversations in how much a given funding has generated. Interesting enough we have no clear confirmed numbers on how much funds the ongoing FR has allready generated and my personal calculation/estiminate that it will have generated at current exchange rate (for the outstanding period) at least $300M, mostly around $400 is just that, an estiminate. This raises some questions: How many crypto projects are you/we aware that have ~$300-$400M raised within 4 years? Was/is the current Founders Reward really distributed good enough to favour R&D, the product itsellf and development or should this be improved. Avoiding this question automaticly leads to unability to improve whatever. My personal opinion is that it’s at least strange to talk about a new dev fee or modified founders reward without analyzing the current one. And you has a financial investment company for sure have done such analysis allready, but i guess that this point doesn’t favour the discussion with a 20% new fee. cburniske: We agree. IMO the series of elimination polls for boiling down to the community’s proposal of choice is one of the most important recommendations we make about a practical yet accurate approach to distilling the community’s preference**** Wasn’t my suggestion, was Mario’s (Placeholeder’s Governance Researcher), who may have got it from somewhere else… Not that this matters, but it was my suggestion in another proposal to use this kind of election to get the best result (you even linked it in your first post). However, even such very fair “election process” isn’t worth 2 cents if for-up the opinion gets manipulated. In my opinion posting your and only your proposal on the 76k followers Twitter account of the ECC is not fair towards all other proposals and someone can allready consider this manipulation of opinios to get a higher support for a given proposal. This said, the best election process is worth nothing if things are decided (manipulated) from start. cburniske: For legal reasons the ZF does not want sole discretion over the movement of the network’s funds, therefore it has to at least be a two signature situation. I didn’t read such statement yet, even more suprising not in my own proposal which has the foundation as the whole recepient of a new dev fee. IF this is true than: 1.) At least this should have mentioned allready in my proposal which favours the Foundation as the recepient. 2.) Some people know way more than the forum community. And of course some following questions in this scenario, do we need a foundation than at all if the foundation itself wants only very limited (legal) responsibility and accountness. I mean if the whole role of the foundation is just or mainly here and there some grant approving than this could be implented as well in the ECC and at least safe some funds. I could discuss this point further but this would go into another thematic mostly, but it’s worth thinking about if the foundation should have more control than now over funds or not in the name of more transparency, fairer distribution and eventually even generating competition with the Zcash projects development. cburniske: Part of Placeholder’s push in this proposal is precisely to increase the controls and transparency of resource flows within Zcash. This is not to knock the effort thus far, ongoing examples (with the Q2 2019 Transparency Report a good recent one) are part of what convinced the Placeholder team that the ECC and ZF are committed to credibly evolving the governance and transparency of the system over time, and thus got us involved. Why over time and not within the introduction of a new def fee or even bevor? One of my main concerns is that there is lacking whatever control on how funds are used and as stated even more as we talk here about a for-profit-company which leaves less possibilities for transparency and control than a foundation in principe. So what’s the idea on how to improve transparency and control further with a new dev fund? cburniske: Love this graphic, think it can be a helpful reference as we work towards NU4, but FWIW I don’t think Zcash is a benevolent dictatorship. As much as Zooko is revered in crypto, there are a lot of rockstars on the Zcash team, and as noted prior, the ZF is stolidly independent. If we have to choose from this figure there are only 2 options that would fit the current State of Zcash governance. Either it’s a Corporate control (which in my opinion as well fits better) or it’s a benevolent dictatorship. The ZF doesn’t play a role here in my opinion as it has no direct influence at all on any Zcash decision. At best some day maybe they could be something decision-influencing but until that point their independence doesn’t affect anything at all. Final word: Congratulations. Your indeed well written proposal that for sure will convince a lot of people and with the help of the 76k ECC twitter account and spreading this exact proposal i doubt there are any problems in having it accepted by the wider community…Someone has to admit it’s a professional job in pushing something through… 4 Replies 1 ​ str4dElectric Coin Company Jul 2019 [quote=\"boxalex, post:12, topic:34045] cburniske: For legal reasons the ZF does not want sole discretion over the movement of the network’s funds, therefore it has to at least be a two signature situation. I didn’t read such statement yet, even more suprising not in my own proposal which has the foundation as the whole recepient of a new dev fee. IF this is true than: 1.) At least this should have mentioned allready in my proposal which favours the Foundation as the recepient. 2.) Some people know way more than the forum community. [/quote] Here’s a link to the statement, which was made directly to the forum community: The future of Zcash in the year 2020 General Thanks for tagging me @sonya; yes, I think any proposal that has the Foundation receiving all funds (even if there are contracts in place for development) could jeopardize broader decentralization, and as you suggested I wouldn’t want the Foundation to be a single gatekeeper. And thanks to @zooko for his post above and giving the community his perspective. The Foundation would only support proposals that: a) don’t rely on the Foundation being a single gatekeeper of funds b) don’t change the u… ​ boxalex Jul 2019 cburniske: For legal reasons the ZF does not want sole discretion over the movement of the network’s funds, therefore it has to at least be a two signature situation. I got aware allready about the Foundations stance of this: The Foundation would only support proposals that: a) don’t rely on the Foundation being a single gatekeeper of funds b) don’t change the upper bound of ZEC supply and c) have some kind of opt in mechanism for choosing to disburse funds (from miners and/or users) Will be interesting to see what the foundations stance is as there are not many proposals with an opt-in mechanism… And this one is lacking one as well… ​ sonya Jul 2019 boxalex: The ZF doesn’t play a role here in my opinion as it has no direct influence at all on any Zcash decision. At best some day maybe they could be something decision-influencing but until that point their independence doesn’t affect anything at all. This is incorrect since one of the ZIP editors represents the Zcash Foundation. We have an effective veto on protocol changes, and it would be pretty disastrous in terms of reputation for ECC to go around the ZIP process after committing to it publicly. Granted, once a trademark agreement is in place, that will carry more legal weight. 1 Reply 3 ​ mistfpgaRegular 1 Jul 2019 Hi, Welcome to the forums. As you stated this is a contentious topic, I hope you can appreciate my frustration with the situation, it is not directed at you. Having said that though it has reached a point where I need to take a step back for the politics and concentrate on writing the proposals, and my work on RandomX. I will be around to reply to things but less opinion. You have brought some very good ideas to the table and I really do not want to discourage you. I would like to pick up on one point in particular in your post/proposal. This is more to clear things up for the newbies and people who might be drawn here by your post. cburniske: Right now, the default plan for NU4 is to discontinue any allocation for software development and revert to Bitcoin’s design of 100% newly issued ZEC to miners. If, however, the community decides it would prefer to continue allocating 20% of the block reward to software development during the 2nd coinbase reward epoch (totalling 5% of fully-diluted ZEC supply), then a number of decisions need to be made about the allocation and governance of those funds The way you have framed this argument saddens me. You seem to understand crypto currency on a deep level, so I am not sure why you would phrase that the way you have. The argument against a continual development fund from block distribution is a strong one: There was a promise that was made by the ECC was that after 4 years they would no longer received 10% of the total mineable supply of zec from block distribution (not block reward, block distribution) and all block distribution will go to miners (this is baked into the protocol like bitcoin) This is not a 20% tax it is a 10% tax frontloaded to be 20% there is a important distinction. Any adjustment to block distribution would be being taxed twice, for supporting the network and processing transactions, i get to pay twice and enrich everyone else. There was a promise that their will be an emission curve and that curve was set in stone (by algo, like bitcoin) There was a promise that the total number of issued zec would be 21 million (fixed cap like bitcoin) There was a promise of finacial privacy If zcash can break one of the 4 pillars, then how can they be trusted not to break others? edit: zcash in the sentence above is a reference to the technology and community. not the ECC. I wanted to make this point doubly clear because my post is aimed at more of the newer crowd who might not be as aware of the difference. There was no mention of any form of ability to change these rules via community consesus. There is a mechasim via zip’s but they are not decided upon by community consensus. No one votes on zips. That would be a crazy way to run a company. There is no definition of who or what the community is I cannot stress enough how there is no mechanism for people to come to a consensus, zec simply isnt designed like that. Could we use the same consensus mechanism for changing emission? how about depreciating z-addresses? These things have to be fundamentals right? So we can never have voting - bitcoin got that right completely by accident. (the 1 cpu 1 vote design is broken) I am not trying to be negative, but these are real issues that are stopping this from progressing any further. The best we have so far is some really good suggestions from zooko about implementation aspects of possible ideas whatever ideas they maybe However once you think about any one of the points he has raised with any one of the ‘change things ideas’ then, the downstream impact on the rest of the community (exchanges, mining pools, miners, people who accept for value) is so non trivial things start to melt (like my mind) cburniske: We agree. IMO the series of elimination polls As someone who lives in a country that is governed by such a mechanism. It doesn’t work. Look at Brexit and the elimination polls in the house of commons. (not rigged - no outcome) Then look at the tory pary leadership, (that was rigged). boris was always going to win but Gove was the best candidate against him, Boris out right stated he got his voters to back hunt so he wouldnt have to face Gove in the final race. (Hunt was never going to win gove had an outside chance, similar things happened in every round of that selection process) With this mechanism, with a zip like “Dont change things” it will lose in the first round, it only benefits one kind of change, it doesn’t benefit changes that do not make changes. What this boils down to is I did not opt-in [as I was made fully aware of what I did and did not opt-in to in the ASIC war of 2018] to having the rules changed after they are set in motion. cburniske: We’ve never navigated the ZIP process before, which feels less than ideal given the gravity of the decisions that are likely to be made. welcome to our world. none of us have. Sonya has started a megathread (that was on my todo list - only just got regular status back to enable me to do it though), that with daira and str4ds ideas on my proposal I think will help everyone be able to use their voice. All voices have to have the same weight. No voting, no polling, only voices. I am trying to write a zip that says we dont need voting, then people are going to vote on it. How does that work? (I shake my head and go do something else every time i try to type it up) Please dont flippantly dismiss my opinions by just saying “go play with yec” - I didnt opt-in to yec, i opted into zec. (I saw you already apologised, its just a very hot topic at the moment) Thanks for your time. 2 Replies 3 ​ cburniske Jul 2019 thank you for the thoughtfulness @mistfpga out of curiosity, are you a miner? couldn’t help but notice your name includes FPGA to address some of the good concerns you laid out: mistfpga: If zcash can break one of the 4 pillars, then how can they be trusted not to break others? this speaks directly to the points i tried to make around legitimacy. legitimacy and trust can be used interchangeably here, and both are built over time by adhering to a community-endorsed decision-making framework (ie, governance). that framework can choose to balance rules and discretion, so long as it is time-consistent. i’m of the opinion that strictly rules-based frameworks are likely too inflexible (except for maybe bitcoin) to allow most cryptonetworks to optimally innovate and adapt to market opportunities. therefore, zcash is currently in the search for its governance balance between rules and discretion. i can see some people feeling violated if they felt the “2016 launch promise” was that 4 years later zcash would fall in line with bitcoin and move forward with a rules-based system, because this very conversation violates that perceived promise. the PoV i’m most sympathetic to here is a miner’s, which is partly why i asked if you were a miner that said, 2019 is not 2016, and i think our learnings over the last 3 years need to be incorporated into how we govern and evolve zcash - there is no reason in attempting to be bitcoin. imo bitcoin has already won as the reserve asset of crypto, and its strategy cannot be replicated, because its strategy involved birthing the entire crypto space (and being the first asset to price all other cryptoassets). if we can set in place the right governance framework, and one which the community largely agrees with, then we can agree on using that process to make all future decisions. so long as that process is adhered to, with plenty of checks-and-balances to counteract human nature, we can have trust in it. but until we agree on the process, we will always have contention like what we’re currently facing. if you look at decred, for example, there is less contention because everyone is clear on what the process is for making new decisions. mistfpga: I cannot stress enough how there is no mechanism for people to come to a consensus, zec simply isnt designed like that. Could we use the same consensus mechanism for changing emission? how about depreciating z-addresses? These things have to be fundamentals right? So we can never have voting - bitcoin got that right completely by accident. (the 1 cpu 1 vote design is broken) much of my response above is applicable here, but to summarize: right now there is no mechanism for people to come to consensus on such changes, but that may not always be the case for zcash - and to be very frank, i wouldn’t be here if i didn’t think the ECC + ZF was moving towards formalizing means for people to come to consensus on these very contentious decisions. the way i see it, decisions will always need to be made. one of the biggest first decisions that must be made is how the decisions will be made. choosing to not make a decision about how decisions are made, is a decision in itself, and typically one with messy results. given what bitcoin is, it’s been able to get away without much of a decision-making framework, but that doesn’t mean other projects will be able to so successfully do the same. agree though that the downstream impacts are serious and hence any implementations here cannot be taken lightly. mistfpga: We agree. IMO the series of elimination polls As someone who lives in a country that is governed by such a mechanism. It doesn’t work. Look at Brexit and the elimination polls in the house of commons. (not rigged - no outcome) i’ll let @mlphresearch weigh in here as he has more background in the topic than i do. mistfpga: Please dont flippantly dismiss my opinions by just saying “go play with yec” - I didnt opt-in to yec, i opted into zec. (I saw you already apologised, its just a very hot topic at the moment) i appreciate your opinions and am sorry for the discomfort this process is causing you. 2 Replies 4 ​ mistfpgaRegular Jul 2019 Hi, Sorry I do not address a lot of the governance stuff, that is beyond my skill level. cburniske: out of curiosity, are you a miner? couldn’t help but notice your name includes FPGA Yes I mine Monero. I am primarily in this for the tech though. I have been in cryptography since before bitcoin was a twinkle in statoshis eye (hashcash was the first project that I took notice of in the kind of crypto currency sphere) I am not that involved with the monero community though, ring signatures don’t really interest me that much. I am glad they were proven secure (although I cant find that paper now) ZK proofs, that really does interest me, it could fundamentally change how cryptography works. The FPGA in my name refers to the initial bitcoin fpga another member and myself started (miSt FPGA - the St is for steve) but the teams speciality is in hardware cryptography and bespoke devices. (it is more than just me) cburniske: this speaks directly to the points i tried to make around legitimacy. legitimacy and trust can be used interchangeably here, and both are built over time Partially quoting you. Because my interest is from a technical perspective legitimacy is sticking to the rules. It is why this governance stuff is so tricky for me. I get a bit personally invested, and I don’t want to have to be involved. I have more interesting things to do, like play with NoBL Sram , RandomX, Hardware wallets, reverse engineering bugs, etc. It just upsets me from time to time when I see talk of “oh we can change this, or that” The Times 03/Jan/2009 Chancellor on brink of second bailout for banks This is why I got involved in the very first place. cburniske: because this very conversation violates that perceived promise. the PoV i’m most sympathetic to here is a miner’s, which is partly why i asked if you were a miner Yes this is the point of view I am coming from. In numbers we trust. but don’t get me wrong I am not salty about it. I have offered to write up proposals and help with all proposals that people ask me for, I may not agree with it but everyone should have a voice and have a chance to get that voice heard. - if the thing stopping that is time or not knowing the right format/language then I can and will help. I was disappointed that I could no longer mine zec and the implications that ASIC’s reduce the ability of the network to dynamically adapt, potentially limiting the technology. cburniske: the way i see it, decisions will always need to be made. I agree, and they should be made by a benevolent dictator. I thought we would have moved to that being the foundation by this point. I really am not good at governance or finance. So I will leave that for others to work out. All my proposals will be governance less. I don’t have the skillset to deal with it. cburniske: i appreciate your opinions and am sorry for the discomfort this process is causing you. heheh, it is not you its me - I think the issue more was you declared a large holding in zec, which would make you a large holder of yec, so telling people to mine yec might not have been the best idea to an already contentious subject. suggesting monero whilst it might have seemed strange it was exactly what zooko did in the asic thread [that was before yec though] I hope this gives you a bit more insight in to where I am coming from and why I hold my positions. 4 ​ mistfpgaRegular 1 Jul 2019 Hi, Sorry for the double post. but the edit got too long and it seemed better to make a new post. @cburniske In my last post, I didn’t mean my initial statement to come off as flippant. I had read your proposals and ideas in depth, and I like them and what you bring to the table. I just don’t feel I can comment on them and add value, I just don’t understand it enough. which is why it is good that we have people that do. hopefully my last post explained my simplistic stance. My main reason for posting this new message was to ask do your plans for governance include what will be in NU4 - or are they for NU5 - because funding needs to be worked out for NU4 and that deadline is in 6 weeks. Given that timeframe, and experience, what would you think would be the best course of action? My best attempt is over here. Please read zookos responses at the end of the thread, they brought whole new insight onto this issue for me. Emergency extention to a select part to NU4 inclusions RE dev fund General Hi, @moderators, @zooko, @nathan-at-least Please may we have an extension on what gets included into NU4 regarding the development fund. It is clear that across the community there is broad consensus that zcash will need continual funding. How and where this funding comes from and where it goes to is still a talking point. When Shawn first raised this thread (about 7 months ago) Zooko stated that he felt it a conflict of interest for the ECC to get involved with the discussion of continual f… I would really like your feedback or input. Or anyone’s for that matter. Governance will be important. I just don’t want to have to vote, especially on the future outcome of a private company. So I really hope those who know about this stuff can work something out. Please check out that thread. Hopefully you will see I am not anti funding ECC I am anti breaking core values. I think my stance is pretty much the same as the foundations. I believe both can be achieved without the need for voting. Mainly through a true opt-in protocol level adjustment. Greatly simplifying the issue for downstream and users. (primarily because of my limited understanding governance). But we now have greater community engagement again, after the topic going a bit stale for a week or so and people might get reinvigorated in funding ideas. cburniske: there is no reason in attempting to be bitcoin. imo bitcoin has already won as the reserve asset of crypto, and its strategy cannot be replicated, because its strategy involved birthing the entire crypto space I have been thinking about this, and yes I agree to an extent. bitcoin is the coin to hold. However I believe that strategy could be replicated, in the sense of distribution of coins. One thing bitcoin did was get lots of coins out to lots of people quickly. If you can keep ASICS off your network for 2 halving’s then I think you will be safe as a legitimate assets store of value, or whatever the right word is. but this is just speculation and probably out of scope. Get it in as many hands as possible and you are in the right place. 1 Reply 1 ​ mlphresearch Jul 2019 I work as a governance researcher at Placeholder and this is my first post on the Zcash forum. Happy to explain the thought process behind our proposal, as well as provide personal opinions on open questions. I hope the community welcomes the relative newcomer that I am Thank you @boxalex for your comments and questions. boxalex: What i have in mind is how the current founders reward is distributed: \\==> Block reward % goes to a Zcash adress \\==> from the Zcash adress it’s distributed to the different recepients, founders, employees, whomemver. \\==> From exactly these founders, employees, whomever ECC gets the “donations” or funding. That’s my impression how it currently works and in my book this is an absolutly wrong setup. Or in case you exactly have this in mind the the protocol change should modified and 70% go to Protocol Development and 30% to Growth Fund by default? Still, who will be in charge to decide what gets used for what? Yes, the 70/30 split between “Protocol Development” and “Growth Funds” could be written into the protocol. Your question about who decides how the funds are used thereafter is of course absolutely critical and central to our proposal. As discussed in the initial post by @cburniske, the “Protocol Development” funds could be controlled - similarly to trademark-related decisions - by a 2-of-2 multisig shared between the ECC and the ZF, subject to semi-formalized input from the Zcash community as a whole. Prior to each funding period, both the ECC and the ZF (and potentially other teams supporting development or working on alternative implementations) could publish past progress reports and future work plans that are reviewed by the miners, ZEC holders, and other interested community members with access to various feedback mechanisms that allow them to signal their approval/disapproval and concerns. It is my understanding after attending Zcon1 that both the ECC and the ZF are committed to putting in place the necessary systems for measuring community sentiment and publishing justifications for their decisions. Could the ECC and the ZF decide against the measured preferences of certain parts of the community? Strictly speaking - yes. But such action would not be without consequences and I would expect both organizations to treat community feedback with great care and consideration. The described governance mechanism guarantees continued funding, but introduces certain checks and balances, allows increased community involvement in decision-making, and democratizes access to the funds. Depending on one’s point of view, it may not feel ideal, but all things considered, we hope it is also seen as a reasonable compromise given our current understanding of the challenges faced by decentralized projects/networks such as Zcash. boxalex: Seriously? A multi-million dollar on-going lawsuite is not a concern? Just in case the law-suite is begin lost others could follow and this should at very least be a concern in my opinion. And in case one or more such law-suites are lost in future, who is paying these multi-million dollar fines/compensations? We are in conversations with the ECC to better understand this issue. boxalex: But it’s less than half of the story to use NIC’s numbers without US$ conversations in how much a given funding has generated. I agree, although it’s important to note that these allocations are made under a lot of uncertainty. No one can accurately predict the future value of assets tied to the development of innovative technologies like Zcash. Of course the relative percentages don’t tell the whole story in retrospect, but they do provide context for a comparison in which Zcash falls well below the average in the set considered. boxalex: How many crypto projects are you/we aware that have ~$300-$400M raised within 4 years? Such information should not be too difficult to find, especially in the context of the crazyness of 2017 and early 2018. boxalex: Was/is the current Founders Reward really distributed good enough to favour R&D, the product itsellf and development or should this be improved. Avoiding this question automaticly leads to unability to improve whatever. I think there are several proposals, including ours, that aim to address this question and suggest ways to improve the management of developer funds. boxalex: My personal opinion is that it’s at least strange to talk about a new dev fee or modified founders reward without analyzing the current one. And you has a financial investment company for sure have done such analysis allready, but i guess that this point doesn’t favour the discussion with a 20% new fee. I think that’s a completely valid opinion and is clearly part of the public discussion/consideration. But let’s assume, simply for the sake of argument, that we decide to spend time digging further into the details of how funds have been used thus far and arrive at a conclusion that it has been done in a suboptimal way and there is considerable room for improvement. Assuming that there’s sufficient agreement for some type of protocol-level funding to remain in place, the next step would be to come up with ways to increase community involvement in governance and improve transparency and accountability, correct? It appears to me that this is what we are already working on. boxalex: Not that this matters, but it was my suggestion in another proposal to use this kind of election to get the best result (you even linked it in your first post). Correct. It was an interesting suggestion and we thus decided to mention it in our analysis. I will reply separately to concerns raised in this thread about the possible shortcomings of such a system. boxalex: However, even such very fair “election process” isn’t worth 2 cents if for-up the opinion gets manipulated. In my opinion posting your and only your proposal on the 76k followers Twitter account of the ECC is not fair towards all other proposals and someone can allready consider this manipulation of opinios to get a higher support for a given proposal. This said, the best election process is worth nothing if things are decided (manipulated) from start. In my opinion, community members should be informed about all proposals. This is a good moment to come up with some procedural rules that everyone can accept as fair, thus adding to the legitimacy of the final outcome. boxalex: And of course some following questions in this scenario, do we need a foundation than at all if the foundation itself wants only very limited (legal) responsibility and accountness. I mean if the whole role of the foundation is just or mainly here and there some grant approving than this could be implented as well in the ECC and at least safe some funds. I think having two separate and independent entities (potentially more in the future) is important and, based on my impressions thus far, I see the Foundation’s role as clearly distinct from the ECC. There is obviously some overlap (e.g. in development work) but this is by design. For example, the ZF is responsible for maintaining an alternative implementation of the protocol which makes the network less dependent on the ECC. boxalex: it’s worth thinking about if the foundation should have more control than now over funds or not in the name of more transparency, fairer distribution and eventually even generating competition with the Zcash projects development. I completely agree. The 2-of-2 multisig that was suggested at Zcon1 and that we support in our proposal gives the ZF considerable power. It is my understanding that this effectively includes the right to veto certain decisions that the ZF sees as misaligned with the common and long-term interest of the network as a whole. boxalex: Why over time and not within the introduction of a new def fee or even bevor? One of my main concerns is that there is lacking whatever control on how funds are used and as stated even more as we talk here about a for-profit-company which leaves less possibilities for transparency and control than a foundation in principe. So what’s the idea on how to improve transparency and control further with a new dev fund? We have suggested that funding decisions should be subject to community feedback and approved/justified on a semi-annual or annual basis, potentially tied to the NU schedule. The granularity of regularly submitted progress reports and road maps is an open question. Should a new developer fund be introduced as part of NU4, the most recent Transparency Report (or subsequent ones before the 2020 halving) could serve as the baseline for the first round of funding proposals under the new governance mechanism. The exact details of this can be worked out over time but a basic description of what constitutes “sufficient transparency” should be included in the ZIPs put on table at the end of August. boxalex: The ZF doesn’t play a role here in my opinion as it has no direct influence at all on any Zcash decision. At best some day maybe they could be something decision-influencing but until that point their independence doesn’t affect anything at all. As pointed out by @sonya, this is not an accurate description of the de facto rights and power the ZF already holds. These would be enlarged under a 2-of-2 multisig system where decisions concerning the trademark and potentially the use of developer funds would have to be confirmed by both the ECC and the ZF to go through. Each decision would be preceded by a community review/feedback period and both organizations would accompany their decisions with a public statement on how/why they arrived at a particular outcome. At least that was my takeaway from discussions at Zcon1 and we’ve broadly supported such a vision in our proposal as well. 2 Replies 1 ​ Invalid date Invalid date",
      "title": "Published Time: 2019-07-10T16:21:21+00:00 Placeholder Considerations: Resources, Governance, and Legitimacy in NU4 - Community Collaborations / protocol - Zcash Community Forum Skip to main content Sign Up Log In ​ Topics More Categories Community Collaborations Community Grants Ecosystem Updates General Governance International Meta Off Topic Lounge Technical Support Technology Zcash Apps All categories Light ​ ​ Zcash Foundation is pleased to announce ZconVI, a virtual gathering of Zcash enthusiasts and experts, is taking place this week Tuesday, March 4 to Friday, March 7,2025. Join the Livestream ZconVI will be a fully virtual event, allowing participants from around the globe to join without the constraints of travel. The event will showcase how we can achieve Synergy Through Decentralization, highlighting the collaborative efforts of multiple organizations in planning and executing the event content. This blog post provides additional details. Placeholder Considerations: Resources, Governance, and Legitimacy in NU4 Community Collaborationsprotocol You have selected 0 posts. select all cancel selecting Jul 2019 1 / 58 Jul 2019 Aug 2019 cburniske 4 Jul 2019 Attention! This proposal has morphed into a ZIP draft, discussed in a separate thread. Original primer post below: In October 2020 the Zcash network will undergo its first halving, slicing the annual rate of ZEC inflation in half. Halvings are important moments in any cryptomoney’s maturation as they double the marginal cost of producing each incremental unit (at constant hash rate), moving the asset further along the scarcity curve. Concurrent with this halving, Zcash will undergo its fourth network upgrade (NU4), in which key decisions (especially re: the Founders Reward) need to be made that will shape the next four years of Zcash’s life. For those new to Zcash (not many noobs on the forum, but just in case!), the Founders Reward refers to the 20% of newly minted ZEC supply that goes towards Zcash founders and software development, with the other 80% going to miners who maintain the network’s hardware and ensure its security. This bifurcation differs from Bitcoin’s choice to allocate 100% of newly minted BTC to hardware security. The term Founders Reward is not entirely representative of how the 20% ZEC is used, as witnessed in the breakdown of Zcash’s monetary policy below: 1306×862 181 KB Right now, the default plan for NU4 is to discontinue any allocation for software development and revert to Bitcoin’s design of 100% newly issued ZEC to miners. If, however, the community decides it would prefer to continue allocating 20% of the block reward to software development during the 2nd coinbase reward epoch (totalling 5% of fully-diluted ZEC supply), then a number of decisions need to be made about the allocation and governance of those funds [1]. As ZEC coin holders, Placeholder recognizes that NU4 will be a critical upgrade for the Zcash network, and therefore have chosen to submit our thoughts about its contents. Since it’s our first “formal” participation in the Zcash community, some explanation could be helpful: While members of the Zcash and Placeholder teams have known each other for years, only in 1H 2019 did Placeholder build a position in ZEC. The timing of our ZEC purchases was market driven, but the choice to work with Zcash was underpinned by the belief that privacy will become a critical feature for users, retail and institutional, by the end of crypto’s second decade. Zcash’s privacy team is second to none amongst its cryptonetwork peers, and given the Electric Coin Company (ECC) and the Zcash Foundation (ZF) have demonstrated a credible commitment to fairly evolve network governance, participation seemed like a natural fit for Placeholder. Prior to the purchase of ZEC in the open market, Placeholder had no formal relationships with the ECC or the ZF, and nor do we plan to pursue any. We’ve been engaged in conversations with both, but are not here to pick sides. We view our interests and governance rights as identical with that of other coin holders, big and small, and hope that together we can come to agree on the best upgrades for the network. In our efforts to understand the current state of the community leading up to NU4, we found ourselves resonating with the sentiment behind Andrew Miller’s recent Notes on reaching agreement about a potential Zcash dev fund [2]. We encourage anyone who hasn’t read that to do so before proceeding here. What’s important to take from Miller’s piece is that Zcash is in a strong position after its first four years, and so we have the liberty to make clear-headed decisions in NU4. Most importantly for Placeholder, and here we echo Miller, decisions around NU4 need to be legitimate in the eyes of the community as a whole. Beyond legitimate, we also hope to be able to approach NU4 as exactly that, an upgrade. With this upgrade the community has an opportunity to re-evaluate and redesign parts of the network’s policies to work best for all members. It is only natural that, as the network matures, the optimal allocation of its resources also evolves. Optimal allocation means that funds are disbursed efficiently and with purpose, without excessive allocations to any single party, to ensure that work necessary for the long-term success of the network is appropriately compensated. If this conversation is of interest to you, it’s important you weigh in sooner rather than later, as August 31, 2019 is the deadline for Zcash Improvement Proposals (ZIPs) that want to be considered for NU4, and October 31, 2019 marks the date when the feature selection for NU4 must be completed. For network upgrade pipelines and dates, see here. Placing Zcash in Context Zcash sits comfortably in the spectrum of monetary and fiscal policy experiments currently visible in leading cryptomonies. Placeholder has taken an interest in Zcash in the context of already being highly active participants in the Decred network and passive hodlers of bitcoin. The image below depicts the differences between the three in terms of supply-side compensation: 1036×279 18.1 KB Bitcoin is the most minimalist with its incentive structure, optimizing for hardware security in the form of miners only. As witnessed in the SegWit saga and the emergence of user-activated soft-forks, governance of the Bitcoin network appears to be controlled by full node operators, though some would still contend it’s the miners with the upper hand. Zcash considers both miners and builders to be supply-siders of the network and makes room for the builder incentive by cutting miner’s incentives by 20% from Bitcoin’s benchmark. On a relative basis, between the three networks, Zcash allocates the lowest percentage of coinbase rewards to security, but it does so by allocating the most to the builders and protocol development. That means we, as ZEC holders, should be getting the most out of the Zcash builders as we are paying for it with supply inflation. To date, governance of the distribution of the builder subsidy has been transparent but without community’s participation. The controls of the ECC and the ZF are still in the process of being decentralized and encoded (the extent to which they are on-chain is still to be determined). While allocating the least to security may sound alarming, Zcash still allocates 80% of all newly minted ZEC and all transaction fees to security which, judging by the healthy hash rate growth depicted below, does not appear to be insufficient: 1600×842 172 KB Turning to Decred, it has three sets of supply-siders it compensates: the miners as with Bitcoin and Zcash, builders as with Zcash, and a new entity in the form of the stakers. Decred’s stakers put a voting check on miners per Decred’s hybrid PoW / PoS security design, and also govern protocol upgrades and disbursement of the network treasury financed by the 10% that is allocated for builders. While Zcash has a significant amount of “off-chain governance” between the ECC and the ZF, Decred has more of its governance made explicit in the code. As part of NU4, we expect Zcash to begin walking the path towards increased decentralization and governance formalization, with the ECC reducing its control and becoming one contractor among others. That said, between Bitcoin, Zcash, and Decred, Zcash’s current governance design is the most familiar to existing institutions, potentially making them more comfortable using Zcash’s public network or collaborating with the team, as evidenced by the JPMorgan research partnership. Institutions wanting to use public networks will likely need to do so while keeping transaction data private, making Zcash a natural fit. Therefore, while maintaining a more traditional governance structure may be interpreted as a systemic risk by crypto-anarchists, it might actually be a strategic advantage for Zcash and therefore should be a background point of consideration in these conversations. A side note about Zcash’s Founders Reward: we’ve noticed a tendency for polarizing conversations around the compensation of Zcash’s founders. In the hopes of de-polarizing, we will turn to numbers which we can all agree to as fact. In the 4 years leading up to this first halving, 50% of ZEC’s total supply of 21 million units will be issued, meaning Founders and Vested Employees are slated to earn 6.4% of the ZEC that will ever be in existence (50% of 12.8%). However, in June 2019, all Founders and Vested Employees took a dilution to provide more funds for protocol development (at that time ZEC was in oversold territory at $40-60 per unit, placing the ECC in an operating deficit). In total, the dilution places Founders and Vested Employees as slated to receive 5.8% of the fully-diluted ZEC, as described in detail on p. 13 of the ECC’s Q2 2019 Transparency Report. To place Zcash compensation in the context of the rest of crypto, we can use Nic Carter’s University of Edinburgh Master’s Thesis, A Cross-Sectional Overview of Cryptoasset Governance and Implications for Investors, which analyzed the launch types, founder allocations, corporate support and more, of the top 50 cryptoassets by network value on July 29, 2017. Below is a table from Nic’s cross-sectional survey, which includes Zcash and a column dedicated to investigating Founder Reserve norms [3]. In his analysis, Nic found the median for founder’s reserves to be 15% of total supply and the mean to be 19.68%, ~2.5x and ~3.4x greater than Zcash’s Founders Reward [4]. When we overlay the fact that some of Zcash’s founders have been working on digital currency implementations for longer than many crypto participants have been alive, we find complaints about their 5.8% allocation to lack perspective. 1600×1097 582 KB Lastly, for those who can’t stand the idea of more than 10% fully-diluted ZEC being allocated to funding protocol development, there is Ycash (YEC), an upcoming “friendly fork.” Slated to occur on Zcash’s 570,000th block (roughly July 18, 2019), the Ycash network “will reduce the Founders Reward rate from 20% to a perpetual 5%, which will exactly preserve the original 2.1 million coin cap on the Founders Reward.” If people believe the Ycash model is better, they are of course open to convert their ZEC into YEC. With the above as context, let’s turn to the practical decisions the Zcash community must make in the coming months. Making the Decision about the Decision As we mentioned at the beginning, it’s important to the network’s long term health that there be general consensus on the legitimacy of the decision-making process, as well as the decisions themselves. As part of a legitimate process, the community’s opinions should be collected and quantified so that the network can get a decent snapshot of its preference before NU4 decisions are made final. Obvious possibilities for gauging community preference include miner signaling, Twitter polling, email or forum surveys, but none of these information sources are trustworthy or representative enough to be binding. While using more complex voting systems such as Decred’s Politeia has been discussed, designing and implementing such a system in time for NU4 is not realistic given these decisions need to be made in the coming months. Therefore, until a more complete and credible solution is developed, the focus should be on polling as opposed to voting. The design of the polling system should be carefully considered to ensure that the outcome is as informative as possible. For example, as has already been suggested, a one-time poll in which each respondent has to choose between a potentially large number of options runs the risk of not identifying the most widely supported proposal. In theory, a series of elimination polls in which the least supported proposal is dropped after each round until only two remain would more accurately highlight the community’s preferences, all things considered. Of course, introducing such additional complexity must be weighed against technical, time and other constraints, but given the importance of the decision at hand, a basic one-time poll to gauge relative majority could be insufficient. Once polling is complete, we expect decisions about NU4 to be made via the 2-of-2 multisig controlled by the ECC and ZF. It would be preferable for the two organizations to gather and quantify community input independently, but there are practical considerations regarding community fatigue and ECC + ZF resource-constraints. Regardless of how information is gathered and quantified, we’d expect both organizations to provide public statements on the rationale behind their votes, taking into account the community’s expressed preferences. For those that may object to the 2-of-2 multisig being too centralized, we would point out that the ZF has done a “notably good job” (our words and Zooko’s) of remaining independent and avoiding governance capture by the same individuals who control the ECC. This has been clear in both public communications and private conversations we’ve had with both groups. Now that we’ve covered the process, we turn to the details of the 2020 decision. Revert to Bitcoin’s approach: 100% to miners If 100% of supply were to go to miners, then from 2020 onward the network would have opted for a rules-based monetary policy with little discretion. With no new funds coming in, there is less discussion that would need to be had about the governance of funds set aside for protocol development. Some would argue this is a strength as it leaves fewer vectors open for attack, but we think it would create more problems than it solves at this stage of Zcash’s development. Modest funds would remain on the balance sheet of the ZF, but the most important discussions would need to revolve around the path forward for protocol development as there would no longer be explicit compensation for the work being done (for ECC or anyone else). While Zooko has expressed he intends to remain committed to Zcash protocol development regardless of the outcome, the ECC would inevitably need to supplant the income that it had been receiving from coinbase rewards with diversified business models. This would inevitably pull focus and resources from Zcash R&D and maintenance. Non-block reward based, non-profit funding (e.g., donation) for development is also possible, as witnessed in Ethereum’s current MolochDAO efforts or Grin’s recent call for financial support. But as pointed out by Lane Rettig at Zcon1, Zcash’s NU4 choices placed in the context of Ethereum represents a somewhat ironic symmetry, as Ethereum is currently working through how to properly compensate their core developers precisely because they lack a recurring and native funding pool. Many other mining based networks have also turned to the donation avenue over the years, and while quality projects typically find a way to make ends meet, we do not view these situations as optimal as they tend to be resource constrained. In our opinion, therefore, reverting to Bitcoin’s approach and sacrificing block-reward funding is not the optimal path. Not only does it make Zcash look awfully similar to Ycash (putting the two more directly in competition), but it also concedes control over an available incentive pool for some of the world’s best cryptography talent to continue work on Zcash. Provided there’s proper governance over the treasury, a partial allocation of the coinbase reward to software development feels like the cleanest solution. It’s denominated in the network’s own asset, thus aligning interests better than external, fiat-denominated funding. Since the network becomes better capitalized the greater its utility and asset value, the community 's resources grow with network success. In other words, it rewards success with more resources for further success. On the other hand, if the network is hardly used and ZEC plummets in value, there will be very little value to fund development and few people that the ECC or ZF can employ-- incentive alignment! Stay the Zcash Course: 80% to miners, 20% (?) to builders, evolve fund governance In this case, 20% would continue to be allocated to protocol development, but control over these resources could be re-designed as part of NU4. In particular, areas where the governors are able to direct capital back to themselves must be given special attention, as incentives may skew towards the governors’ best interests as opposed to the network’s. One can view this as a principal-agent problem between coin holders, the ECC, and the ZF. If the community agrees with this path forward, then by the end of October 2024 (Zcash’s eighth year), 15% of the fully-diluted 21 million ZEC will have been allocated to software development, with the remaining 85% destined to be earned by miners. Of course, if a decision to extend this 20% allocation is made as the community approaches Zcash’s third coinbase reward epoch, then it would mean 17.5% of all supply would end up being allocated to protocol development. At this cadence ad infinitum, the theoretical maximum is that 20% of all ZEC supply ultimately goes to the entities behind software development. That said, as has been raised numerous times on the Zcash forum, it is still an open question of whether 20% of the coinbase reward is the right allocation for software development in the second coinbase reward epoch, or if it should be dropped to 10%, with 90% going to miners. At current market prices of ZEC, a drop to 10% when the rate of supply inflation is already getting cut in half due to the halving would place the ECC and ZF under operating constraints and require scaling back current efforts. Lastly, we would be remiss to not mention that part of the opportunity here is the ability to adjust the balance between rules and discretion in Zcash’s governance, in the hopes of solidifying its long-term legitimacy. Rules help establish time-consistent credibility of any monetary asset, while discretion optimizes for short-to-medium term flexibility. With these factors in mind, we submit the following for consideration: 20% of the coinbase reward continues to be allocated to software development, but is split into “Protocol Development” (70%) and “Growth Funds” (30%). It’s an open discussion of whether these two funds should be governed through the same or different mechanisms. Additionally, we’re not attached to the 70/30 split. In fact, better analysis of what the optimal split would be based on anticipated ECC and Zebra budgets (protocol development costs), versus anticipated demand for growth funds, would be helpful in the search for the optimal split. Should it turn out that one pool is significantly overfunded in time, there is also always the opportunity for that pool to vote part of its funds over to the other pool. Governing Protocol Development funds: We’re comfortable with this initially being governed by the aforementioned 2-of-2 ECC and ZF multisig, though encourage exploring more representative designs. Zooko’s recent Zcon1 comment that he “likes proof-of-stake” combined with active community conversation re: PoW / PoS hybrid designs, leaves open the possibility of future governance involving voting stakeholders beyond the ECC and ZF. In each period the applying teams should include key research, development, and maintenance milestones, which are not only reviewed prior to the current funding, but also returned to in the proximate funding to keep track of how credible each team has been over time. Funding should be approved on a semi-annual or annual basis to provide stability for the core development teams. It’s also possible to align each funding period with NU’s, where if a NU is delayed the team doesn’t automatically get more funding, but would have to apply for an extension with explanation of why target dates weren’t hit for that NU. Importantly, the ECC - responsible for zcashd - is not the only team that should have access to these funds. For example Zebra, a recent Rust implementation of Zcash written by the Parity team and handed over to the ZF to develop and maintain, will also require resources. Security audits and any other expenses strictly related to protocol development should also be covered by this pool. Since each approval of funding should be for a concrete USD amount, were ZEC to appreciate considerably, the developer funds could accrue significant value beyond the current cost of development. In this case, the excess ZEC would not be claimable or allocated as a bonus, but rather saved for future rounds of funding. This would address the concern around the development teams getting under- or over-funded due to swings in ZEC/USD exchange rate, and ensure a more efficient use of funds. Governing Growth funds: The governance of these funds could follow the same path and principles as that of protocol development funds, but given this represents a minority of the coinbase reward, we also believe a more experimental design could be chosen. If effective, and once hardened, such a design could then be used to also govern the “Protocol Development” funds. There’s already the ZF Grants Program, and the proposed 30% growth allocation could be routed to this existing program, which already has a defined process. If there’s appetite for experimenting beyond the 2-of-2 multisig or ZF Grants’ existing process, such experimentation could involve: A small committee of diverse and identifiable individuals with a 3-of-5 (or similar) multisig. Many examples of this exist in the crypto market today. A 2-of-3 multisig with a seat for the ECC, ZF, and aggregate coin holder vote. This is a hybrid option between the above and below, where the community serves as tiebreaker in cases where the ECC and ZF diverge. An implementation of purely on-chain voting, with Decred’s Politeia and decentralized treasury management the best example. This design is the most complex, and warrants an entire post / discussion of its own if ultimately chosen. While the cadence of decision making will vary depending on the governance design chosen, it’s important these funds be adaptive to market needs, making a quarterly decision likely the slowest desirable cadence. Ideas for growth funds are vast and fall into broad categories such as wallets, application interfaces, liquidity/exchanges, education, marketing, events, and more. The ZF has some good first blush needs here as part of its ZF Grants Program. We note that there’s the possibility for contention/confusion over where the “protocol ends and the growth begins.” For example, is the currently listed “Lightning Network integration for Zcash” a protocol fund proposal or a growth fund proposal? The potential confusion is one argument against two funds. An alternative would be to focus instead on bolstering the process around a single fund that has two focuses. Growth funds could be disbursed in the form of grants, prizes, or investments. Thus far the ZF has chosen grants as its preferred model, but for the sake of completeness we’ve included a summary of the key differences between the three below. We hope this invites more discussion from the community on what’s optimal for these funds from here on out, as a mixture of strategies can be used: Grants: individual entities apply with proposals for work they deem important and are approved/rejected before the work has been submitted. Assets go one way from the fund to the accepted team(s), and while control over funds can be metered according to milestones, there is typically little recourse in the case work is left incomplete or below expected quality. Prizes: the governing group runs competitions around needed work, with one team selected for compensation after the work has been submitted. A benefit to this approach is more work is submitted per dollar allocated, as multiple teams submit solutions to the same problem, and due to the nature of the competition incomplete work is simply not considered for compensation. Assets again go one way from the fund to the accepted team(s). Investments: individual entities are funded but assets are exchanged between the fund and the team, be they traditional equity instruments, cryptoassets, etc. While there is more governance and recourse in these arrangements, and they can compound the growth fund’s balance sheet, they also come with more complications than the other two options, which again would warrant dedicated discussion. That said, it’s common for foundations to grow or maintain their principal via investments, while concurrently doling out grants to fund mission-related efforts and meet tax obligations (more on that here). Managing the principal of the growth fund (and protocol development fund, for that matter), could be important for the long term sustainability of software development as Zcash’s rate of inflation continues to halve every four years. No further “investment allocations” to Zcash founders in the 2nd coinbase reward epoch: As already discussed, the Zcash network is four years old and those that helped get it off the ground have been sufficiently compensated with 5.8% of fully-diluted ZEC supply. We expect the process around NU4 to inform the design of standard, semi-formal methods for gathering input, measuring sentiment, and implementing the preferences of the Zcash community. While not every decision will require as formal a process as NU4, it is important to have the appropriate structures in place for future situations in which broader participation is required. There will be no excuse for not having these systems if we are at a similar crossroads leading up to Zcash’s second halving. Conclusion In the ZF’s own words, “Governance fundamentally consists of three questions: What should we do, who gets to decide, and how are the deciders chosen and held accountable?” As we ponder Zcash’s next four years, everything boils down to answering these three questions in a way that the community as a whole accepts as legitimate. If the above proposal is well received, there’s the possibility Placeholder converts it into a ZIP, incorporating community feedback in the process. If this came to pass, it would be our preference to collaborate with others on the ZIP (or hand over the ZIP entirely). We’ve never navigated the ZIP process before, which feels less than ideal given the gravity of the decisions that are likely to be made. Thanks for reading to the end, and let the discussion continue! Footnotes: [1] A coinbase reward does not refer to the company, Coinbase, but rather to the coins issued as reward for new block production. The term block reward is more common, though the two are not synonymous. A block reward refers to both the coinbase reward and the transaction fees associated with the transactions included in a given block. This paper is primarily concerned with the coinbase reward, not the block reward, as we believe miners should continue to receive all transaction fees, though there has been some discussion on the Zcash forum about using transaction fees to finance software development. [2] Andrew Miller is an Associate Professor at the University of Illinois in Electrical and Computer Engineering, Associate Director of the Initiative for Cryptocurrencies and Contracts (IC3) and a board member of the Zcash Foundation. [3] The Zcash column for Founder Reserve reads 0% in Nic’s report but in reality should be 5.8% – for a future college student to incorporate [4] Not even pure mining networks can always claim a more equitable distribution than Zcash. Especially as earlier in crypto’s history (when lots of the currently dominant cryptomonies were born), pioneering miners or founders would amass large amounts of the coin by mining extremely early or before broader release. These positions sometimes represented double-digit percentages of fully-diluted supply, and the network received little in compensation beyond a massive mining whale or covertly enriched founder(s). 2 Replies 20 ​ Dev Fund Proposal: 20% to a 2-of-3 multisig with community-involved governance Dev Fund Proposal: 5-Entity Strategic Council Approach Proposal for the Zcash 2020 Network Upgrade Future of Zcash dev funding — megathread / everything in one place Moving the Dev Fund discussion forward 20.8k views 121 likes 29 links 14 users 11 9 9 6 6 read 44 min Top replies boxalex 1 Jul 2019 As you formulated and wrote a very well written proposal, or condiderations as you name it i hope it’s ok to ask some questions and comment. cburniske: A side note about Zcash’s Founders Reward : we’ve noticed a tendency for polarizing conversations around the compensation of Zcash’s founders. In the hopes of de-polarizing, we will turn to numbers which we can all agree to as fact. In the 4 years leading up to this first halving, 50% of ZEC’s total supply of 21 million units will be issued, meaning Founders and Vested Employees are slated to earn 6.4% of the ZEC that will ever be in existence (50% of 12.8%). However, in June 2019, all Founders and Vested Employees took a dilution to provide more funds for protocol development (at that time ZEC was in oversold territory at $40-60 per unit, placing the ECC in an operating deficit). In total, the dilution places Founders and Vested Employees as slated to receive 5.8% of the fully-diluted ZEC, as described in detail on p. 13 of the 1.) Currently with the Founders Reward the Founders/Employees receive the Founders Reward and than donate a percentage to the ECC. In my opinion this is an interesting experiment but it has more flaws than it has positive points. What would be the distribution of a new developement reward? Same? 2.) Isn’t it of any concern for “placeholder” that there is an ongoing law suite with an ex-employee where shares/distribution of the Founders reward is part of it? And of course the dilution of the founders reward towards ECC? cburniske: Below is a table from Nic’s cross-sectional survey, which includes Zcash and a column dedicated to investigating Founder Reserve norms [3]. In his analysis, Nic found the median for founder’s reserves to be 15% of total supply and the mean to be 19.68%, ~2.5x and ~3.4x greater than Zcash’s Founders Reward [4]. When we overlay the fact that some of Zcash’s founders have been working on digital currency implementations for longer than many crypto participants have been alive, we find complaints about their 5.8% allocation to lack perspective. Nic’s whole research is a must read and we can find a lot of usefull information there, without doubt. But there is as well a lack of deeper or wider research, mostly because it’s from 2017. Some questions that arise with the cross -sectional survey I and II are: it doesn’t sum up how much a given founders reward, ICO, whatever funding, has generated in US$. Means in theory a given ICO at the start of 50% (just as an example) could have generated $10M for example, but a 5% continous Block Reward (Founders Reward) could have generated $500M. As ssaid, just as an example. This means while the percentage of Nic’s Chart than back have been mostly correct than back it doesn’t tell us anything about the amount of funds a development team has received to reach it’s target. Without this factor this chart has only limited value. cburniske: Lastly, for those who can’t stand the idea of more than 10% fully-diluted ZEC being allocated to funding protocol development, there is Ycash (YEC), an upcoming “friendly fork.” Slated to occur on Zcash’s 570,000th block (roughly July 18, 2019), the Ycash network “will reduce the Founders Reward rate from 20% to a perpetual 5%, which will exactly preserve the original 2.1 million coin cap on the Founders Reward.” If people believe the Ycash model is better, they are of course open to convert their ZEC into YEC. It’s not that easy for the community. Just because someone or a group of people doesn’t like the whole idea of a contioued dev fee, and/or propose to consider other funding sources or even a hybrid mix of different proposals as well shouldn’t mean exactly the Ycash one-man-show should be the alternative. cburniske: The design of the polling system should be carefully considered to ensure that the outcome is as informative as possible. For example, as has already been suggested, a one-time poll in which each respondent has to choose between a potentially large number of options runs the risk of not identifying the most widely supported proposal. In theory, a series of elimination polls in which the least supported proposal is dropped after each round until only two remain would more accurately highlight the community’s preferences, all things considered. Of course, introducing such additional complexity must be weighed against technical, time and other constraints, but given the importance of the decision at hand, a basic one-time poll to gauge relative majority could be insufficient. +1, absolutly agree on this one. This should be a MUST having in mind the importance of such decision. cburniske: Not only does it make Zcash look awfully similar to Ycash (putting the two more directly in competition), A project without own tech can’t be called competition seriously. Just as a sidenote. If you replace Ycash with another privacy project and own tech like Monero i fully agree of course. cburniske: Provided there’s proper governance over the treasury, a partial allocation of the coinbase reward to software development feels like the cleanest solution. How is this provided and controlled havine a for-profit company as the recepient with limited transparency? An important factor in the whole dev fee discussion (at least for some). Why not the foundation with bigger transparency options having the recepient and having the foundation allocating needed funds to the ECC? What are the arguments against this variation to ensure proper governance over treasury and control from/through the community? cburniske: or if it should be dropped to 10%, with 90% going to miners. At current market prices of ZEC, a drop to 10% when the rate of supply inflation is already getting cut in half due to the halving would place the ECC and ZF under operating constraints and require scaling back current efforts. There are several points why i don’t fully agree to this argument: When the ECC run with a deficit the ZEC exchange rate was $60 or lower if i remember right, currently we are $100. With the current Founders Reward there are expenses that shouldn’t be anymore the case with the new dev free, for example advisor, early founders and so on … This should mean more funds in % are available for the ECC development anyway compared to the current situation with the Founders Reward. The halving won’t cut only block rewards, there is a big chance, even i’am not yet a believer of this, that the effect would/could be compensated by a price rise. Or at least partially, which again would lead to at leat partially more funds available for the ECC even if it’s just 10% or any given number. Of course we do not know where the price goes so it could work out either way. Having way too much funds available or not enough funds. Wouldn’t here some kind of dynamic funding system versus US$ fit better and have the ECC safe? For example the Dev Fund gets adjusted monthly and correspondents to a $1M value per month from the generated dev fund. $1M can be replaced with whatever value the community thinks is fine. cburniske: Lastly, we would be remiss to not mention that part of the opportunity here is the ability to adjust the balance between rules and discretion in Zcash’s governance Makes me remind Nic’s figure 4: NIC-Governance-Figure41227×510 54.7 KB Any improvement to this governance model or should it stay like this? cburniske: We’ve never navigated the ZIP process before, which feels less than ideal given the gravity of the decisions that are likely to be made. +1, absolutly agree on this one!!! cburniske: Thanks for reading to the end, and let the discussion continue! It was an interesting read for sure, no matter i don’t agree to some points or have some concerns, much if not most makes just sense. Interesting to see if there will be indeed a discussion. 1 Reply 5 ​ nathan-at-least Jul 2019 Hi @cburniske, thank you for contributing to the Zcash community! This is an excellent post and I really appreciate how you’ve positioned Zcash within the ecosystem for context. I hear you that participating in the ZIP process seems like it may be too heavyweight or involved. In fact, that’s a concern expressed in many of the dev-fund related proposals found in the protocol proposals section of the Forum. One of my intentions is to ensure that we don’t let the ZIP process be a barrier to anyone in the community formulating and advocating for their own proposals, so we’ll be reaching back out to you and other proposers to simplify and clarify that process. 1 Reply 3 ​ cburniske 1 Jul 2019 Thank you for these. Below I address most all of them, in order: boxalex: 1.) Currently with the Founders Reward the Founders/Employees receive the Founders Reward and than donate a percentage to the ECC. In my opinion this is an interesting experiment but it has more flaws than it has positive points. What would be the distribution of a new developement reward? Same? The distribution of a new development reward could be 70% Protocol Development Fund (2 of 2 multisig for now), 30% Growth Fund (2 of 2 multisig or sleeved into ZF Grants Process, with more experimental structures available). The 70% Protocol Development will be open for ECC to apply to, as well as the team from the ZF that maintains Zebra, not to mention any other full node implementations in alternative languages. As mentioned in the doc, “Security audits and any other expenses strictly related to protocol development should also be covered by this pool,” which is likely another independent set of entities. The 30% Growth Fund is then even more widely available to the public, with Decred’s Politeia as a good example of what is possible here (sans the protocol / Company0 proposals that go through Politeia). (this is all described in more detail in the Stay the Zcash Course: 80% to miners, 20% (?) to builders, evolve fund governance section) boxalex: 2.) Isn’t it of any concern for “placeholder” that there is an ongoing law suite with an ex-employee where shares/distribution of the Founders reward is part of it? And of course the dilution of the founders reward towards ECC? We can discuss with the ECC the current state of affairs, but atm this is not a concern. Nic Carter’s Research Re: your points for improvements of Nic’s cross-sectional survey, I appreciate the thoroughness but am going to leave that conversation for elsewhere boxalex: It’s not that easy for the community. Just because someone or a group of people doesn’t like the whole idea of a contioued dev fee, and/or propose to consider other funding sources or even a hybrid mix of different proposals as well shouldn’t mean exactly the Ycash one-man-show should be the alternative. Fair enough, I agree a community divorce/fork is tough and shouldn’t be referenced as an option as casually as I did. boxalex: +1, absolutly agree on this one. This should be a MUST having in mind the importance of such decision. cburniske: We agree. IMO the series of elimination polls for boiling down to the community’s proposal of choice is one of the most important recommendations we make about a practical yet accurate approach to distilling the community’s preference**** Wasn’t my suggestion, was Mario’s (Placeholeder’s Governance Researcher), who may have got it from somewhere else… boxalex: How is this provided and controlled havine a for-profit company as the recepient with limited transparency? An important factor in the whole dev fee discussion (at least for some). Why not the foundation with bigger transparency options having the recepient and having the foundation allocating needed funds to the ECC? What are the arguments against this variation to ensure proper governance over treasury and control from/through the community? For legal reasons the ZF does not want sole discretion over the movement of the network’s funds, therefore it has to at least be a two signature situation. We think having the ZF and ECC vote together is better than just the ECC, and do not believe the ECC has “captured the ZF.” In cases where there is a similar Foundation + for-profit Core Company structure in crypto (which we all know is common after 2017!), Zcash’s Foundation is one of the most independent Foundations I’ve encountered in crypto Beyond that though, you are getting at important points. I do think we should push for the Growth Funds to be more decentralized in their governance first (with a path to on-chain voting?), and then move on to further decentralized the Protocol Funds second (perhaps with the Growth Fund model which has by that time been hardened within the Zcash system). Part of Placeholder’s push in this proposal is precisely to increase the controls and transparency of resource flows within Zcash. This is not to knock the effort thus far, ongoing examples (with the Q2 2019 Transparency Report a good recent one) are part of what convinced the Placeholder team that the ECC and ZF are committed to credibly evolving the governance and transparency of the system over time, and thus got us involved. boxalex: There are several points why i don’t fully agree to this argument: When the ECC run with a deficit the ZEC exchange rate was $60 or lower if i remember right, currently we are $100. With the current Founders Reward there are expenses that shouldn’t be anymore the case with the new dev free, for example advisor, early founders and so on … This should mean more funds in % are available for the ECC development anyway compared to the current situation with the Founders Reward. The halving won’t cut only block rewards, there is a big chance, even i’am not yet a believer of this, that the effect would/could be compensated by a price rise. Or at least partially, which again would lead to at leat partially more funds available for the ECC even if it’s just 10% or any given number. Of course we do not know where the price goes so it could work out either way. Having way too much funds available or not enough funds. Wouldn’t here some kind of dynamic funding system versus US$ fit better and have the ECC safe? For example the Dev Fund gets adjusted monthly and correspondents to a $1M value per month from the generated dev fund. $1M can be replaced with whatever value the community thinks is fine. You raise a few points but they all seem to boil down to fear about an inefficient allocation of ZEC (either deficiency or excess). I think it’s an interesting idea to have a dynamic monetary policy based on USD spend of the different entities tapping the funding pool(s). That said, my fear at this stage is dynamic but automated monetary policies are still at the forefront of research and I’m not sure that this coinbase reward epoch is the right one to try to implement such an approach. But maybe funds could be allocated from the Growth Fund to R&D around this effort (or would it come from the Protocol Fund? Guess it’s at the applicants discretion…) A second option, though not as nifty as yours, is the fixed division of resources again between hardware (miners) and software development (builders). I like sticking with this (for now) for its simplicity, and also time-consistent assurance to different economic agents (this includes both the miners and builders) of the resources they stand to gain from contributing to the system. We cannot possibly speculate on ZEC’s price with precision, but we can know the budget of the teams pretty well in advance in USD terms. My thinking is after each period, and in a macro sense at the end of the 2nd coinbase reward epoch, if there is a situation where either fund has leftover ZEC, then it will just roll over into future years of allocation. The funds are never zeroed out (nor are “investment allocations” given past this 1st coinbase reward epoch, as we reference). I think it would be healthy if we start to think of and work towards these funds as endowments - eventually they need to be designed to compound capital, dole out interest without drawing down the principal, and support Zcash for decades (centuries?) to come. boxalex: Makes me remind Nic’s figure 4: NIC-Governance-Figure4.jpg1227×510 54.7 KB Any improvement to this governance model or should it stay like this? Love this graphic, think it can be a helpful reference as we work towards NU4, but FWIW I don’t think Zcash is a benevolent dictatorship. As much as Zooko is revered in crypto, there are a lot of rockstars on the Zcash team, and as noted prior, the ZF is stolidly independent. Okay, I think that’s everything of greatest relevance (for now) - thanks @boxalex! 5 Replies 6 ​ cburniske nathan-at-least Jul 2019 thanks @nathan-at-least! we’re happy to explore the ZIP process, but also don’t want to jam anything up on account of being relative noobs to the Zcash process. That said, if you could have DC connect us via email that would be great. 3 ​ sonya Jul 2019 Chris, the ZIP process is described in depth here: zips/zip-0000.rst at main · zcash/zips · GitHub It’s a lot to dig into, but pretty thorough. Please let us (the community) and the ZIP editors (zips@z.cash) know what your questions are, or if anything is unclear in ZIP 0! The ZIP on-boarding experience definitely has room for improvement, especially now that more people will be participating in the creation and evaluation of ZIPs. In fact, I just opened a PR to add a link to ZIP 0 to the readme. cc @daira @acityinohio (the current ZIP editors) 2 Replies 2 ​ mistfpgaRegular Jul 2019 I am currently working on a template. should hopefully be ready in a couple of days. It is going to be based off feedback I have received from the ECC, other zips and the RUST model. Am I wasting my time? I was going to collate a post that could hopefully be pinned that tells people what is needed to write a zip. (like going into detail about rfc language and why it is important, how to use it, etc) the post will be specifically designed for non technical people to be able to express their ideas and directly compare them to others. And remove a lot of the ‘heavy lifting’ of getting to grips with the zip process from a community standpoint. This post is a basic outline. of the format, but I have not made the template yet. (and wont for at least a day) ZIP Proposal - 8-15% Opt-in or 4-7.5% Mandatory Dev Free |75% Zcash Foundation 25% ECC| - #20 by mistfpga @daira @acityinohio Should I still continue? or wait? Thanks, Steve 2 Replies 3 ​ cburniske Jul 2019 will do, thanks sonya. sonya: In fact, I just opened a PR to add a link to ZIP 0 to the readme. love this! 1 ​ cburniske mistfpga Jul 2019 i shouldn’t be the final authority here, but so long as the work is not duplicative it sounds helpful. on the duplicative part, i would follow up with sonya per mention of intro materials in ZIP 0. 2 ​ sonya mistfpga Jul 2019 I think a “crash course on the ZIP process” guide would be incredibly helpful, even if it overlapped with ZIP 0. I would be happy to offer feedback or contribute, when / if you’re ready for more input! 2 ​ McKie Jul 2019 Just want to ACK that we agree with your sentiments here at Amentum, Chris. And too have amassed a holding of ZEC over the last year of our operation during ideal market conditions. We look forward to reading others feedback. 5 ​ boxalex Jul 2019 A follow up and some more thoughts on your answers/comments: cburniske: The distribution of a new development reward could be 70% Protocol Development Fund (2 of 2 multisig for now), 30% Growth Fund (2 of 2 multisig or sleeved into ZF Grants Process, with more experimental structures available). The 70% Protocol Development will be open for ECC to apply to, as well as the team from the ZF that maintains Zebra, not to mention any other full node implementations in alternative languages. As mentioned in the doc, “Security audits and any other expenses strictly related to protocol development should also be covered by this pool,” which is likely another independent set of entities. The 30% Growth Fund is then even more widely available to the public, with Decred’s Politeia as a good example of what is possible here (sans the protocol / Company0 proposals that go through Politeia). (this is all described in more detail in the Stay the Zcash Course: 80% to miners, 20% (?) to builders, evolve fund governance section) Seeems on this point, due my bad non-native-English we speak about different things. What i have in mind is how the current founders reward is distributed: \\==> Block reward % goes to a Zcash adress \\==> from the Zcash adress it’s distributed to the different recepients, founders, employees, whomemver. \\==> From exactly these founders, employees, whomever ECC gets the “donations” or funding. That’s my impression how it currently works and in my book this is an absolutly wrong setup. Or in case you exactly have this in mind the the protocol change should modified and 70% go to Protocol Development and 30% to Growth Fund by default? Still, who will be in charge to decide what gets used for what? cburniske: We can discuss with the ECC the current state of affairs, but atm this is not a concern. Seriously? A multi-million dollar on-going lawsuite is not a concern? Just in case the law-suite is begin lost others could follow and this should at very least be a concern in my opinion. And in case one or more such law-suites are lost in future, who is paying these multi-million dollar fines/compensations? cburniske: Re: your points for improvements of Nic’s cross-sectional survey, I appreciate the thoroughness but am going to leave that conversation for elsewhere Why? It’s your chart you posted with the funding percentages and comparision to other project. But it’s less than half of the story to use NIC’s numbers without US$ conversations in how much a given funding has generated. Interesting enough we have no clear confirmed numbers on how much funds the ongoing FR has allready generated and my personal calculation/estiminate that it will have generated at current exchange rate (for the outstanding period) at least $300M, mostly around $400 is just that, an estiminate. This raises some questions: How many crypto projects are you/we aware that have ~$300-$400M raised within 4 years? Was/is the current Founders Reward really distributed good enough to favour R&D, the product itsellf and development or should this be improved. Avoiding this question automaticly leads to unability to improve whatever. My personal opinion is that it’s at least strange to talk about a new dev fee or modified founders reward without analyzing the current one. And you has a financial investment company for sure have done such analysis allready, but i guess that this point doesn’t favour the discussion with a 20% new fee. cburniske: We agree. IMO the series of elimination polls for boiling down to the community’s proposal of choice is one of the most important recommendations we make about a practical yet accurate approach to distilling the community’s preference**** Wasn’t my suggestion, was Mario’s (Placeholeder’s Governance Researcher), who may have got it from somewhere else… Not that this matters, but it was my suggestion in another proposal to use this kind of election to get the best result (you even linked it in your first post). However, even such very fair “election process” isn’t worth 2 cents if for-up the opinion gets manipulated. In my opinion posting your and only your proposal on the 76k followers Twitter account of the ECC is not fair towards all other proposals and someone can allready consider this manipulation of opinios to get a higher support for a given proposal. This said, the best election process is worth nothing if things are decided (manipulated) from start. cburniske: For legal reasons the ZF does not want sole discretion over the movement of the network’s funds, therefore it has to at least be a two signature situation. I didn’t read such statement yet, even more suprising not in my own proposal which has the foundation as the whole recepient of a new dev fee. IF this is true than: 1.) At least this should have mentioned allready in my proposal which favours the Foundation as the recepient. 2.) Some people know way more than the forum community. And of course some following questions in this scenario, do we need a foundation than at all if the foundation itself wants only very limited (legal) responsibility and accountness. I mean if the whole role of the foundation is just or mainly here and there some grant approving than this could be implented as well in the ECC and at least safe some funds. I could discuss this point further but this would go into another thematic mostly, but it’s worth thinking about if the foundation should have more control than now over funds or not in the name of more transparency, fairer distribution and eventually even generating competition with the Zcash projects development. cburniske: Part of Placeholder’s push in this proposal is precisely to increase the controls and transparency of resource flows within Zcash. This is not to knock the effort thus far, ongoing examples (with the Q2 2019 Transparency Report a good recent one) are part of what convinced the Placeholder team that the ECC and ZF are committed to credibly evolving the governance and transparency of the system over time, and thus got us involved. Why over time and not within the introduction of a new def fee or even bevor? One of my main concerns is that there is lacking whatever control on how funds are used and as stated even more as we talk here about a for-profit-company which leaves less possibilities for transparency and control than a foundation in principe. So what’s the idea on how to improve transparency and control further with a new dev fund? cburniske: Love this graphic, think it can be a helpful reference as we work towards NU4, but FWIW I don’t think Zcash is a benevolent dictatorship. As much as Zooko is revered in crypto, there are a lot of rockstars on the Zcash team, and as noted prior, the ZF is stolidly independent. If we have to choose from this figure there are only 2 options that would fit the current State of Zcash governance. Either it’s a Corporate control (which in my opinion as well fits better) or it’s a benevolent dictatorship. The ZF doesn’t play a role here in my opinion as it has no direct influence at all on any Zcash decision. At best some day maybe they could be something decision-influencing but until that point their independence doesn’t affect anything at all. Final word: Congratulations. Your indeed well written proposal that for sure will convince a lot of people and with the help of the 76k ECC twitter account and spreading this exact proposal i doubt there are any problems in having it accepted by the wider community…Someone has to admit it’s a professional job in pushing something through… 4 Replies 1 ​ str4dElectric Coin Company Jul 2019 [quote=\"boxalex, post:12, topic:34045] cburniske: For legal reasons the ZF does not want sole discretion over the movement of the network’s funds, therefore it has to at least be a two signature situation. I didn’t read such statement yet, even more suprising not in my own proposal which has the foundation as the whole recepient of a new dev fee. IF this is true than: 1.) At least this should have mentioned allready in my proposal which favours the Foundation as the recepient. 2.) Some people know way more than the forum community. [/quote] Here’s a link to the statement, which was made directly to the forum community: The future of Zcash in the year 2020 General Thanks for tagging me @sonya; yes, I think any proposal that has the Foundation receiving all funds (even if there are contracts in place for development) could jeopardize broader decentralization, and as you suggested I wouldn’t want the Foundation to be a single gatekeeper. And thanks to @zooko for his post above and giving the community his perspective. The Foundation would only support proposals that: a) don’t rely on the Foundation being a single gatekeeper of funds b) don’t change the u… ​ boxalex Jul 2019 cburniske: For legal reasons the ZF does not want sole discretion over the movement of the network’s funds, therefore it has to at least be a two signature situation. I got aware allready about the Foundations stance of this: The Foundation would only support proposals that: a) don’t rely on the Foundation being a single gatekeeper of funds b) don’t change the upper bound of ZEC supply and c) have some kind of opt in mechanism for choosing to disburse funds (from miners and/or users) Will be interesting to see what the foundations stance is as there are not many proposals with an opt-in mechanism… And this one is lacking one as well… ​ sonya Jul 2019 boxalex: The ZF doesn’t play a role here in my opinion as it has no direct influence at all on any Zcash decision. At best some day maybe they could be something decision-influencing but until that point their independence doesn’t affect anything at all. This is incorrect since one of the ZIP editors represents the Zcash Foundation. We have an effective veto on protocol changes, and it would be pretty disastrous in terms of reputation for ECC to go around the ZIP process after committing to it publicly. Granted, once a trademark agreement is in place, that will carry more legal weight. 1 Reply 3 ​ mistfpgaRegular 1 Jul 2019 Hi, Welcome to the forums. As you stated this is a contentious topic, I hope you can appreciate my frustration with the situation, it is not directed at you. Having said that though it has reached a point where I need to take a step back for the politics and concentrate on writing the proposals, and my work on RandomX. I will be around to reply to things but less opinion. You have brought some very good ideas to the table and I really do not want to discourage you. I would like to pick up on one point in particular in your post/proposal. This is more to clear things up for the newbies and people who might be drawn here by your post. cburniske: Right now, the default plan for NU4 is to discontinue any allocation for software development and revert to Bitcoin’s design of 100% newly issued ZEC to miners. If, however, the community decides it would prefer to continue allocating 20% of the block reward to software development during the 2nd coinbase reward epoch (totalling 5% of fully-diluted ZEC supply), then a number of decisions need to be made about the allocation and governance of those funds The way you have framed this argument saddens me. You seem to understand crypto currency on a deep level, so I am not sure why you would phrase that the way you have. The argument against a continual development fund from block distribution is a strong one: There was a promise that was made by the ECC was that after 4 years they would no longer received 10% of the total mineable supply of zec from block distribution (not block reward, block distribution) and all block distribution will go to miners (this is baked into the protocol like bitcoin) This is not a 20% tax it is a 10% tax frontloaded to be 20% there is a important distinction. Any adjustment to block distribution would be being taxed twice, for supporting the network and processing transactions, i get to pay twice and enrich everyone else. There was a promise that their will be an emission curve and that curve was set in stone (by algo, like bitcoin) There was a promise that the total number of issued zec would be 21 million (fixed cap like bitcoin) There was a promise of finacial privacy If zcash can break one of the 4 pillars, then how can they be trusted not to break others? edit: zcash in the sentence above is a reference to the technology and community. not the ECC. I wanted to make this point doubly clear because my post is aimed at more of the newer crowd who might not be as aware of the difference. There was no mention of any form of ability to change these rules via community consesus. There is a mechasim via zip’s but they are not decided upon by community consensus. No one votes on zips. That would be a crazy way to run a company. There is no definition of who or what the community is I cannot stress enough how there is no mechanism for people to come to a consensus, zec simply isnt designed like that. Could we use the same consensus mechanism for changing emission? how about depreciating z-addresses? These things have to be fundamentals right? So we can never have voting - bitcoin got that right completely by accident. (the 1 cpu 1 vote design is broken) I am not trying to be negative, but these are real issues that are stopping this from progressing any further. The best we have so far is some really good suggestions from zooko about implementation aspects of possible ideas whatever ideas they maybe However once you think about any one of the points he has raised with any one of the ‘change things ideas’ then, the downstream impact on the rest of the community (exchanges, mining pools, miners, people who accept for value) is so non trivial things start to melt (like my mind) cburniske: We agree. IMO the series of elimination polls As someone who lives in a country that is governed by such a mechanism. It doesn’t work. Look at Brexit and the elimination polls in the house of commons. (not rigged - no outcome) Then look at the tory pary leadership, (that was rigged). boris was always going to win but Gove was the best candidate against him, Boris out right stated he got his voters to back hunt so he wouldnt have to face Gove in the final race. (Hunt was never going to win gove had an outside chance, similar things happened in every round of that selection process) With this mechanism, with a zip like “Dont change things” it will lose in the first round, it only benefits one kind of change, it doesn’t benefit changes that do not make changes. What this boils down to is I did not opt-in [as I was made fully aware of what I did and did not opt-in to in the ASIC war of 2018] to having the rules changed after they are set in motion. cburniske: We’ve never navigated the ZIP process before, which feels less than ideal given the gravity of the decisions that are likely to be made. welcome to our world. none of us have. Sonya has started a megathread (that was on my todo list - only just got regular status back to enable me to do it though), that with daira and str4ds ideas on my proposal I think will help everyone be able to use their voice. All voices have to have the same weight. No voting, no polling, only voices. I am trying to write a zip that says we dont need voting, then people are going to vote on it. How does that work? (I shake my head and go do something else every time i try to type it up) Please dont flippantly dismiss my opinions by just saying “go play with yec” - I didnt opt-in to yec, i opted into zec. (I saw you already apologised, its just a very hot topic at the moment) Thanks for your time. 2 Replies 3 ​ cburniske Jul 2019 thank you for the thoughtfulness @mistfpga out of curiosity, are you a miner? couldn’t help but notice your name includes FPGA to address some of the good concerns you laid out: mistfpga: If zcash can break one of the 4 pillars, then how can they be trusted not to break others? this speaks directly to the points i tried to make around legitimacy. legitimacy and trust can be used interchangeably here, and both are built over time by adhering to a community-endorsed decision-making framework (ie, governance). that framework can choose to balance rules and discretion, so long as it is time-consistent. i’m of the opinion that strictly rules-based frameworks are likely too inflexible (except for maybe bitcoin) to allow most cryptonetworks to optimally innovate and adapt to market opportunities. therefore, zcash is currently in the search for its governance balance between rules and discretion. i can see some people feeling violated if they felt the “2016 launch promise” was that 4 years later zcash would fall in line with bitcoin and move forward with a rules-based system, because this very conversation violates that perceived promise. the PoV i’m most sympathetic to here is a miner’s, which is partly why i asked if you were a miner that said, 2019 is not 2016, and i think our learnings over the last 3 years need to be incorporated into how we govern and evolve zcash - there is no reason in attempting to be bitcoin. imo bitcoin has already won as the reserve asset of crypto, and its strategy cannot be replicated, because its strategy involved birthing the entire crypto space (and being the first asset to price all other cryptoassets). if we can set in place the right governance framework, and one which the community largely agrees with, then we can agree on using that process to make all future decisions. so long as that process is adhered to, with plenty of checks-and-balances to counteract human nature, we can have trust in it. but until we agree on the process, we will always have contention like what we’re currently facing. if you look at decred, for example, there is less contention because everyone is clear on what the process is for making new decisions. mistfpga: I cannot stress enough how there is no mechanism for people to come to a consensus, zec simply isnt designed like that. Could we use the same consensus mechanism for changing emission? how about depreciating z-addresses? These things have to be fundamentals right? So we can never have voting - bitcoin got that right completely by accident. (the 1 cpu 1 vote design is broken) much of my response above is applicable here, but to summarize: right now there is no mechanism for people to come to consensus on such changes, but that may not always be the case for zcash - and to be very frank, i wouldn’t be here if i didn’t think the ECC + ZF was moving towards formalizing means for people to come to consensus on these very contentious decisions. the way i see it, decisions will always need to be made. one of the biggest first decisions that must be made is how the decisions will be made. choosing to not make a decision about how decisions are made, is a decision in itself, and typically one with messy results. given what bitcoin is, it’s been able to get away without much of a decision-making framework, but that doesn’t mean other projects will be able to so successfully do the same. agree though that the downstream impacts are serious and hence any implementations here cannot be taken lightly. mistfpga: We agree. IMO the series of elimination polls As someone who lives in a country that is governed by such a mechanism. It doesn’t work. Look at Brexit and the elimination polls in the house of commons. (not rigged - no outcome) i’ll let @mlphresearch weigh in here as he has more background in the topic than i do. mistfpga: Please dont flippantly dismiss my opinions by just saying “go play with yec” - I didnt opt-in to yec, i opted into zec. (I saw you already apologised, its just a very hot topic at the moment) i appreciate your opinions and am sorry for the discomfort this process is causing you. 2 Replies 4 ​ mistfpgaRegular Jul 2019 Hi, Sorry I do not address a lot of the governance stuff, that is beyond my skill level. cburniske: out of curiosity, are you a miner? couldn’t help but notice your name includes FPGA Yes I mine Monero. I am primarily in this for the tech though. I have been in cryptography since before bitcoin was a twinkle in statoshis eye (hashcash was the first project that I took notice of in the kind of crypto currency sphere) I am not that involved with the monero community though, ring signatures don’t really interest me that much. I am glad they were proven secure (although I cant find that paper now) ZK proofs, that really does interest me, it could fundamentally change how cryptography works. The FPGA in my name refers to the initial bitcoin fpga another member and myself started (miSt FPGA - the St is for steve) but the teams speciality is in hardware cryptography and bespoke devices. (it is more than just me) cburniske: this speaks directly to the points i tried to make around legitimacy. legitimacy and trust can be used interchangeably here, and both are built over time Partially quoting you. Because my interest is from a technical perspective legitimacy is sticking to the rules. It is why this governance stuff is so tricky for me. I get a bit personally invested, and I don’t want to have to be involved. I have more interesting things to do, like play with NoBL Sram , RandomX, Hardware wallets, reverse engineering bugs, etc. It just upsets me from time to time when I see talk of “oh we can change this, or that” The Times 03/Jan/2009 Chancellor on brink of second bailout for banks This is why I got involved in the very first place. cburniske: because this very conversation violates that perceived promise. the PoV i’m most sympathetic to here is a miner’s, which is partly why i asked if you were a miner Yes this is the point of view I am coming from. In numbers we trust. but don’t get me wrong I am not salty about it. I have offered to write up proposals and help with all proposals that people ask me for, I may not agree with it but everyone should have a voice and have a chance to get that voice heard. - if the thing stopping that is time or not knowing the right format/language then I can and will help. I was disappointed that I could no longer mine zec and the implications that ASIC’s reduce the ability of the network to dynamically adapt, potentially limiting the technology. cburniske: the way i see it, decisions will always need to be made. I agree, and they should be made by a benevolent dictator. I thought we would have moved to that being the foundation by this point. I really am not good at governance or finance. So I will leave that for others to work out. All my proposals will be governance less. I don’t have the skillset to deal with it. cburniske: i appreciate your opinions and am sorry for the discomfort this process is causing you. heheh, it is not you its me - I think the issue more was you declared a large holding in zec, which would make you a large holder of yec, so telling people to mine yec might not have been the best idea to an already contentious subject. suggesting monero whilst it might have seemed strange it was exactly what zooko did in the asic thread [that was before yec though] I hope this gives you a bit more insight in to where I am coming from and why I hold my positions. 4 ​ mistfpgaRegular 1 Jul 2019 Hi, Sorry for the double post. but the edit got too long and it seemed better to make a new post. @cburniske In my last post, I didn’t mean my initial statement to come off as flippant. I had read your proposals and ideas in depth, and I like them and what you bring to the table. I just don’t feel I can comment on them and add value, I just don’t understand it enough. which is why it is good that we have people that do. hopefully my last post explained my simplistic stance. My main reason for posting this new message was to ask do your plans for governance include what will be in NU4 - or are they for NU5 - because funding needs to be worked out for NU4 and that deadline is in 6 weeks. Given that timeframe, and experience, what would you think would be the best course of action? My best attempt is over here. Please read zookos responses at the end of the thread, they brought whole new insight onto this issue for me. Emergency extention to a select part to NU4 inclusions RE dev fund General Hi, @moderators, @zooko, @nathan-at-least Please may we have an extension on what gets included into NU4 regarding the development fund. It is clear that across the community there is broad consensus that zcash will need continual funding. How and where this funding comes from and where it goes to is still a talking point. When Shawn first raised this thread (about 7 months ago) Zooko stated that he felt it a conflict of interest for the ECC to get involved with the discussion of continual f… I would really like your feedback or input. Or anyone’s for that matter. Governance will be important. I just don’t want to have to vote, especially on the future outcome of a private company. So I really hope those who know about this stuff can work something out. Please check out that thread. Hopefully you will see I am not anti funding ECC I am anti breaking core values. I think my stance is pretty much the same as the foundations. I believe both can be achieved without the need for voting. Mainly through a true opt-in protocol level adjustment. Greatly simplifying the issue for downstream and users. (primarily because of my limited understanding governance). But we now have greater community engagement again, after the topic going a bit stale for a week or so and people might get reinvigorated in funding ideas. cburniske: there is no reason in attempting to be bitcoin. imo bitcoin has already won as the reserve asset of crypto, and its strategy cannot be replicated, because its strategy involved birthing the entire crypto space I have been thinking about this, and yes I agree to an extent. bitcoin is the coin to hold. However I believe that strategy could be replicated, in the sense of distribution of coins. One thing bitcoin did was get lots of coins out to lots of people quickly. If you can keep ASICS off your network for 2 halving’s then I think you will be safe as a legitimate assets store of value, or whatever the right word is. but this is just speculation and probably out of scope. Get it in as many hands as possible and you are in the right place. 1 Reply 1 ​ mlphresearch Jul 2019 I work as a governance researcher at Placeholder and this is my first post on the Zcash forum. Happy to explain the thought process behind our proposal, as well as provide personal opinions on open questions. I hope the community welcomes the relative newcomer that I am Thank you @boxalex for your comments and questions. boxalex: What i have in mind is how the current founders reward is distributed: \\==> Block reward % goes to a Zcash adress \\==> from the Zcash adress it’s distributed to the different recepients, founders, employees, whomemver. \\==> From exactly these founders, employees, whomever ECC gets the “donations” or funding. That’s my impression how it currently works and in my book this is an absolutly wrong setup. Or in case you exactly have this in mind the the protocol change should modified and 70% go to Protocol Development and 30% to Growth Fund by default? Still, who will be in charge to decide what gets used for what? Yes, the 70/30 split between “Protocol Development” and “Growth Funds” could be written into the protocol. Your question about who decides how the funds are used thereafter is of course absolutely critical and central to our proposal. As discussed in the initial post by @cburniske, the “Protocol Development” funds could be controlled - similarly to trademark-related decisions - by a 2-of-2 multisig shared between the ECC and the ZF, subject to semi-formalized input from the Zcash community as a whole. Prior to each funding period, both the ECC and the ZF (and potentially other teams supporting development or working on alternative implementations) could publish past progress reports and future work plans that are reviewed by the miners, ZEC holders, and other interested community members with access to various feedback mechanisms that allow them to signal their approval/disapproval and concerns. It is my understanding after attending Zcon1 that both the ECC and the ZF are committed to putting in place the necessary systems for measuring community sentiment and publishing justifications for their decisions. Could the ECC and the ZF decide against the measured preferences of certain parts of the community? Strictly speaking - yes. But such action would not be without consequences and I would expect both organizations to treat community feedback with great care and consideration. The described governance mechanism guarantees continued funding, but introduces certain checks and balances, allows increased community involvement in decision-making, and democratizes access to the funds. Depending on one’s point of view, it may not feel ideal, but all things considered, we hope it is also seen as a reasonable compromise given our current understanding of the challenges faced by decentralized projects/networks such as Zcash. boxalex: Seriously? A multi-million dollar on-going lawsuite is not a concern? Just in case the law-suite is begin lost others could follow and this should at very least be a concern in my opinion. And in case one or more such law-suites are lost in future, who is paying these multi-million dollar fines/compensations? We are in conversations with the ECC to better understand this issue. boxalex: But it’s less than half of the story to use NIC’s numbers without US$ conversations in how much a given funding has generated. I agree, although it’s important to note that these allocations are made under a lot of uncertainty. No one can accurately predict the future value of assets tied to the development of innovative technologies like Zcash. Of course the relative percentages don’t tell the whole story in retrospect, but they do provide context for a comparison in which Zcash falls well below the average in the set considered. boxalex: How many crypto projects are you/we aware that have ~$300-$400M raised within 4 years? Such information should not be too difficult to find, especially in the context of the crazyness of 2017 and early 2018. boxalex: Was/is the current Founders Reward really distributed good enough to favour R&D, the product itsellf and development or should this be improved. Avoiding this question automaticly leads to unability to improve whatever. I think there are several proposals, including ours, that aim to address this question and suggest ways to improve the management of developer funds. boxalex: My personal opinion is that it’s at least strange to talk about a new dev fee or modified founders reward without analyzing the current one. And you has a financial investment company for sure have done such analysis allready, but i guess that this point doesn’t favour the discussion with a 20% new fee. I think that’s a completely valid opinion and is clearly part of the public discussion/consideration. But let’s assume, simply for the sake of argument, that we decide to spend time digging further into the details of how funds have been used thus far and arrive at a conclusion that it has been done in a suboptimal way and there is considerable room for improvement. Assuming that there’s sufficient agreement for some type of protocol-level funding to remain in place, the next step would be to come up with ways to increase community involvement in governance and improve transparency and accountability, correct? It appears to me that this is what we are already working on. boxalex: Not that this matters, but it was my suggestion in another proposal to use this kind of election to get the best result (you even linked it in your first post). Correct. It was an interesting suggestion and we thus decided to mention it in our analysis. I will reply separately to concerns raised in this thread about the possible shortcomings of such a system. boxalex: However, even such very fair “election process” isn’t worth 2 cents if for-up the opinion gets manipulated. In my opinion posting your and only your proposal on the 76k followers Twitter account of the ECC is not fair towards all other proposals and someone can allready consider this manipulation of opinios to get a higher support for a given proposal. This said, the best election process is worth nothing if things are decided (manipulated) from start. In my opinion, community members should be informed about all proposals. This is a good moment to come up with some procedural rules that everyone can accept as fair, thus adding to the legitimacy of the final outcome. boxalex: And of course some following questions in this scenario, do we need a foundation than at all if the foundation itself wants only very limited (legal) responsibility and accountness. I mean if the whole role of the foundation is just or mainly here and there some grant approving than this could be implented as well in the ECC and at least safe some funds. I think having two separate and independent entities (potentially more in the future) is important and, based on my impressions thus far, I see the Foundation’s role as clearly distinct from the ECC. There is obviously some overlap (e.g. in development work) but this is by design. For example, the ZF is responsible for maintaining an alternative implementation of the protocol which makes the network less dependent on the ECC. boxalex: it’s worth thinking about if the foundation should have more control than now over funds or not in the name of more transparency, fairer distribution and eventually even generating competition with the Zcash projects development. I completely agree. The 2-of-2 multisig that was suggested at Zcon1 and that we support in our proposal gives the ZF considerable power. It is my understanding that this effectively includes the right to veto certain decisions that the ZF sees as misaligned with the common and long-term interest of the network as a whole. boxalex: Why over time and not within the introduction of a new def fee or even bevor? One of my main concerns is that there is lacking whatever control on how funds are used and as stated even more as we talk here about a for-profit-company which leaves less possibilities for transparency and control than a foundation in principe. So what’s the idea on how to improve transparency and control further with a new dev fund? We have suggested that funding decisions should be subject to community feedback and approved/justified on a semi-annual or annual basis, potentially tied to the NU schedule. The granularity of regularly submitted progress reports and road maps is an open question. Should a new developer fund be introduced as part of NU4, the most recent Transparency Report (or subsequent ones before the 2020 halving) could serve as the baseline for the first round of funding proposals under the new governance mechanism. The exact details of this can be worked out over time but a basic description of what constitutes “sufficient transparency” should be included in the ZIPs put on table at the end of August. boxalex: The ZF doesn’t play a role here in my opinion as it has no direct influence at all on any Zcash decision. At best some day maybe they could be something decision-influencing but until that point their independence doesn’t affect anything at all. As pointed out by @sonya, this is not an accurate description of the de facto rights and power the ZF already holds. These would be enlarged under a 2-of-2 multisig system where decisions concerning the trademark and potentially the use of developer funds would have to be confirmed by both the ECC and the ZF to go through. Each decision would be preceded by a community review/feedback period and both organizations would accompany their decisions with a public statement on how/why they arrived at a particular outcome. At least that was my takeaway from discussions at Zcon1 and we’ve broadly supported such a vision in our proposal as well. 2 Replies 1 ​ Invalid date Invalid date"
    },
    {
      "url": "https://www.quora.com/What-is-the-correct-phrase-for-spending-a-lot-of-time-digging-into-every-detail-about-a-topic-and-wherever-that-topic-leads-Ive-always-used-down-a-rabbit-hole-but-it-appears-that-might-imply-a-bizarre-experience",
      "content": "2024-2025 Season: 4 Topics Research + 4 Activity Units | Future Problem Solving Official Store Skip to content The Future of History Research Unit for the 2025 International Conference is available. Shop now Visit Our Website 123 Facebook YouTube Instagram Linkedin Menu Shop All Current Season Topics Programs Problem Solving Everything Else Open Affiliate Registration Evaluator Resources My Account Cart Search Search Close Search our Store by Title, Topic, Program, or Keyword × $133.00 2024-2025 Season: 4 Topics Research + 4 Activity Units This 8 unit set, available in Download PDF format only, includes the following: Practice Problem 1 – Food Security Research and Activity Units Practice Problem 2 – Rising Sea Levels Research and Activity Units Qualifying Problem – Agricultural Industry Research and Activity Units Affiliate Finals Problem – Nanotechnology Research and Activity Units BEST VALUE: Buying all topics together SAVES ~30%! 2024-2025 Season: 4 Topics Research + 4 Activity Units quantity Add to cart SKU: 24-25COMBO Categories: 2024-25 Materials, All Topics, Shop All Products, Global Issues Description Description Research Units Each 2024-2025 topic research unit contains a wealth of curricular resources for use with students in a variety of settings, including out-of-school time. Also, our curated list of suggested topic-specific readings and digital resources for the topic contains helpful summaries. What’s inside: Research: Topic introduction, themes and concepts, overview, and vocabulary Readings: Curated list of topic articles, article summaries, and additional digital sources Resources: Discussion topics, learning prompts, and assessment tools Each purchase includes supplemental materials with more problem-solving tools to help students apply creative thinking to their topic research and analysis. See the individual product pages for the table of contents for each research unit. Activity Units Our 2024-2025 topic activity units incorporate best practices and contain highly engaging activities on the same topics as our research units. What’s inside: Step-by-step lesson plans for research-based independent and collaborative work 2-3 extra topic-related future scenes for practice A variety of tools, research, and metacognition activities A variety of specific problem-solving step activities For more information on the focus areas of each activity included and the education standards addressed, see the individual product pages to view the content summary grids for each topic activity unit. Purchase does not permit reproduction of any part of the book for an entire school, special programs, school district or school system, or for commercial use. Such use is strictly prohibited. If you are located in Australia, New Zealand, Singapore, or Thailand, contact your local Future Problem Solving affiliate to purchase program materials for the season. You may also like… 2024-2025 Season: 4 Topics Research Units ----------------------------------------- $76.00 Add to cart 2024-2025 Season: 4 Topics Activity Units ----------------------------------------- $81.00 Add to cart Related products Rising Sea Levels Activity Unit (2024-2025 Practice Problem 2) -------------------------------------------------------------- $25.00 Add to cart Agricultural Industry Research + Activity Units (2024-2025 Qualifying Problem) ------------------------------------------------------------------------------ $40.00 Add to cart Nanotechnology Research + Activity Units (2024-2025 Affiliate Finals Problem) ----------------------------------------------------------------------------- $40.00 Add to cart Urbanization Virtual Lessons (Online Course) -------------------------------------------- $10.00 Add to cart Future Problem Solving Program International is a 501(c)(3) nonprofit organization. Federal Tax ID: 42-1234706 About Us Who We Are Our Impact Resources Library Topics Center International Conference Contact Get Involved Find FPS Near Me Volunteer Alumni Partner With Us Donate Get Started Visit Our Website Our problem solvers learn how to think, not what to think, and gain lifelong skills Facebook YouTube Instagram Linkedin Privacy Policy Shipping and Refund Policy Terms of Use Copyright © 2025 FPSPI, Inc. Education Soul by WEN Themes Accessibility close Toggle the visibility of the Accessibility Toolbar keyboard Keyboard Navigation visibility_off Disable Animations nights_stay Contrast format_size Increase Text text_fields Decrease Text font_download Readable Font title Mark Titles link Highlight Links & Buttons Powered with _favorite_Love by Codenroll We use cookies to ensure that we give you the best experience on our website.I AcceptDeclineLearn More",
      "title": "2024-2025 Season: 4 Topics Research + 4 Activity Units | Future Problem Solving Official Store Skip to content The Future of History Research Unit for the 2025 International Conference is available. Shop now Visit Our Website 123 Facebook YouTube Instagram Linkedin Menu Shop All Current Season Topics Programs Problem Solving Everything Else Open Affiliate Registration Evaluator Resources My Account Cart Search Search Close Search our Store by Title, Topic, Program, or Keyword × $133.00 2024-2025 Season: 4 Topics Research + 4 Activity Units This 8 unit set, available in Download PDF format only, includes the following: Practice Problem 1 – Food Security Research and Activity Units Practice Problem 2 – Rising Sea Levels Research and Activity Units Qualifying Problem – Agricultural Industry Research and Activity Units Affiliate Finals Problem – Nanotechnology Research and Activity Units BEST VALUE: Buying all topics together SAVES ~30%! 2024-2025 Season: 4 Topics Research + 4 Activity Units quantity Add to cart SKU: 24-25COMBO Categories: 2024-25 Materials, All Topics, Shop All Products, Global Issues Description Description Research Units Each 2024-2025 topic research unit contains a wealth of curricular resources for use with students in a variety of settings, including out-of-school time. Also, our curated list of suggested topic-specific readings and digital resources for the topic contains helpful summaries. What’s inside: Research: Topic introduction, themes and concepts, overview, and vocabulary Readings: Curated list of topic articles, article summaries, and additional digital sources Resources: Discussion topics, learning prompts, and assessment tools Each purchase includes supplemental materials with more problem-solving tools to help students apply creative thinking to their topic research and analysis. See the individual product pages for the table of contents for each research unit. Activity Units Our 2024-2025 topic activity units incorporate best practices and contain highly engaging activities on the same topics as our research units. What’s inside: Step-by-step lesson plans for research-based independent and collaborative work 2-3 extra topic-related future scenes for practice A variety of tools, research, and metacognition activities A variety of specific problem-solving step activities For more information on the focus areas of each activity included and the education standards addressed, see the individual product pages to view the content summary grids for each topic activity unit. Purchase does not permit reproduction of any part of the book for an entire school, special programs, school district or school system, or for commercial use. Such use is strictly prohibited. If you are located in Australia, New Zealand, Singapore, or Thailand, contact your local Future Problem Solving affiliate to purchase program materials for the season. You may also like… 2024-2025 Season: 4 Topics Research Units ----------------------------------------- $76.00 Add to cart 2024-2025 Season: 4 Topics Activity Units ----------------------------------------- $81.00 Add to cart Related products Rising Sea Levels Activity Unit (2024-2025 Practice Problem 2) -------------------------------------------------------------- $25.00 Add to cart Agricultural Industry Research + Activity Units (2024-2025 Qualifying Problem) ------------------------------------------------------------------------------ $40.00 Add to cart Nanotechnology Research + Activity Units (2024-2025 Affiliate Finals Problem) ----------------------------------------------------------------------------- $40.00 Add to cart Urbanization Virtual Lessons (Online Course) -------------------------------------------- $10.00 Add to cart Future Problem Solving Program International is a 501(c)(3) nonprofit organization. Federal Tax ID: 42-1234706 About Us Who We Are Our Impact Resources Library Topics Center International Conference Contact Get Involved Find FPS Near Me Volunteer Alumni Partner With Us Donate Get Started Visit Our Website Our problem solvers learn how to think, not what to think, and gain lifelong skills Facebook YouTube Instagram Linkedin Privacy Policy Shipping and Refund Policy Terms of Use Copyright © 2025 FPSPI, Inc. Education Soul by WEN Themes Accessibility close Toggle the visibility of the Accessibility Toolbar keyboard Keyboard Navigation visibility_off Disable Animations nights_stay Contrast format_size Increase Text text_fields Decrease Text font_download Readable Font title Mark Titles link Highlight Links & Buttons Powered with _favorite_Love by Codenroll We use cookies to ensure that we give you the best experience on our website.I AcceptDeclineLearn More"
    }
  ],
  "researchSummary": "GitHub - PikaMug/PlaceholderExpansion-Quests: Provides quest variables for PAPI usage Skip to content Navigation Menu Toggle navigation Sign in Product GitHub Copilot Write better code with AI Security Find and fix vulnerabilities Actions Automate any workflow Codespaces Instant dev environments Issues Plan and track work Code Review Manage code changes Discussions Collaborate outside of code Code Search Find more, search less Explore All features Documentation GitHub Skills Blog Solutions By company size Enterprises Small and medium teams Startups Nonprofits By use case DevSecOps DevOps CI/CD View all use cases By industry Healthcare Financial services Manufacturing Government View all industries View all solutions Resources Topics AI DevOps Security Software Development View all Explore Learning Pathways Events & Webinars Ebooks & Whitepapers Customer Stories Partners Executive Insights Open Source GitHub Sponsors Fund open source developers The ReadME Project GitHub community articles Repositories Topics Trending Collections Enterprise Enterprise platform AI-powered developer platform Available add-ons Advanced Security Enterprise-grade security features GitHub Copilot Enterprise-grade AI features Premium Support Enterprise-grade 24/7 support Pricing Search or jump to... Search code, repositories, users, issues, pull requests... Search Clear Search syntax tips Provide feedback We read every piece of feedback, and take your input very seriously. Include my email address so I can be contacted Cancel Submit feedback Saved searches Use saved searches to filter your results more quickly Name Query To see all available qualifiers, see our documentation. Cancel Create saved search Sign in Sign up Reseting focus You signed in with another tab or window. Reload to refresh your session. You signed out in another tab or window. Reload to refresh your session. You switched accounts on another tab or window. Reload to refresh your session. Dismiss alert {{ message }} PikaMug ",
  "coreTopic": "The main topic here revolves around software development and collaboration tools, specifically focusing on GitHub functionalities. It discusses features related to coding, code management, and collaboration, along with mentions of AI integration, security measures, and community support for developers. Overall, it's about enhancing the software development process using GitHub's platform and tools.",
  "brandInfo": "\n      Website: https://foundertoolkit.org/\n      Brand: foundertoolkit\n      Products: No product images\n      Description: Backed by learnings and experience of solopreneurs who built tech startups doing 1M+ ARR\n\n      Documents: No documents\n      Logo: No logo\n      Posts/Videos: No posts/videos\n      Taglines: None\n      Colours: No colours\n      Country: global\n    ",
  "youtubeVideo": "https://www.youtube.com/watch?v=8JJ101D3knE",
  "internalLinks": [
    "/blog/tips-for-growth",
    "/resources/ecommerce-guide"
  ],
  "references": [
    "https://foundertoolkit.org/",
    "https://forums.sufficientvelocity.com/threads/placeholder-quest-i-want-to-write-a-quest-pick-which-one-you-want.128591/page-3",
    "https://bethandersonwriter.com/2022/12/02/behind-the-scenes-using-placeholder-words-and-stanzas-until-the-lightbulb-moment-by-debra-shumaker/",
    "https://www.researchgate.net/publication/327161657_How_deep_do_we_dig_Formal_explanations_as_placeholders_for_inherent_explanations",
    "https://soggymusings.wordpress.com/2017/06/05/using-placeholders/",
    "https://meta.discourse.org/t/hide-the-topic-template-placeholder-text/279380",
    "https://www.cui.edu/studentlife/writing-studio/voice-paint-blog/post/placeholder-title-change-later-the-importance-of-placeholders-in-essay-writing",
    "https://forum.zcashcommunity.com/t/placeholder-considerations-resources-governance-and-legitimacy-in-nu4/34045",
    "https://www.quora.com/What-is-the-correct-phrase-for-spending-a-lot-of-time-digging-into-every-detail-about-a-topic-and-wherever-that-topic-leads-Ive-always-used-down-a-rabbit-hole-but-it-appears-that-might-imply-a-bizarre-experience",
    "https://www.youtube.com/watch?v=8JJ101D3knE"
  ],
  "existingPosts": "",
  "targetKeywords": [],
  "timestamp": "2025-03-04",
  "nudge": "b80lz"
}